[{"title": "Construction Laborer", "company": "San Marcos Wood Products", "location": "San Marcos, CA 92078", "job url": "Not Available", "description": "$28,000 a yearMust have a clean and valid drivers license. Willing to learn all phases of residential remodeling. This job also will teach you the process of manufacturing custom cabinetry.Job Type: Full-timeSalary: $28,000.00 /yearExperience:Construction: 1 year (Preferred)general labor: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "SOUTHWEST MOBILE", "location": "Chula Vista, CA 91911", "job url": "Not Available", "description": "$13 an hourconstruction laborer: painting, grinding, minor welding, misc\\Full time plus benefitsMon thru Fri 6:30 - 3:00Job Type: Full-timeSalary: $13.00 /hourExperience:Construction: 1 year (Preferred)general labor: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "Swift Tradesman", "location": "San Diego, CA", "job url": "Not Available", "description": "$12.25 - $14.00 an hourPart-time, TemporaryGeneral labor/ construction workers wanted ASAP. Labor work can consist of: sweeping, picking up trash, flagging, digging trenches, laying fiber rolls or other tasks as delegated. Start THIS WEEK! Call 858-437-9952 / 760-610-4970 or come in and apply!Swift Tradesman: 7670 Clairemont Mesa Blvd San Diego CA 92111Job Types: Full-time, Part-time, TemporarySalary: $12.25 to $14.00 /hourExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Worker/Laborer", "company": "Mr. Build Construction", "location": "Irvine, CA 92602", "job url": "Not Available", "description": "Desired: Construction ExperienceDriver's LicenseMr. Build ConstructionWe need an experienced and responsible construction laborer like you to join our construction company. We are looking for someone with the following trades: framing, drywall, stucco, painting. Join our team and learn how fulfilling it is to be rewarded appropriately for your efforts while you develop your skills and learn the newest construction techniques in a fast-paced environment.Job ResponsibilitiesOperate a variety of hand and power tools, including drills, forklifts, skid loaders and other tools as directed by management.Clean and prepare construction sites as needed, including erecting scaffolding, removing and properly disposing of debris and waste materials, and digging trenches.Shovel materials to and from construction areas, including asphalt and dirt.Follow all safety procedures on the job site and report violations immediately to management.Maintain a safe and clean job site by handling materials and storing them properly, picking up and removing all tools and equipment when not in use, and securing the job site on a daily basis.Load and unload construction supplies from trucks both manually and with the use of equipment.Job Skills & QualificationsRequired:Valid drivers licenseOne or more years of experience in constructionAbility to lift heavy equipmentJob Type: Full-time"}, {"title": "Construction Laborer", "company": "Bighorn Grading &amp; Engineering, Inc.", "location": "Temecula, CA 92592", "job url": "Not Available", "description": "$18 - $22 an hourLaborer needed for a small grading contractor for work in Riverside County, San Bernardino County, Orange County, San Diego County and possibly elsewhere. Minimum 2 years experience, dependable transportation, great driving record, must pass a drug test and background check. May have the opportunity to learn how to run heavy equipment and check grade. Ability to perform light mechanical work is also a plus.Job Type: Full-timeSalary: $18.00 to $22.00 /hour"}, {"title": "DEMOLITION LABORER", "company": "ALL-PRO Demolition", "location": "San Diego County, CA", "job url": "Not Available", "description": "Part-timeJoin our crew to work on various demolition projects around San Diego County as a Demolition Laborer.\n\nPart-time as needed (20-40 hours per week)\n\nCompetitive pay based on experience\nDemolition experience required\n\nRequirements: Physical strength, endurance, experience operating demolition equipment."}, {"title": "Construction Laborer", "company": "Metrobuild LLC", "location": "New York, NY", "job url": "Not Available", "description": "$15 - $20 an hourFull-time laborer able to do light demolition, clean-up, some plaster and painting.Job Type: Full-timeSalary: $15.00 to $20.00 /hourExperience:Construction: 1 year (Preferred)Work authorization:United States (Required)"}, {"title": "Construction Laborer/Helper", "company": "Nugen Construction", "location": "Westminster, CA", "job url": "Not Available", "description": "Our Construction is hiring hardworking individuals who has experience in Tiling, Painting, and Drywall.This is a full time position.Please send us your resume.ThanksJob Type: Full-timeExperience:Tiling, Paint, and Drywall.: 2 years (Preferred)"}, {"title": "Cashier", "company": "Builders FirstSource", "location": "San Diego, CA 92111", "job url": "https://www.indeed.com/rc/clk?jk=56a3922249344b75&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Construction Laborer", "company": "Roland Construction", "location": "La Habra, CA", "job url": "Not Available", "description": "Construction workers needed no experience and experience workers needed will train .Dry wall. Painting. Carpentry. Fabrication .concrete. framing must have transportation must have positive attitude starting time 7amCall roloJob Type: Full-timeExperience:Construction: 1 year (Preferred)"}, {"title": "General Construction Laborer", "company": "Dover Construction", "location": "Vacaville, CA 95688", "job url": "Not Available", "description": "$36,000 - $55,000 a yearHard-working experienced General construction laborer, framing, demo, Electrical, Plumbing, sheetrock. More skills more pay Tools a PlusJob Type: Full-timeSalary: $36,000.00 to $55,000.00 /yearExperience:Construction: 2 years (Preferred)"}, {"title": "Construction Laborer", "company": "A.M. Ortega Construction", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=4610cbe80b69477e&from=vj&pos=top", "description": "Candidate must be able to perform tasks involving physical labor at but not limited to roadway, heavy construction projects, gas pipeline, paving restoration project. May operate a variety of hand and power tools. May clean and prepare sites, dig trenches, set braces and shoring to support the sides of excavations, clean up rubble and debris and remove waste materials.\n\nRequirements:\n\nSome knowledge of proper use of equipment, materials and supplies used in heavy/highway construction work\nSome knowledge of first aid and applicable safety precautions\nAbility to work independently and complete daily activities according to work schedule\nAbility to lift heavy objects 50-60 lbs. on a regular basis, walk and stand for long periods of time and perform strenuous physical labor under adverse field conditions\nAbility to communicate orally and in writing\nAbility to use equipment and tools properly and safely\nAbility to understand, follow and transmit written and oral instructions\nAbility to meet attendance schedule with dependability and consistency\nPrior natural gas pipeline experience is a plus"}, {"title": "Construction Laborer", "company": "Penna Construction Inc.", "location": "Dana Point, CA", "job url": "Not Available", "description": "$18 - $20 an hourPenna Construction Inc. is a licensed general contracting firm in Southern California specializing in residential and commercial projects. Penna Construction is well versed in concrete construction methods and is a proud certified I.C.F installer. We have been a family owned business at the same location in Capistrano Beach since 1956 and have an outstanding track record of providing our customers with quality solutions, exceptional service and excellent craftsmanship.This is an entry level position (level one), there are opportunities to learn more skills and advance in this trade and our company.Skills Required: Ability to perform basic manual labor with sufficient energy. Must be motivated, have strong work ethic, good communication skills, and able to work with a team.Job Requirements: This job requires concrete work, digging, using hand tools, power tools, and lightweight machinery. Being able to lift 90+ lbs (usually a bag of concrete mix is 90 lbs). We would also like someone who can read precise measurements. Motivated to learn how to read and understand project plans and details.Job Type: Full-timeSalary: $18.00 to $20.00 /hourExperience:Concrete Construction: 2 years (Preferred)Location:Dana Point, CA (Preferred)License:Driver's (Required)Language:English (Required)Work authorization:United States (Required)"}, {"title": "Construction Laborer", "company": "Rancho Energy", "location": "Escondido, CA", "job url": "Not Available", "description": "$13 - $15 an hourDesired: Clean Driving RecordProfessional carpenter/ handyman.you will be needing basic carpentry skills and have basic carpentry tools for the following installs.-weather stripping doors-door shoes and thresholds-door jamb-door knobs and viewers-door sweeps-door striker plates-door hingesBasic handyman knowledge of the following installs.-shower heads-putting together stand up lamps-caulking around windows-identifying gas from electric heatingA clean driving record is needed as you will be driving our company trucks. Spanish speaking is a plusLooking for full time. Pay based on experience.Job Type: Full-timeSalary: $13.00 to $15.00 /hour"}, {"title": "Construction Laborer", "company": "Allied Glass &amp; Door", "location": "Palm Springs, CA 92264", "job url": "Not Available", "description": "$12.50 - $18.50 an hourDesired: Driver's LicenseConstruction Manual Labor Job needs to be filled, looking to hire 1-3 workers.Job details include* Lifting/Moving* Cleaning* Organzing* Helping with ConstructionJob Type: Full-timeSalary: $12.50 to $18.50 /hourLicense:Driver's License (Required)"}, {"title": "Construction Laborer", "company": "Bonanno Construction", "location": "Woburn, MA 01801", "job url": "Not Available", "description": "$600 - $720 a weekBasic construction laborer. Some digging and carrying of construction materials. Mixing cements and mortars.Job Type: Full-timeSalary: $600.00 to $720.00 /weekShifts:Morning (Required)"}, {"title": "(RENO) Construction Cleaner", "company": "Tesla", "location": "Sacramento, CA", "job url": "Not Available", "description": "$17 - $18 an hourTHIS JOB IS LOCATED IN RENO, NV. RELOCATION ASSISTANCE IS AVAILABLE. DescriptionThe RoleThe Construction cleaner will report to the construction supervisor and will be responsible for a variety of light construction cleaning in and around the Tesla Gigafactory construction projects. Excellent attendance is crucial for the team to achieve success. The ideal candidate has a proven record of success in fast-paced environments. He/she must have the ability to work with and communicate with cross-functional teams. The successful candidate for this position takes pride in his/her hands-on and abilities, organization skills and attention to detail. He/she appreciates an environment where superior work is encouraged, noticed and rewarded. This role will work a Monday-Friday day schedule.ResponsibilitiesFollow all health and safety regulationsClean and clear light debris and do housekeeping of construction areasComplete tasks as directed by supervisor in a timely manner.Maintain a clean and orderly work areaPhysical work including but not limited to pushing, pulling, gripping, sweeping and vacuumingRequirementsMust have a command of the English language, both written and verbal.Must be reliable, have good initiative, be committed, and be quality focused.Ability to lift up to 50 lbs. as needed.Ability to work with a team and in a fast-paced environment.Must be reliable, have good initiative, committed, and quality focused.A valid U.S. drivers license and acceptable driving record (subject to review).Positive energy and attitude are a must.Job Type: Full-timeSalary: $17.00 to $18.00 /hour"}, {"title": "Construction Worker", "company": "Advance forward construction inc", "location": "Roseville, CA 95678", "job url": "Not Available", "description": "$40,000 a yearWe are a up and coming construction company just starting insurance work looking for guys who can get the job done and have experience in all areas of the construction industry someone who is intense and brings talent and drive to our creJob Type: Full-timeSalary: $40,000.00 /yearExperience:Construction: 4 years (Preferred)general labor: 2 years (Preferred)Seasonal job:No"}, {"title": "Construction Administrative Assistant", "company": "Erickson-Hall Construction Co.", "location": "Encinitas, CA", "job url": "https://www.indeed.com/rc/clk?jk=f64fc94f8e4c80b4&from=vj&pos=top", "description": "Do you want to be a part of a leading construction company that has completed over $1 billion in successful construction projects? You have an opportunity to be a part of a creative, values-driven, positive-thinking San Diego based organization. Please note this position is around North County, San Diego (Encinitas/VIsta/San Marcos)\nAs an Administrative Assistant at Erickson-Hall Construction Co. you will grow your skills, knowledge, and learn best practices from an industry innovator.\nTo be successful in this position you will need to be open to learning, disciplined and systems driven, detail-oriented, comfortable working independently, and have a genuine interest in helping team members with a positive and pro-active attitude.\nDuties:\nAdministrative support on active construction site to site-based project team\nWork with Superintendent, Project Manager, Project Engineer, Construction Manager and team to understand scope of work, schedule, project instructions and responsibilities\nData entry: Daily reports, RFI and Submittal Logs\nTrack DSA inspection logs, Skilled & Trained workforce, and contractors insurance\nMaintain jobsite specific SDS and postings\nAbility to take meeting minutes\nMaintain the physical and electronic filing system for each job adhering to company standards\nFollow up with responsible parties to obtain/coordinate project information\nRequirements\nExcellent attention to details and facility with numbers\nAbility to prioritize and multi-task, in a busy office environment\nAbility to work under minimum supervision & resolve issues independently based on project/company standards and verification of facts prior to releasing documents to client or outside agencies\nSelf-starter with strong multi-tasking and follow-up skills\nIdentifies and resolves problems in a timely manner\nGood judgment, logic, and ability to learn new things quickly\nResponds to requests for service and assistance\nSuperb organizational skills and desire to get it right\nMust have good communication, teamwork, and organizational skills\nProficient knowledge of Microsoft Office Suite.\nOracle Primavera Contract Manager, Oracle Submittal Exchange, Bluebeam, and/or construction knowledge a plus.\nTyping of at least 50 wpm with emphasis on accuracy\nA valid driver's license and acceptable driving history is required\nMust possess a high school diploma or GED\nBenefits\nSalary Range of $17-$20 (DOE)\n100% employer paid Health/Dental coverage for team members\nGenerous Vacation and Sick Time off\nNine(9) Paid Holidays - Including your Birthday!\n100% employer paid Life, AD&D, and Long Term Disability insurance\nRetirement plan with company contribution\nAcknowledgments\nErickson-Hall Construction Co. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to any of the following, whether actual or perceived or based upon identification or association: race, color, religious creed, national origin, ancestry, age, medical condition, pregnancy or childbirth (and related medical conditions), physical or mental disability, genetic information, sex, gender (including gender identity and gender expression), sexual orientation, marital status, registered domestic partner status, military status, veteran status, political activity or affiliation or any other basis protected by law."}, {"title": "Laborer (105045)", "company": "California State University", "location": "San Luis Obispo, CA", "job url": "https://www.indeed.com/rc/clk?jk=7b1b505f52abd388&from=vj&pos=top", "description": "$2,798 - $3,800 a month#105045 - Laborer\nAdministration and Finance - Facilities\n$2,798 - $4,901 per month\n(Anticipated hiring range: $2,798 - $3,800 per month)\nOpen Until Filled\nNOTE: This position is for the Floor Crew shift, working Monday - Friday, 7:00pm - 3:00am, and may adjust to meet operational needs.\nTo apply directly to this position, please copy and paste this link directly into your web browser: www.calpolyjobs.org/applicants/Central?quickFind=167096"}, {"title": "Construction Laborer", "company": "Allied Glass &amp; Door", "location": "Palm Springs, CA 92264", "job url": "Not Available", "description": "$12.50 - $18.50 an hourDesired: Driver's LicenseConstruction Manual Labor Job needs to be filled, looking to hire 1-3 workers.Job details include* Lifting/Moving* Cleaning* Organzing* Helping with ConstructionJob Type: Full-timeSalary: $12.50 to $18.50 /hourLicense:Driver's License (Required)"}, {"title": "Park Ranger Assistant", "company": "County of Solano", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=f0d9c11868bfa016&from=vj&pos=top", "description": "$44,291 - $53,836 a yearPart-timeProviding a Safe Environment for Fun & Relaxation\nThe Department of Resource Management is a comprehensive agency comprised of the Public Works, Building and Safety, Planning Services, Environmental Health Services, Parks, and Administrative Services Divisions. The department provides for the well-being of Solano County's present and future residents and the public at-large through administration and enforcement of Federal, State, and Local laws and policies pertaining to transportation, building construction, land use planning environmental health, and recreation.\nThe Parks & Recreation Division of the Department of Resource Management is the steward of Solano County's natural and cultural resources. The Division creates safe environments and showcases the County's facilities in order for visitors to enjoy diverse recreational experiences.\n\nTo learn more about the Parks and Recreation Division, please visit: http://www.solanocounty.com/depts/rm/countypark/homepage.asp\n\nThe Position\nPark Ranger Assistants under general supervision perform routine grounds maintenance work in County Parks, collect fees, enforce County Park regulations, perform techniques and procedures to keep parks clean and safe, and assist the Park Ranger with providing visitor services and protecting the natural resources of the parks. The four areas that you may be assigned to are:\n\nLake Solano located in Winters, which is shaded riverside setting with campgrounds, a nature center, a day park with picnic areas, fishing, and non-motorized boat rental.\nSandy Beach located in Rio Vista, is the only local sand beach on the Sacramento River, which has campgrounds, picnic grounds, and a boat launch.\n\nLynch Canyon Open Space Park located in Vallejo, has a hilly, natural landscape with 10 miles of trails for hiking, birdwatching, trail running, horseback riding and mountain biking.\n\nBelden's Landing Boat Launch located in Suisun City, which is a great place to go boating or fishing off the pier.\n\nTo learn more about park location and amenities offered at each park click here: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=19543\n\nThe eligible list established from this recruitment will be used to fill full-time and part-time regular, limited-term or extra-help positions as vacancies occur or the need arises.\nPOSITION REQUIREMENTS\n\nEDUCATION: High School Diploma, GED or equivalent;\n\nEXPERIENCE: Six (6) months of experience in grounds keeping or semi-skilled maintenance work that included considerable contact with the public.\n\nLICENSING, CERTIFICATION AND REGISTRATION REQUIREMENTS:\nApplicants are required to possess a valid California Drivers License, Class C.\n\nIncumbents will be required to obtain first aid and CPR certifications within the probationary period.\n\nNote: All licenses and certificates must be kept current while employed in this class.\n To view the job description for this position, please visit:\nhttp://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=16073\nBENEFITS\nSolano County offers a cafeteria-style medical package with health benefits, offered through CalPERS. The County contribution for family coverage for the 2018 calendar year is $1,520.73 per month. The County offers a cash back provision for those who choose employee-only or who waive medical insurance coverage. The County may offer a supplemental contribution for employees enrolled in Employee plus Two or More coverage.\nDental and vision insurances for the employee and eligible dependents are paid 100% by the County.\n\nSolano County participates in CalPERS retirement and contributes to Social Security.\nThe County observes 12 fixed, paid holidays per year.\n\nVacation is accrued at approximately 10 days per year for the first 3 years.\nSick leave accrues at approximately 12 days per year.\nEmployees are eligible to receive an additional 2.5% longevity pay, per level, after the completion of continuous service at 10, 20, 25, 30, 35 years.\n\nTo view the benefits for a regular position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=16477\n\nExtra-help employees who work less than 29 hours per week do not typically receive or accrue benefits of regular employees during their period of employment. All extra-help employees accrue .034 hours of Sick Leave for every full hour worked.\n\nTo view the benefits for an extra-help position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=21216\nSelection Process\n11/28/2018  Deadline to submit application.\n12/13/2018  Tentative date for written exam for most qualified applicants.\nBased on the information provided in the application documents, the qualified applicants may be invited for further examination and will either be pre-scheduled by the Department of Human Resources or be invited to self-schedule. All applicants meeting the minimum qualifications are not guaranteed advancement through any subsequent phase of the examination. Depending upon the number of applications received, the selection process may consist of an initial application screening, a mandatory information meeting, a supplemental questionnaire assessment, a written and/or practical exam, an oral board exam, or any combination listed. Responses to supplemental questions may be used as screening and testing mechanisms and will be used to assess an applicants ability to advance in the process; as such, responses to supplemental questions should be treated as test examination responses. Information contained herein does not constitute either an expressed or implied contract.\n\nA minimum score of 70% is required to continue in the selection process, unless otherwise announced.\n\nAll potential new hires and employees considered for promotion to management, confidential positions or unrepresented positions will be subject to a background and reference check after contingent job offer is accepted. These provisions are subject to change.\n\nRETIREES - Solano County invites all qualified candidates to apply for positions; however pursuant to Government Code Section 21221(h) and 21224, hiring restrictions may apply to California Public Sector Pension Plan Retirees."}, {"title": "Construction Laborer", "company": "Penna Construction Inc.", "location": "Dana Point, CA", "job url": "Not Available", "description": "$18 - $20 an hourPenna Construction Inc. is a licensed general contracting firm in Southern California specializing in residential and commercial projects. Penna Construction is well versed in concrete construction methods and is a proud certified I.C.F installer. We have been a family owned business at the same location in Capistrano Beach since 1956 and have an outstanding track record of providing our customers with quality solutions, exceptional service and excellent craftsmanship.This is an entry level position (level one), there are opportunities to learn more skills and advance in this trade and our company.Skills Required: Ability to perform basic manual labor with sufficient energy. Must be motivated, have strong work ethic, good communication skills, and able to work with a team.Job Requirements: This job requires concrete work, digging, using hand tools, power tools, and lightweight machinery. Being able to lift 90+ lbs (usually a bag of concrete mix is 90 lbs). We would also like someone who can read precise measurements. Motivated to learn how to read and understand project plans and details.Job Type: Full-timeSalary: $18.00 to $20.00 /hourExperience:Concrete Construction: 2 years (Preferred)Location:Dana Point, CA (Preferred)License:Driver's (Required)Language:English (Required)Work authorization:United States (Required)"}, {"title": "Laborer", "company": "City of San Diego", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=7ae9dbc5ad40bacd&from=vj&pos=top", "description": "$14.49 - $17.26 an hourLaborer positions perform manual construction and maintenance work as a member of a crew by lifting, loading, moving, digging and scraping; operate a jackhammer to break pavement for the repair and maintenance of streets and water utilities services; dig water and sewer pipelines and mains; and perform other duties as assigned.\n\n NOTES:\nLaborer employees may be required to lift and carry items weighing up to 100 pounds.\nAfter gaining the requisite experience, Laborer employees may be eligible for career advancement to higher level classifications.\nFor positions in the Public Utilities Department, Water System Operations and Water Construction & Maintenance Divisions, Laborer employees are required to meet the following requirements to career advance to Water Systems Technician I: 1) Possess a California Class A or B Driver License within six months from date of hire and 2) Obtain a Grade D2 or higher Water Distribution Operator Certification issued from the State of California within three years from date of hire. A high school diploma, General Education Development (GED) examination or California High School Proficiency Examination (CHSPE) is required to obtain Distribution Operator Certification. Failure to meet the requirements may result in termination.\nFor positions in the Public Utilities Department, Wastewater Collection Division, Laborer employees are required to meet the following requirement to career advance to Utility Worker I: Possess a California Class A or B Driver License within six months from date of hire. Failure to meet this requirement may result in termination.\nSome positions may require a Confined Space Certificate within six months from date of hire. Employees in this position will be required to maintain the certification as a condition of employment.\n MINIMUM REQUIREMENTS:\nYou must meet the following requirements on the date you apply, unless otherwise indicated.\n\nAGE: 18 years of age or older; except for high school graduates (or persons with GED equivalency) who are 17.\n\nCITIZENSHIP: You must be a United States citizen or have the current legal right to work in the United States.\n\nLICENSE: A valid California Class C Driver License is required at the time of hire.\n\n NOTES:\nSome positions may require a California Class B Driver License at the time of interview or at the time of hire.\nSome positions may require a California Class A or B Driver License within six months from the date of hire.\n\nHIGHLY DESIRABLE:\nLandscaping/landscape maintenance experience including brush cutting/thinning, weeding, planting, digging, use of chainsaws and other hand-held power equipment, and experience in working in rugged terrain with steep slopes.\nExperience/knowledge in working with native plant vegetation.\nPossession of a Water Distribution Operator Certificate issued from the State of California.\nConstruction experience.\nPossession of a valid Qualified Applicator Certificate issued from the State of California Department of Pesticide Regulation.\n SCREENING PROCESS:\nPlease ensure all information is complete and accurate as the responses you provide on the supplemental questions will be reviewed using an automated evaluation system. If you are successful in this initial screening process, your application will be reviewed for applicable education, experience, and/or training to ensure all minimum requirements have been met. Successful candidates will be placed on a list which will be used to fill position vacancies during the next six months (180 days). For each vacancy, only those candidates with the most appropriate qualifications will be contacted by the hiring department for an interview.\n SUPPLEMENTAL INFORMATION:\nPRE-EMPLOYMENT REQUIREMENTS: Employment offers are conditional pending the results of all screening processes that are applicable to this job, which may include but are not limited to the following: Confirmation of citizenship/legal right to work in the United States; completion of a pre-employment medical review/exam (which may include drug/alcohol testing); reference checks; and a fingerprint check. The fingerprints will be submitted to the Federal Bureau of Investigation and the California Department of Justice for a conviction record report. Certain positions may require additional screening processes which may include a polygraph examination and/or background investigation. All of these processes must be successfully completed before employment begins. A positive test for alcohol, illegal drugs, including marijuana, or inadequately explained prescription drugs, misrepresentation, falsification, or omission of pertinent facts in any step of the screening/selection process may be cause for disqualification and/or termination of employment. Nothing in this job posting constitutes an expressed or implied contract for employment with the City of San Diego. Applicants must notify the Personnel Department of any changes in their name, address (home, email), or phone number or they may miss employment opportunities.\n\nRev. 1 - November 16, 2018 (New Recruitment Date)"}, {"title": "Construction Laborer", "company": "NISSHO OF CALIFORNIA, INC.", "location": "Vista, CA 92083", "job url": "https://www.indeed.com/rc/clk?jk=175a9bed6e090c76&from=vj&pos=top", "description": "Our company has been in business for over 35 years. We are looking for dedicated team members to join our company!\n\nThe Laborer performs field labor for digging, trenching and planting for all types of landscape installations.\n\nEssential Duties and Responsibilities include the following. Other duties may be assigned.\nHave the ability to do various types of hand digging along with the proper handling of landscape and irrigation materials.\nBackfill and compaction of trenches and tree holes along with jobsite clean up.\nFollow directions for the foreman and the leadman.\n\nSupervisory Responsibilities:\nThere are no supervisory responsibilities.\n\nQualifications:\nHave the ability to perform essential duties and responsibilities for the position.\n\nBenefits Include:\nVacation and Paid Holidays\nAvailable Medical, Dental & Vision\nOpportunities for Advancement\nCompetitive Pay"}, {"title": "General Skilled Construction Workers Needed", "company": "SB Builders LLC", "location": "Ventura, CA 93001", "job url": "Not Available", "description": "$15 - $27 an hourOur construction company needs Skilled Laborers to staff multiple upcoming projects. Were looking for someone who will show up on time and perform exemplary work. Workers with special skills such as concrete finishing, new drywall construction, framing, electrical and plumbing, etc. (specifically tile setting experience) are in high demand. We provide lots of room for advancement in this new but growing company.Resume preferred but not required.Job Type: Full-timeSalary: $15.00 to $27.00 /hour"}, {"title": "Construction Laborer", "company": "Employnet, Inc", "location": "Riverside, CA", "job url": "Not Available", "description": "$13 - $14 an hourSeeking self motivated and productive employee who thrives in fast paced environment. Temp to Hire and great benefitsRV Manufacturing1st shift 6:00am- 2:35pm Monday- Saturday MUST BE ABLE TO WORK OVERTIMEWE ARE ONLY LOOKING FOR CANDIDATES WHO ARE COMFORTABLE IN MANUFACTURING AND CONSTANTLY USING VARIOUS TOOLS(Or Similar)Work around metal partsMark parts, and insert plugs as needed.Use of electric hand toolsUse computer to pull work ordersRV Building/ ConstructionPerform other duties as neededWork overtime as neededAble to lift up to 55 lbs.Males and FemalesDepartments Available: Mills, Flooring, Shelling, Plumbing, Cabinets, Slides, PDI, Decals, Electrical, Metal, Final Finish, Painter (fiberglass), Lamination, QCJob Type: Full-timeSalary: $13.00 to $14.00 /hourJob Type: Full-timeSalary: $13.00 to $14.00 /hourExperience:Construction: 1 year (Preferred)Work authorization:United States (Required)Seasonal job:No"}, {"title": "Construction Laborer", "company": "Bonanno Construction", "location": "Woburn, MA 01801", "job url": "Not Available", "description": "$600 - $720 a weekBasic construction laborer. Some digging and carrying of construction materials. Mixing cements and mortars.Job Type: Full-timeSalary: $600.00 to $720.00 /weekShifts:Morning (Required)"}, {"title": "Field Office Manager", "company": "Kitchell Corporation", "location": "San Diego, CA 92123", "job url": "https://www.indeed.com/rc/clk?jk=646b9587082056b9&from=vj&pos=top", "description": "We have an exciting opportunity in San Diego, CA for a Field Office Manager with experience working for a general contractor/contractor to join our team! This position will support the field office operations by managing and directing administrative tasks.\n\nDuties and Responsibilities\n\nWelcomes on-site visitors, determines nature of business and announces visitors to appropriate person(s) and or assists visitors as necessary.\nAnswers incoming phone calls, determines purpose of callers, forwards calls to appropriate person(s) or voicemail and logs call as required.\nAnswers questions about field office and provides callers with address, directions and other information.\nOrders and receives office supplies, and arranges for office equipment maintenance.\nPrepares outgoing and distributes incoming mail and express carrier packages.\nCoordinates the maintenance and alteration of field office areas and equipment, including layout, arrangement and housekeeping.\nAssists with the set-up and close of jobsite offices and coordinates with IT and accounting as necessary.\nServes as primary contact to outside vendors as related to administrative jobsite operations.\nCreates, prints, copies, distributes correspondence, reports and other documents, and ensures all correspondence is recorded.\nMaintains systematic retention, protection, retrieval, transfer and disposal of documents and records.\nOrganizes and ensures document control for all submittals and substitutions, and requests for information.\nAssist with project closeout requirements in accordance with contract documents.\nConducts research, compiles and types project reports and maintains project logs.\nPerforms all data entry for the project.\nProcesses client billings and invoices for payment.\nCoordinates and arranges meetings, prepares agendas, reserves and prepares facilities and records minutes of meetings.\nAnswers questions regarding internal administrative processes and procedures and assists individuals as necessary.\nUtilizes safe work practices and follows directives, policies and procedures for assisting and maintaining a healthy and safe work environment.\n\n\nRequirements\nKnowledge and Skills\n\nKnowledge of administrative office procedures and operation of standard office equipment.\nEffective computer skills, including proficient use of Word, Excel, PowerPoint and Outlook software required.\nExcellent verbal and written communication skills, including the ability to represent the company in a professional manner.\nAbility to demonstrate the competencies of achieving results, initiative, communication and teamwork.\nCommitment to the values of Kitchell with attention to honesty and integrity, quality of work and customer satisfaction.\n\nEducation and Experience\n\nHigh school diploma or general education degree and specialized or advanced coursework in office administration or related field required.\nMinimum 3 years position related work experience in office administration or related field, preferably in architecture, engineering and construction management industry.\nEquivalent combination of education and experience accepted.\n\nWork Environment\n\nWhile performing the duties of this job, the employee must regularly work in an office and or construction environment.\nConditions regularly include exposure to outdoor elements, hot/cold temperatures, wet conditions, noise, atmospheric conditions and cramped quarters.\nThe noise level in the work environment is occasionally loud.\n\nPhysical Requirements\n\nWhile performing the duties of this job, the employee must regularly sit, stand, walk, talk or hear and use hands to finger, feel and handle; frequently reach with hands and arms; occasionally climb or balance and stoop, kneel, crouch or crawl.\nSpecific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus.\nMust frequently lift and or move 10 pounds and occasionally lift and or move up to 50 pounds.\n\nAbout Our Company\n\nKitchell is an employee-owned company with a nearly 70-year history in general contracting, construction management, development, facilities management, engineering and architecture and myriad other services within the built environment. Our employee-owners manage projects from main offices in Arizona, California and Texas. We offer an entrepreneurial environment that fosters personal and professional growth with in-house education programs, formal and informal mentoring and cross-training opportunities. We prefer to grow from within, building careers and financial stability through long-term ownership. We are consistently ranked among the top places to work, attributable to our tenured staff and outstanding benefits including profit-sharing, discretionary stock options, incentive bonuses, health and life insurance, health savings accounts (HSA) with wellness incentives, 401(k), college savings plans, business travel assistance and insurance, discounted auto and homeowners insurance, identity theft protection, rewards programs and much more.\n\n Kitchell is an Equal Opportunity/Affirmative Action employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status."}, {"title": "Construction Laborer", "company": "MOJ construction", "location": "Concord, NH", "job url": "Not Available", "description": "Part-timeLooking for a few people that are dependable , willing to climb a ladder , and willing to learn .only serious people applyJob Types: Full-time, Part-time"}, {"title": "Construction Crew Technician", "company": "NPL", "location": "Eastvale, CA 91752", "job url": "https://www.indeed.com/rc/clk?jk=bc6ce69665845b18&from=vj&pos=top", "description": "Desired: Clean Driving RecordDriver's LicenseSummary\n\nJoin the leader in underground pipeline construction and get yourself a solid career with solid pay! Take the first step on your path to career advancement; weve got work for the next 100 years!\nConstruction Crew Laborers are integral members of NPL Construction Crews. They support a team of foreman, equipment operators and technicians in underground utility construction projects. Your duties involve physically demanding construction general labor such as excavating, trenching, and shoring, while working around heavy equipment.\n\n\n\nPerks\n\nJoin the Largest Natural Gas Distribution Contractor in the United States\nWeekly Payroll\nPaid, on-the-job training for technical skills\nEmployee Assistance program benefit\nHealth Insurance Plan benefit\nRetirement Plan benefit\n\n\n\nResponsibilities\n\nUse hand tools to dig around existing utility structures to prevent damage\nLoad and unload equipment and materials\nKeep worksite clean and organized free from unnecessary hazards\nPerform regular maintenance and cleaning on assigned vehicles and equipment\nOther duties and responsibilities as assigned by supervisors\n\n\n\nEducation, Skills, Experience Needed\n\nGeneral knowledge of construction is great\nFocus to work safely in close proximity to heavy equipment and underground utilities\nCommitment to doing quality work while putting safety first\nPossess a strong sense of personal responsibility\n\n\n\nWorking Environment\n\nWork sites are outdoors in potentially extreme weather conditions\nAll worksite safety instructions are written and spoken in English; must be fluent in English\nWork includes prolonged and repeated: lifting (including overhead, up to 50lbs); standing; climbing; kneeling; reaching and feeling; crouching and crawling\nWork is performed within the red zone of heavy equipment\nWorking safely requires quick/accurate hand-eye coordination\n\n\n\nRequirements\n\nPass pre-employment, random, post-accident, and reasonable suspicion drug screens\nProvide valid US work authorization documents for E-Verify\nSatisfactory results of pre-employment background check results\nValid drivers license with clean driving record is preferred\nPre-employment medical fit-for-duty test; hold/obtain DOT medical card\nJoin and maintain Union membership\n\n\n\nEqual Employment Opportunity Employer\n\nThis job description is subject to change at any time. It reflects managements assignment of essential functions, and does not exclude or restrict the tasks that may be assigned.\nCenturi and its subsidiary companies will provide equal employment opportunities to all applicants without regard to an applicants race, color, religion, sex, gender, genetic information, national origin, age, veteran status, disability, or any other status protected by federal, state or local law. Centuri will provide reasonable accommodations to allow an applicant to participate in the hiring process (e.g., accommodations for a test or job interview) if so requested.\n\n\n\nNearest Major Market: Riverside\n\nNearest Secondary Market: Los Angeles"}, {"title": "Construction Receptionist/Office Assistant", "company": "Apex Contracting &amp; Restoration", "location": "San Diego, CA 92120", "job url": "Not Available", "description": "$14 - $15 an hourThe Receptionist will manage the front desk on a daily basis and perform a variety of administrative and clerical tasks. Strong communication, telephone and customer service skills are keys to success in this position.Job Responsibilities: Manage multiple phone lines at once.Provide basic and accurate information in-person and via phone/email.Receive, sort, and send daily mail.Order office supplies.Perform other clerical receptionist duties such as filing, faxing, etc.Manage/Maintain office break room and conference room.Requirements: Must have at least 1 year in-office experience.Proficiency in Microsoft OfficeMulti-tasking and time management skills.Bilingual in Spanish is desired.Job Type: Full-timeSalary: $14.00 to $15.00 /hourLocation:San Diego, CA (Preferred)"}, {"title": "Construction Worker", "company": "Roland Construction", "location": "La Habra, CA", "job url": "Not Available", "description": "Construction company seeking to hire General labor experienced and no experience necessarily will train.must have transportationDry wall painting.repairs stucco. Framing. Welding concrete. Must have positive attitude. Call roloJob Type: Full-timeExperience:construction: 1 year (Preferred)Location:La Habra, CA (Preferred)"}, {"title": "Construction Contract Administrator (Infrastructure)", "company": "Balfour Beatty", "location": "Sacramento, CA", "job url": "https://www.indeed.com/rc/clk?jk=8f9626fe0dba7996&from=vj&pos=top", "description": "Desired: Customer ServiceAdministrative ExperienceProgrammable Logic ControllersConstruction IndustryBecome Part of Our Team\n\nAs an industry leader Balfour Beatty offers employees a comprehensive benefits package with competitive salaries and more. This includes:\n\nMedical, Dental, Vision and Life Insurance\nHealth Savings Account\n401(k) with company match\nFlexible Spending Accounts (Dependent & Medical Reimbursement)\nVacation Time\nSick Time\nHolidays\nTuition Assistance\nSummary\n\nBalfour Beatty is seeking a Construction Contract Administrator for our $300M project in Elk Grove, California. This project is an expansion of Sacramento County s already existing Regional Waste Water Treatment Plant. Balfour Beatty s scope of work includes extensive structural and mechanical improvements through the addition of a Tertiary Treatment Facility.\nThe primary role of the Construction Contract Administrator is to perform various tasks throughout the duration of our subcontract and material contracts to ensure that the terms of the agreements are being adhered to.\nEssential Functions\nMaintain all records and documents related to subcontracts and material contracts.\nAssist in both startup and closeout of contracts.\nRespond to subcontract and material requests/questions by being a liaison between administrative teams.\nObtain all required documentation/forms after execution of contracts, including exhibits, special provisions, etc.\nProcess progress payments, including inputting and tracking and obtaining lien releases.\nMaintain various tracking logs and spreadsheet for contracts.\nDraft and track Supplemental Agreements for contracts.\nReview contracts for deviations from our standard terms and conditions.\nTrack, notify and bill all back charges associated with contracts.\nReport/complete all DBE Utilization Reports for contracts.\nEnsure that we have current Certificates of Insurance that meet the project specifications.\nManage OCIP Enrollment, Payroll Reports and assist our subcontractors with enrollment.\nObtain bonds and process reimbursements.\nRespond and track suppliers request for Preliminary Notice Information.\nEnsure Certified Payroll records are submitted and accurate.\nFlow down all contract requirements to tiered subcontracts.\nPrepare special reports and complete other projects as directed.\nRead and interpret project specifications as required to administer subcontract and material contracts.\nPerform additional assignments per supervisor's direction.\nMinimum Requirements\n\nA minimum of five (5) years of office administration experience\nHigh School Diploma or equivalent\nAbility to meet strict daily, weekly, monthly, and quarterly deadlines\nStrong computer skills in word processing and spreadsheet software. Word, Excel, Outlook\nPreferred Requirements\n\nConstruction industry experience a plus.\n4 year Business Administration or Accounting degree preferred.\nJD Edwards experience preferred.\nStrong verbal and written communication skills.\nExcellent multi-tasking capabilities while maintaining organization and meticulous attention to detail.\nAbility to maintain confidentiality at all times.\nExcellent customer service skills.\nAbout us\n\nBalfour Beatty US is an industry-leading provider of general contracting, at-risk construction management and design-build services for public and private sector clients across the nation. Performing heavy civil and vertical construction, our teams build the unique structures and infrastructure that play an important role in how people live, work, learn and play in our communities. Our teammates have an instinctive passion for innovating that is fueled by a relentless curiosity, a drive to employ lean practices and processes and the determination to find a better way. Through Zero Harm, we are challenging the construction industry s assumptions about safety. We believe that no level of harm should come to anyone as a result of our business.\n\nConsistently ranked among the nation s largest building contractors, by Engineering News-Record, our US business is a subsidiary of London-based Balfour Beatty plc (LSE: BBY).\n\nBalfour Beatty is an equal opportunity employer that recognizes the value of a diverse workforce. All qualified individuals will receive consideration for employment without regard to race, color, age, sex, sexual orientation, gender identity, religion, national origin, disability, veteran status, genetic information, or any other criteria protected by federal, state or local law."}, {"title": "(RENO) Construction Cleaner", "company": "Tesla", "location": "Sacramento, CA", "job url": "Not Available", "description": "$17 - $18 an hourTHIS JOB IS LOCATED IN RENO, NV. RELOCATION ASSISTANCE IS AVAILABLE. DescriptionThe RoleThe Construction cleaner will report to the construction supervisor and will be responsible for a variety of light construction cleaning in and around the Tesla Gigafactory construction projects. Excellent attendance is crucial for the team to achieve success. The ideal candidate has a proven record of success in fast-paced environments. He/she must have the ability to work with and communicate with cross-functional teams. The successful candidate for this position takes pride in his/her hands-on and abilities, organization skills and attention to detail. He/she appreciates an environment where superior work is encouraged, noticed and rewarded. This role will work a Monday-Friday day schedule.ResponsibilitiesFollow all health and safety regulationsClean and clear light debris and do housekeeping of construction areasComplete tasks as directed by supervisor in a timely manner.Maintain a clean and orderly work areaPhysical work including but not limited to pushing, pulling, gripping, sweeping and vacuumingRequirementsMust have a command of the English language, both written and verbal.Must be reliable, have good initiative, be committed, and be quality focused.Ability to lift up to 50 lbs. as needed.Ability to work with a team and in a fast-paced environment.Must be reliable, have good initiative, committed, and quality focused.A valid U.S. drivers license and acceptable driving record (subject to review).Positive energy and attitude are a must.Job Type: Full-timeSalary: $17.00 to $18.00 /hour"}, {"title": "Construction Purchaser", "company": "Building421,Inc", "location": "Home Based", "job url": "Not Available", "description": "Building421 is currently seeking a Construction Purchaser to be responsible for compiling requested materials, records, drawing up purchase orders, purchasing supplies and materials, contract negotiation, and working cooperatively with Construction staff. The Construction Purchaser will conduct negotiations between vendors, select contractors, manage all contracts, work orders, purchase orders and expense controls, with the ultimate goal of securing the best value at a fair and reasonable cost. Bldg421, Inc, is seeking someone who can interact with all levels of internal and external customers in a professional manner and has strong negotiating skills.Essential Job Duties/Responsibilities: Research and evaluate potential suppliers based on price, quality, availability, reliability, production, equipment, capability and supplier's reputation and track records.Locate vendors of materials, equipment or supplies and inquire about product availability and terms of sales.Initiates and coordinates the Request for Quote (RFQ) and/or Request for Proposal (RFP) from General Contractors and subcontractors for goods, materials, supplies, inventory items and services.Analyze price proposals and other data and information to determine prices, quality and service are in Bldg421s best interest.Prepare and process requisitions and purchase orders for supplies and equipment.Obtain and process vendor invoices for payment per Bldg421 policy.Maintain records of materials ordered, received and rental equipment.Monitor deliveries of materials and equipment ordered, being mindful of late deliveries. Communicate with vendors and suppliers the adverse effect of late deliveries on construction project.Checks requisitions & shipment receipts for accuracy as well as shipping status of material ordered.Resolve vendor or contractor grievances and claims against suppliers.Contact subcontractor suppliers for payment verification.Communicate with field supervision to assure quantities, specifications and deliveries are thoroughly understood and transmitted correctly to vendors and suppliers.Participate in pre-job meetings to assure familiarity with schedules and communicate material delivery issues that may impact schedules.Interface with designated administrative departments addressing all invoicing and quality concerns with vendors.Provides customer service and support to all departments and clients.Prepare and issue all purchase orders to track and control the materials, supplies and inventory purchases.Maintain relationship with suppliers to schedule or expedite deliveries, resolve shortages, missed or late deliveries or defective or unacceptable goods and determine corrective action.Maintain vendor/supplier database and filing system.Prepare, review and maintain accurate records.EDUCATION AND SKILLS: High school diploma or GED requiredValid drivers licenseExcellent verbal and written communication skillsAbility to interact with all level of internal and external customers in a professional manner.Strong experience in using various computerized systems, including Microsoft OfficeStrong negotiation skillsDetail oriented with ability to multi-task while meeting various deadlinesStrong interpersonal skillsJob Type: Full-timeEducation:High school or equivalent (Required)License:Valid Drivers License (Required)Language:English (Required)Work authorization:United States (Required)Required travel:50% (Required)"}, {"title": "Construction Laborer", "company": "Absolute Asphalt", "location": "Rockville, VA 23146", "job url": "Not Available", "description": "$400 - $1,000 a weekPart-time, TemporaryEmployee will be responsible for shoveling, raking, tamping, digging.......Asphalt experience pays more.Equipment operation pays more.Must have a drivers license and or transportation to and from work.Job Types: Full-time, Part-time, TemporarySalary: $400.00 to $1,000.00 /weekExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "Titan", "location": "Manteca, CA", "job url": "Not Available", "description": "$13 - $14 an hourPart-timeDesired: Construction ExperienceWe are hiring full time/part time positions for construction labor/clean up for our large construction sites throughout the Valley:Fast paced job, involves: sweeping, cleaning, traffic control, assisting the superintendent with safety & construction trades, working in a TEAM environment, attendance is KEY as our projects and run from 18-24 months long at a time, construction experience is preferred but not required.Keys: Good attendance, reliability, ability to work well with others, working hard but always with safety in mind.Details: Steady long term work, the job is Monday - Fri, 7a-4pm. Optional OT on the weekend, good advancement opportunities for outstanding individuals.Job Types: Full-time, Part-timeSalary: $13.00 to $14.00 /hourExperience:Construction: 1 year (Preferred)Location:Manteca, CA (Preferred)Work authorization:United States (Required)"}, {"title": "Hostess / Host", "company": "THE LOT", "location": "La Jolla, CA 92037", "job url": "https://www.indeed.com/rc/clk?jk=131c9fc5c7ab2be8&from=vj&pos=top", "description": "THE LOT is a revolutionary Entertainment, Experience, Lifestyle Venue that merges premium entertainment with our unique California communities to create an experience that is unsurpassed. A premium cinema and dining destination that is a social hub for elevated cuisine, craft coffee, special events, sophisticated cocktails as well as a comfortable co-work space, THE LOT truly creates the ultimate guest experience. THE LOT opened in Southern California - La Jolla in September of 2015, Liberty Station in May of 2016, and Newport Beach in April of 2018. THE LOT San Ramon is currently under construction, due to open in November with training to begin in October.\n\nThe Host / Hostess will be the first point of contact for incoming guests and must be be welcoming, helpful, and sophisticated. Always up-beat, energetic and knowledgeable  Our Host / Hostess is the Heart and Soul of THE LOT. This position will assist with Concierge responsibilities.\n\nPositive and Professional Attitude with a great high-energy Guest Focus\nStrong attention to detail\nProvides personal insight about products, entertainment and services provided at THE LOT\nAnticipates the guests' needs and respond appropriately with a sense of urgency\nArranges for, suggests, recommends, books, and confirms, services that may include, but not limited to, purchasing gifts, premium tickets, dining experiences and other events\nProjects an approachable and professional image in personal appearance, manner, and demeanor\nAssures prompt and positive action on all guest complaints, questions, concerns and suggestions, as well as following-up\nUse professional telephone etiquette in handling internal and external guest request\nWorks as a team, assisting with all Guest and Team Member needs\nPrevious work experience as a Host/Hostess required, in an upscale/hospitality restaurant strongly preferred.\nPrevious work experience in customer service required.\nExperience with Open Table, reservation systems, handling multiple phone lines strongly preferred.\nMust be 18 years of age or older\n\nWe are an Equal Opportunity Employer\n\nOpen Weekend and Holiday Availability\n\nPrevious work experience in a restaurant required\n\nPrevious experience with OpenTable preferred\n\nAbility to lift to 50 lbs.\n\nAbility to smile while standing 8 hours a day"}, {"title": "Barista", "company": "THE LOT", "location": "La Jolla, CA 92037", "job url": "https://www.indeed.com/rc/clk?jk=4d5c4de03d8483a1&from=vj&pos=top", "description": "THE LOT is a revolutionary Entertainment, Experience, Lifestyle Venue that merges premium entertainment with our unique California communities to create an experience that is unsurpassed. A premium cinema and dining destination that is a social hub for elevated cuisine, craft coffee, special events, sophisticated cocktails as well as a comfortable co-work space, THE LOT truly creates the ultimate guest experience. THE LOT opened in Southern California - La Jolla in September of 2015, Liberty Station in May of 2016, and Newport Beach in April of 2018. THE LOT San Ramon is currently under construction, due to open in November with training to begin in October.\n\nAs a Barista at THE LOT, you will work in our Caf preparing and selling craft coffee drinks. Moving away from the traditional movie-going experience, our Team Members design the ultimate guest experience. Baristas offer locally roasted craft coffee and artisan pastries baked daily. Baristas will be educated on preparing and selling craft coffee drinks, following company recipes and preparation techniques. Gourmet pours by people who know your name.\n\nRequirements\nPrevious work experience as a Barista strongly preferred\nPrevious work experience in customer service and cash-handling skills required\nPositive and Professional Attitude with a great high-energy Guest Focus\nStrong attention to detail\nProvides personal insight about products, entertainment and services provided at THE LOT\nAnticipates the guests' needs and responds appropriately with a sense of urgency\nWelcomes all guests by determining their coffee interests and needs\nEducates guests by presenting and explaining the coffee drink menu; answering questions\nSells cafe menu items by explaining differences in coffee beans and coffee preparation machines; demonstrating how brewing equipment operates\nPrepares and sells coffee drinks by following prescribed recipes and preparation techniques for coffee drinks\nWorks as a team, assisting with all Guest and Team Member needs\nMust be 18 years of age or older\nWe are an Equal Opportunity Employer\nOpen Weekend and Holiday Availability. Must be available to work at least 3 shifts per week.\nPrevious work experience as a Barista strongly preferred\nAbility to lift to 50 lbs\nAbility to smile while standing 8 hours a day"}, {"title": "General Construction Worker", "company": "Smooth Rahab Realty LLC", "location": "Elizabeth, NJ 07202", "job url": "Not Available", "description": "$100 a dayConstruction company is looking for a construction worker / laborer for a couple of residential projects in Elizabeth NJ.The scope of the work is basic cleaning, moving tools around, sanding, demolition, scraping, holding things in place, mixing, loading and unloading and other grunt work.The starting pay is $100 a day from 9am-5pm.REQUIREMENTS:1. You must be able to lift at least 60lb and able move FAST.2. You must have an active state picture ID to sign an accident waiver and release of liability form.3. Must have 1 year of construction experience.RULES:1.No smoking (ok during lunch).2.No cell phone use (ok during lunch).3.Don't ever be late.4.Must always wear boots.5.You must have your own tool belt NO EXEMPTION. (this avoids you losing our tools)If interested please TEXT/CALL at 908-787-4745 to schedule an interview, Thank you.KEYWORDS:drywall, sheetrock, stucco, plumbing, electric, floor, flooring, demo, demolition, handyman, carpentry, carpenter, plaster, sand, sanding, window, windows, door, doors, tile, tiles, renovation, reno, construction, contractor, vynil siding, roof, roofing, brick, bricks, trim, molding, moulding, cleaning, painting, painter, paint, rails, stairs, deck, landscape, dumpster, dump, frame, framing, framer, cement, concrete, home, Masonry, spackle, framingJob Type: Full-timeSalary: $100.00 /dayExperience:Construction: 1 year (Preferred)general labor: 1 year (Preferred)demolition: 1 year (Preferred)License:Driver's License (Preferred)Language:english (Preferred)spanish (Preferred)"}, {"title": "Lease Processor (8666)", "company": "MD7", "location": "San Diego, CA 92130", "job url": "https://www.indeed.com/rc/clk?jk=33589a087aa3d147&from=vj&pos=top", "description": "Description\nMd7, with worldwide headquarters located in San Diego, California, is a fast-paced, mid-sized company providing services for major wireless telecommunication companies through lease management, site acquisition, architecture and engineering, and construction management programs. Our people and employee-centric company culture make us unique.\n\nWe are currently looking to add a Lease Processor to our team!\n\nPosition Responsibilities:\n\nPrepare complex amendments regarding the reduction and/or restructuring of current lease agreements\nResearch and review for quality control the negotiations submitted by Lease Consultants\nCreate/Draft lease amendments based on re-negotiated lease terms submitted by the Lease Consultant\nMaintain digital lease files of all amendments\nSend lease amendments/documents to landlords or Carriers via FedEx\nNotarize legal documents as necessary\n\nQualifications\nEducation Required:\nHigh school diploma or equivalent. Paralegal certification is preferred but not required.\n\nExperience Required:\n2+ years recent experience reviewing and/or preparing legal documents and/or contracts.\nCustomer service, data entry and/or quality control experience is helpful.\nSpecial Skills Required:\nIntermediate knowledge of Microsoft Outlook, Word and Excel.\nStrong organizational and communication skills.\nAble to prioritize and multi-task in a fast paced environment.\nVery detail-oriented and strong demonstrated ability to review documents for accuracy.\nTyping skills of at least 50-70 wpm."}, {"title": "Construction Laborer/Helper", "company": "Haynes Construction", "location": "Phoenix, AZ 85051", "job url": "Not Available", "description": "$12 - $14 an hourclean up, Help journeyman CarpenterJob Type: Full-timeSalary: $12.00 to $14.00 /hour"}, {"title": "Construction Worker", "company": "All Bay Tile &amp; Stone", "location": "East Bay, CA", "job url": "Not Available", "description": "$175 - $225 a dayAll trades of Residential construction is a must Tile, Plumbing, electrical, sheetrock, mud & taping , painting Please have these requirements so the job can be performed correctly thank youJob Type: Full-timeSalary: $175.00 to $225.00 /dayExperience:Construction: 5 years (Required)Seasonal job:No"}, {"title": "Rigger Helper", "company": "Venture Dynamics", "location": "San Diego, CA", "job url": "Not Available", "description": "ContractVenture Dynamics is looking for Rigger Helpers.Riggers are responsible for lifting, moving and positioning machinery, equipment, structural parts, and other heavy loads aboard ship and in the shops.Riggers are responsible for Shipboard rigging to include removal of the machinery and equipment on and off the ship and through narrow openings utilizing jacks, chain falls, come alongs and rollers.Shipboard machinery and equipment to include but not limited to: pumps, valves, motors, electronic equipment, etc.Riggers are also responsible for selecting rigging gear based on weight and distribution of load, availability of hoisting machinery, and the presence of obstacles which might interfere with maneuverability of incorrectly rigged hoisting gear.May signal workers operating cranes or other equipment to move load.Individuals will also be required to inspect their own rigging gear according to safety rules and OSHA standards.Riggers Will perform additional related tasks as assigned by Supervisor, some of which may become essential to the position.Required Skills: Minimum 3 years relative Rigging or Hook Tender experience in a shipyard environmentMust pass Journeyman Rigger written examMust have shipboard experience removing machinery, equipment and other structural partsMust comply with safety rules and OSHAMust be able to use hand tools and power tools safely and efficientlyPhysical Requirements: Must be physically capable of performing the essential functions of the positionSuccessfully pass a drug and alcohol screeningMust be able to work at heights, in confined spaces and have the ability to climb staircases and ladders of varying sizesMust be able to continuously push/pull, stand and work with arms extended at shoulder levelMust be able to lift 50lbs on a frequent basisUnique/Additional RequirementsMust be a US Person (United States Citizen or Alien Admitted for permanent residence in the United States).Must possess or be eligible to get a DBID (Defense Biometric Identification).Have flexible schedule, be able to work any shift (1st, 2nd, or 3rd) and do overtime if required.Must have reliable method of transportation.Must possess personal tools required for the positionPhysical/Medical RequirementsBe able to successfully pass a Drug and Alcohol screening (Subjected to random Drug Screen Tests).Must be Physically and Medically qualified to wear required PPE (Personal Protective Equipment) for the job.Bust be able to lift 50+ pounds, bend, stretch, stand for extended periods of time, climb stairs, reach, twist, work at elevated heights and small spaces.Drug-Free Work PlaceVenture Dynamics is a Drug-Free Workplace.NEW HIRES: All new hires are required to perform pre-employment drug testing. Those testing positive for drugs or alcohol will have their employment offer immediately rescinded no matter how qualified.REASONABLE SUSPICION: If the employee displays of any performance, behavioral or physical indicator of Drug-use he/she will be required to perform a Drug and Alcohol screen test.POST ACCIDENT/INCIDENT/INJURY:  Whenever justified by serious injury, damaged/loss of property, or life the employee is required to fill a report and complete a Drug and Alcohol screen test.RANDOM:  Employees are subjected to Random drug testing to keep our company a Drug-Free Workplace.Job Types: Full-time, ContractExperience:Rigging: 3 years (Required)Shipyard: 3 years (Required)Location:San Diego, CA (Required)Work authorization:United States (Required)"}, {"title": "Construction Crew Laborer", "company": "NPL", "location": "Prescott, AZ", "job url": "https://www.indeed.com/rc/clk?jk=f38686e6859dac95&from=vj&pos=top", "description": "Summary\n\nJoin the leader in underground pipeline construction and get yourself a solid career with solid pay! Take the first step on your path to career advancement; weve got work for the next 100 years!\nConstruction Crew Technicians are integral members of NPL Construction Crews. They support a team of foreman, equipment operators and technicians in underground utility construction projects. Duties involve physically demanding construction general labor such as excavating, trenching, and shoring, while working around heavy equipment.\n\n\n\nPerks\n\nJoin the Largest Natural Gas Distribution Contractor in the United States\nWeekly Payroll\nPaid, on-the-job training for technical skills\nEmployee Assistance program benefit\nHealth Insurance Plan benefit\nRetirement Plan benefit\n\n\n\nResponsibilities\n\nUse hand tools to dig around existing utility structures to prevent damage\nLoad and unload equipment and materials\nKeep worksite clean and organized free from unnecessary hazards\nPerform regular maintenance and cleaning on assigned vehicles and equipment\nOther duties and responsibilities as assigned by supervisors\n\n\n\nEducation, Skills, Experience Needed\n\nGeneral knowledge of construction is great\nFocus to work safely in close proximity to heavy equipment and underground utilities\nCommitment to doing quality work while putting safety first\nPossess a strong sense of personal responsibility\n\n\n\nWorking Environment\n\nWork sites are outdoors in potentially extreme weather conditions\nAll worksite safety instructions are written and spoken in English; must be fluent in English\nWork includes prolonged and repeated: lifting (including overhead, up to 50lbs); standing; climbing; kneeling; reaching and feeling; crouching and crawling\nWork is performed within the red zone of heavy equipment\nWorking safely requires quick/accurate hand-eye coordination\n\n\n\nRequirements\n\nPass pre-employment, random, post-accident, and reasonable suspicion drug screens\nProvide valid US work authorization documents for E-Verify\nSatisfactory results of pre-employment background check results\nValid drivers license with clean driving record is preferred\nPre-employment medical fit-for-duty test; hold/obtain DOT medical card\nJoin and maintain Union membership\n\n\n\nEqual Employment Opportunity Employer\n\nThis job description is subject to change at any time. It reflects managements assignment of essential functions, and does not exclude or restrict the tasks that may be assigned.\nCenturi and its subsidiary companies will provide equal employment opportunities to all applicants without regard to an applicants race, color, religion, sex, gender, genetic information, national origin, age, veteran status, disability, or any other status protected by federal, state or local law. Centuri will provide reasonable accommodations to allow an applicant to participate in the hiring process (e.g., accommodations for a test or job interview) if so requested.\n\n\n\nNearest Major Market: Prescott"}, {"title": "Construction Worker", "company": "Halverson Decor", "location": "Laguna Niguel, CA", "job url": "Not Available", "description": "$50,000 a yearOur company is expanding rapidly with tons of builds and is only going to continue to grow! We specialize in custom decor, and do commercial remodeling, residential remodeling and everything in between. There is room for advancement and we pay competitively and based on experience as well as qualifications!This is an exciting opportunity to work for a very good company that is treated like a family!Only apply with experience and resumes to prove so. We will be scheduling interviews immediately as we are looking for qualified candidates to start right away.Job Type: Full-timeSalary: $50,000.00 /year"}, {"title": "Construction Crew Technician", "company": "NPL", "location": "Eastvale, CA 91752", "job url": "https://www.indeed.com/rc/clk?jk=bc6ce69665845b18&from=vj&pos=top", "description": "Desired: Clean Driving RecordDriver's LicenseSummary\n\nJoin the leader in underground pipeline construction and get yourself a solid career with solid pay! Take the first step on your path to career advancement; weve got work for the next 100 years!\nConstruction Crew Laborers are integral members of NPL Construction Crews. They support a team of foreman, equipment operators and technicians in underground utility construction projects. Your duties involve physically demanding construction general labor such as excavating, trenching, and shoring, while working around heavy equipment.\n\n\n\nPerks\n\nJoin the Largest Natural Gas Distribution Contractor in the United States\nWeekly Payroll\nPaid, on-the-job training for technical skills\nEmployee Assistance program benefit\nHealth Insurance Plan benefit\nRetirement Plan benefit\n\n\n\nResponsibilities\n\nUse hand tools to dig around existing utility structures to prevent damage\nLoad and unload equipment and materials\nKeep worksite clean and organized free from unnecessary hazards\nPerform regular maintenance and cleaning on assigned vehicles and equipment\nOther duties and responsibilities as assigned by supervisors\n\n\n\nEducation, Skills, Experience Needed\n\nGeneral knowledge of construction is great\nFocus to work safely in close proximity to heavy equipment and underground utilities\nCommitment to doing quality work while putting safety first\nPossess a strong sense of personal responsibility\n\n\n\nWorking Environment\n\nWork sites are outdoors in potentially extreme weather conditions\nAll worksite safety instructions are written and spoken in English; must be fluent in English\nWork includes prolonged and repeated: lifting (including overhead, up to 50lbs); standing; climbing; kneeling; reaching and feeling; crouching and crawling\nWork is performed within the red zone of heavy equipment\nWorking safely requires quick/accurate hand-eye coordination\n\n\n\nRequirements\n\nPass pre-employment, random, post-accident, and reasonable suspicion drug screens\nProvide valid US work authorization documents for E-Verify\nSatisfactory results of pre-employment background check results\nValid drivers license with clean driving record is preferred\nPre-employment medical fit-for-duty test; hold/obtain DOT medical card\nJoin and maintain Union membership\n\n\n\nEqual Employment Opportunity Employer\n\nThis job description is subject to change at any time. It reflects managements assignment of essential functions, and does not exclude or restrict the tasks that may be assigned.\nCenturi and its subsidiary companies will provide equal employment opportunities to all applicants without regard to an applicants race, color, religion, sex, gender, genetic information, national origin, age, veteran status, disability, or any other status protected by federal, state or local law. Centuri will provide reasonable accommodations to allow an applicant to participate in the hiring process (e.g., accommodations for a test or job interview) if so requested.\n\n\n\nNearest Major Market: Riverside\n\nNearest Secondary Market: Los Angeles"}, {"title": "Construction Network Technician", "company": "Vivint Solar", "location": "San Diego, CA 92126", "job url": "Not Available", "description": "Join Vivint Solar: Its Sunnier Here!Vivint Solar is the brighter and more affordable way to power your home. We believe people should have a choice in how to produce the energy they use to live every day. This is whywere making it easy for people nationwide to choose to go solar. Were proud to be a leader in the renewable energy industry.To help this happen, we need a Solar CommunicationsTechnician that will be a solid contributor within Vivint Solar. As a SolarCommunciationsTechnician, you will be responsible for restoring communication to all non- communicating systems. In this role, you will report directly to a Regional Manager within the Field Services group.Key Job Duties:Diagnose network functions, IP address knowledge, internet connection and troubleshooting of low voltage circuitsRecord and submit service activity on mobile software platforms utilizing company phone, associated with serviced systemsDiagnose PV system communication issues, and administer corrective actionMaintain all issued tools assigned to you by Vivint SolarComply with key performance indicators (KPI) set by Regional Field Service ManagerAttend webinars/calls correlation meeting(s) as set by Regional Field Service ManagerMaintain and communicate supply & equipment issues to properly address all solar communication call needsMaintain regular communication with Field Service Techs and Fleet Performance Call CenterEnsure a high level of workmanship is adhered to as service work is performedNecessary Skills and Experience:Working knowledge of solar installation, and monitoring platformsAbility to work well with others that are on your teamStrong analytical and problem-solvingskillsAbility to keep a positive attitudeCompetent with hand tools and digital volt metersCapable of managing multiple tasks & to adapt to change easilyProficient analytical and creative problem-solvingskillsMust be able to advance knowledge base through understanding of product and process documentationMust have clean driving record and pass a background check1 to 2 years of relevant experienceWorking knowledge of solar installation and solar communications issues.1+ years network system experience1+ years of solar service experience preferredBasic understanding of how electrical components can be repaired in the most cost-effective mannerEmployees of Vivint Solar must submit to a criminal history check, motor vehicles check, drug screening, and obtain clearance from the state based upon the state requirements.Vivint Solar is a proud promoter of employment opportunities to our Military and Veterans. We, an equal opportunity employer, do not consider any protected traits (e.g. race, creed, color, religion, gender, national origin, non-job-related disability, age, or any other protected trait) when hiringunder federal, state and local laws.Job Type: Full-time"}, {"title": "Rigger Helper", "company": "Venture Dynamics", "location": "San Diego, CA", "job url": "Not Available", "description": "ContractVenture Dynamics is looking for Rigger Helpers.Riggers are responsible for lifting, moving and positioning machinery, equipment, structural parts, and other heavy loads aboard ship and in the shops.Riggers are responsible for Shipboard rigging to include removal of the machinery and equipment on and off the ship and through narrow openings utilizing jacks, chain falls, come alongs and rollers.Shipboard machinery and equipment to include but not limited to: pumps, valves, motors, electronic equipment, etc.Riggers are also responsible for selecting rigging gear based on weight and distribution of load, availability of hoisting machinery, and the presence of obstacles which might interfere with maneuverability of incorrectly rigged hoisting gear.May signal workers operating cranes or other equipment to move load.Individuals will also be required to inspect their own rigging gear according to safety rules and OSHA standards.Riggers Will perform additional related tasks as assigned by Supervisor, some of which may become essential to the position.Required Skills: Minimum 3 years relative Rigging or Hook Tender experience in a shipyard environmentMust pass Journeyman Rigger written examMust have shipboard experience removing machinery, equipment and other structural partsMust comply with safety rules and OSHAMust be able to use hand tools and power tools safely and efficientlyPhysical Requirements: Must be physically capable of performing the essential functions of the positionSuccessfully pass a drug and alcohol screeningMust be able to work at heights, in confined spaces and have the ability to climb staircases and ladders of varying sizesMust be able to continuously push/pull, stand and work with arms extended at shoulder levelMust be able to lift 50lbs on a frequent basisUnique/Additional RequirementsMust be a US Person (United States Citizen or Alien Admitted for permanent residence in the United States).Must possess or be eligible to get a DBID (Defense Biometric Identification).Have flexible schedule, be able to work any shift (1st, 2nd, or 3rd) and do overtime if required.Must have reliable method of transportation.Must possess personal tools required for the positionPhysical/Medical RequirementsBe able to successfully pass a Drug and Alcohol screening (Subjected to random Drug Screen Tests).Must be Physically and Medically qualified to wear required PPE (Personal Protective Equipment) for the job.Bust be able to lift 50+ pounds, bend, stretch, stand for extended periods of time, climb stairs, reach, twist, work at elevated heights and small spaces.Drug-Free Work PlaceVenture Dynamics is a Drug-Free Workplace.NEW HIRES: All new hires are required to perform pre-employment drug testing. Those testing positive for drugs or alcohol will have their employment offer immediately rescinded no matter how qualified.REASONABLE SUSPICION: If the employee displays of any performance, behavioral or physical indicator of Drug-use he/she will be required to perform a Drug and Alcohol screen test.POST ACCIDENT/INCIDENT/INJURY:  Whenever justified by serious injury, damaged/loss of property, or life the employee is required to fill a report and complete a Drug and Alcohol screen test.RANDOM:  Employees are subjected to Random drug testing to keep our company a Drug-Free Workplace.Job Types: Full-time, ContractExperience:Rigging: 3 years (Required)Shipyard: 3 years (Required)Location:San Diego, CA (Required)Work authorization:United States (Required)"}, {"title": "Construction Laborer", "company": "Kleintop Contracting", "location": "Lehighton, PA 18235", "job url": "Not Available", "description": "Construction Labor forRoofing, Siding, Windows, Doors, Snowplowing/shoveling and other phases of constructionNo experience is necessary but the willingness to learn and be open minded is.Job Type: Full-timeExperience:construction: 1 year (Preferred)"}, {"title": "Construction Disbursement Assistant", "company": "SBA Complete, Inc.", "location": "Murrieta, CA", "job url": "Not Available", "description": "$28,000 - $32,000 a yearJob DescriptionJob DescriptionResponsible for the disbursement process on assigned SBA lending construction and multiple disbursement loans. Will assist with the day to day responsibilities of reviewing construction loan documentation and financial information, monitoring construction projects, ordering and reviewing project inspections, and overseeing disbursements and documentation for SBA approved lenders. The position will work directly with construction contractors, third party management and fund control firms, inspectors, vendors, and clients prior to and after loan closing through final funding to process lender approved construction draws in accordance with government, internal and regulatory requirements. Must have SBA lending and construction experience.Essential Duties & ResponsibilitiesEnsures the timely process of all construction disbursements, which requires reviewing, analyzing and disbursing construction loan draws per SBA guidelines.Input disbursement requests into the OnBase program for our First Bank lenderCalculates the disbursement draw funding to the specific line item in the budget.Identifies insufficient funds in the budget line item as well as the overall budget and obtains lender approval for budget change request.Orders inspection reports, balances borrowers construction loan budget against bank records and meets borrowers time frame to ensure the highest level of customer service.Schedules all disbursement transactions and inputs requests into the OnBase system and Ledgers.Establish a master disbursement funding folder at loan close, categorizing all sources and uses of the construction budgetMaintain disbursement funding ledger throughout the project to ensure all funding categories and sources remain in balance and advances are provided timely to the Note dept.Updates SBA ETRAN with reallocation changes for all PLP lender disbursements.Collect and review final licenses, insurance and receipt of final loan documentation prior to final fundingReview mechanics liens and/or contractor disputes and provide management with recommended actionAssist with various department and management projects as neededProvide excellent customer service to clients.Respond to general inquiries on draw status.Desired Skills & QualificationsMust be able to maintain organization for over 100 multiple disbursement SBA loansMust be able to handle an extremely high volume of disbursements daily while keeping them organized and within budgetMust be able to work in a fast paced environment while maintaining a high level of accuracyMust be able to work on multiple projects with the flexibility for changing priorities and prioritize multiple tasks, meet deadlines and work under pressureExcellent analytical, problem-solving and organizational skillsSpecialized program knowledge of SBA ETRAN and OnBaseKnowledge of the SOP specifically for SBA approved constructionKnowledge of 327 Action requests and how to request from SBAStrong computer skills including Microsoft Office (MS Word, Excel, Outlook)Excellent communication skills, Detail-oriented, excellent organizational skills, and impeccable writing and grammarBasic knowledge of real estate, escrow, title, UCC, and lender due-diligence/verification processesStrong knowledge of the Construction Process and typical disbursement requirements.Ability to work well with lenders, processors, underwriters and managementRequirementsEducation: Minimum of School Diploma. Bachelors Degree preferred.Experience: 2 or more years of experience in SBA lending and/or construction loan administration; Strong technical expertise in construction loan administration functions; Considerable knowledge of construction finance, accounting and data systems.Job Type: Full-timeJob Type: Full-timeSalary: $28,000.00 to $32,000.00 /yearExperience:SBA lending: 2 years (Preferred)"}, {"title": "Construction Laborer", "company": "NCI Inc", "location": "San Francisco, CA", "job url": "Not Available", "description": "$18 - $25 an hourLooking for dependable and punctual workers. We offer ongoing work for individuals who show up to work and work hard. There's opportunity to learn and move up within the company to become a carpenter, machine operator, or even a foreman.Be aware that you will be doing hard labor.If you are looking for ongoing full time work and won't have any issues commuting to San Francisco, please contact me.Job Type: Full-timeSalary: $18.00 to $25.00 /hourExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "J.D. Danken Construction, Inc.", "location": "Middletown, OH 45044", "job url": "Not Available", "description": "$600 - $1,000 a weekGeneral Construction in a Heavy Industrial Setting. General labor, Carpentry, Concrete, Welding & Burning Experience Helpful But Not Required. OSHA 10 Hour Required, (Employer Will Provide) Pre-Employment Drug Screen Required. No Travel Required.Job Type: Full-timeSalary: $600.00 to $1,000.00 /weekExperience:Construction: 1 year (Preferred)"}, {"title": "Experienced Construction Quarry Laborer", "company": "George Weir Asphalt Construction Company", "location": "Escondido, CA 92029", "job url": "Not Available", "description": "EXPERIENCED CCONSTRUCTION QUARRY LABORER/GROUNDSMANIf you have EXPERIENCE WORKING AT A ROCK QUARRY....we want to talk with you!MUST HAVE PREVIOUS EXPERIENCE AT: Having a strong focus on safety of self, others and equipment/propertyOperating a forklift, skidsteer and other small equipment - NOTE: must pass a competency road test for consideration.Working well outside in various weather (hot to cold)Being able to lift up to 50 lbs regularlyShoveling material and moving aggregate materials manuallyDirecting trafficCleaning up the yardSupporting the supervisor and manager in a variety of daily operationsProviding customer serviceGeorge Weir Asphalt Construction Company and Escondido Materials offers a leadership-driven, values based environment. We are highly focused on work-life balance and safety.If you have what it takes, please apply TODAY!Job Type: Full-timeExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Laborer / apprentice carpenter", "company": "The Karl Frank Company", "location": "Alamo, CA", "job url": "Not Available", "description": "$18 - $20 an hourLooking for construction laborers and apprentice carpenters no experience necessary will train. If you are looking to learn the construction trade from a well established company working on residential homes in the ease bay. This maybe your opportunity to learn a trade or further develop your skills.Job Type: Full-timeSalary: $18.00 to $20.00 /hourExperience:construction: 1 year (Preferred)Seasonal job:No"}, {"title": "General Construction Laborer", "company": "DBS CONSTRUCTION", "location": "Ukiah, CA 95482", "job url": "Not Available", "description": "$15 - $18 an hourPart-timeDesired: Construction ExperiencePart time construction worker wanted for small construction company working in Lake and Mendocino counties. Must have some experience and reliable transportation. Must be able to Work occasional weekends and flexible hours. Immediate availability. Please provide contact info a brief summary of experience.Job Type: Part-timeSalary: $15.00 to $18.00 /hourExperience:Construction: 1 year (Preferred)Work authorization:United States (Preferred)"}, {"title": "Construction Workers", "company": "Yavapai County Contractor&#39;s Association", "location": "Prescott, AZ 86301", "job url": "Not Available", "description": "$10.50 - $15.00 an hourTemporary18 - 24 years old? Entry level jobs in the construction trades. We work with many employers looking for employees in most of the trades including framing, roofing, landscaping, electrical, plumbing, HVAC and more. If you have little or no experience, we are offering a FREE 3-Week training in January to enhance your knowledge and ability to be hired. Register at ycca.org; call 928-778-0040.Job Type: TemporarySalary: $10.50 to $15.00 /hourLicense:drivers (Preferred)"}, {"title": "Construction Bid Coordinator", "company": "Sun Country Builders", "location": "Vista, CA 92084", "job url": "Not Available", "description": "$34,000 - $64,000 a yearDesired: Microsoft ProjectConstruction ExperienceProject CoordinationSuccessful Multi-Family General Contractor is seeking to hire a Bid Coordinator for their North County San Diego Office.Responsibilities: (not all inclusive)Manage Bid Invitations and maintain estimating scheduleCommunicate with Vendors and Subs to solicit pricingOrganize sub-contractor quotesAdministrative support to Estimating & Self-PerformAnalyze drawings and specificationsProvide clear detailed quantity take-offsMaintain sub databaseRequirements: Requires 2-4 years construction experienceStrong Word, Excel, MS Project and general computer skills.Strong written and verbal communicationGoal Oriented, self-starter, well organized and able to establish priorities and deadlinesTeam player with the ability to get along and respect othersWe offer a competitive compensation and benefits package and an excellent and supportive work environment.Job Type: Full-timeSalary: $34,000.00 to $64,000.00 /yearExperience:Project Coordinator: 1 year (Preferred)Construction: 1 year (Preferred)"}, {"title": "Construction Sales Person", "company": "Fenceworks Inc", "location": "Anaheim, CA", "job url": "Not Available", "description": "$4,500 - $6,500 a monthCommissionFast paced Orange County construction company looking for local talent with a construction back ground to join our sales team. 3-5 years minimum experience with a clean DMV required. Blue beam software knowledge a plus. Must know how to read plans and have familiarity with doing take offs. Position comes with Weekly Pay, plus monthly Commission based on sales, Benefits, paid holidays, and paid vacations.Job Type: Full-timeSalary: $4,500.00 to $6,500.00 /monthExperience:Construction: 3 years (Required)Sales: 5 years (Preferred)Clean Driving Record: 1 year (Required)Education:High school or equivalent (Preferred)Work authorization:United States (Required)Shifts:Morning (Preferred)Billing cycle:WeeklySales cycle:More than 9 monthsTypical deal size:$25-49kSales environment(s):Office or call centerOnboarding time:Less than 1 month"}, {"title": "General Laborer", "company": "MBM Construction Services, LLC", "location": "Schenectady, NY", "job url": "Not Available", "description": "$17.50 an hourDesired: Construction ExperienceGrowing construction company based out of Schenectady looking to hire reliable, full-time general laborers.Job Type: Full-timeSalary: $17.50 /hourExperience:construction: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "Verrips Construction", "location": "Napa, CA", "job url": "Not Available", "description": "$13 - $18 an hourCurrently hiring for multiple positionsGeneral Laborer - $13-18/hour, DOE+ Clean-up and miscellaneous tasks at construction job site+ Able to follow direction+ Physically fit: able to lift heavy objects, bend, reach, carry, etc.+ Follow all safety guidelines and help keep a safe work environmentWe are looking for someone who is:+ Detail oriented and organized+ Positive Attitude+ Good communication skills+ Ability to lift heavy objects+ Reliable transportationJob sites in NapaJob will start immediately, Wage DOE and position, paid weekly, full-time workJob Type: Full-timeSalary: $13.00 to $18.00 /hour"}, {"title": "Park Ranger Assistant", "company": "County of Solano", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=f0d9c11868bfa016&from=vj&pos=top", "description": "$44,291 - $53,836 a yearPart-timeProviding a Safe Environment for Fun & Relaxation\nThe Department of Resource Management is a comprehensive agency comprised of the Public Works, Building and Safety, Planning Services, Environmental Health Services, Parks, and Administrative Services Divisions. The department provides for the well-being of Solano County's present and future residents and the public at-large through administration and enforcement of Federal, State, and Local laws and policies pertaining to transportation, building construction, land use planning environmental health, and recreation.\nThe Parks & Recreation Division of the Department of Resource Management is the steward of Solano County's natural and cultural resources. The Division creates safe environments and showcases the County's facilities in order for visitors to enjoy diverse recreational experiences.\n\nTo learn more about the Parks and Recreation Division, please visit: http://www.solanocounty.com/depts/rm/countypark/homepage.asp\n\nThe Position\nPark Ranger Assistants under general supervision perform routine grounds maintenance work in County Parks, collect fees, enforce County Park regulations, perform techniques and procedures to keep parks clean and safe, and assist the Park Ranger with providing visitor services and protecting the natural resources of the parks. The four areas that you may be assigned to are:\n\nLake Solano located in Winters, which is shaded riverside setting with campgrounds, a nature center, a day park with picnic areas, fishing, and non-motorized boat rental.\nSandy Beach located in Rio Vista, is the only local sand beach on the Sacramento River, which has campgrounds, picnic grounds, and a boat launch.\n\nLynch Canyon Open Space Park located in Vallejo, has a hilly, natural landscape with 10 miles of trails for hiking, birdwatching, trail running, horseback riding and mountain biking.\n\nBelden's Landing Boat Launch located in Suisun City, which is a great place to go boating or fishing off the pier.\n\nTo learn more about park location and amenities offered at each park click here: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=19543\n\nThe eligible list established from this recruitment will be used to fill full-time and part-time regular, limited-term or extra-help positions as vacancies occur or the need arises.\nPOSITION REQUIREMENTS\n\nEDUCATION: High School Diploma, GED or equivalent;\n\nEXPERIENCE: Six (6) months of experience in grounds keeping or semi-skilled maintenance work that included considerable contact with the public.\n\nLICENSING, CERTIFICATION AND REGISTRATION REQUIREMENTS:\nApplicants are required to possess a valid California Drivers License, Class C.\n\nIncumbents will be required to obtain first aid and CPR certifications within the probationary period.\n\nNote: All licenses and certificates must be kept current while employed in this class.\n To view the job description for this position, please visit:\nhttp://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=16073\nBENEFITS\nSolano County offers a cafeteria-style medical package with health benefits, offered through CalPERS. The County contribution for family coverage for the 2018 calendar year is $1,520.73 per month. The County offers a cash back provision for those who choose employee-only or who waive medical insurance coverage. The County may offer a supplemental contribution for employees enrolled in Employee plus Two or More coverage.\nDental and vision insurances for the employee and eligible dependents are paid 100% by the County.\n\nSolano County participates in CalPERS retirement and contributes to Social Security.\nThe County observes 12 fixed, paid holidays per year.\n\nVacation is accrued at approximately 10 days per year for the first 3 years.\nSick leave accrues at approximately 12 days per year.\nEmployees are eligible to receive an additional 2.5% longevity pay, per level, after the completion of continuous service at 10, 20, 25, 30, 35 years.\n\nTo view the benefits for a regular position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=16477\n\nExtra-help employees who work less than 29 hours per week do not typically receive or accrue benefits of regular employees during their period of employment. All extra-help employees accrue .034 hours of Sick Leave for every full hour worked.\n\nTo view the benefits for an extra-help position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=21216\nSelection Process\n11/28/2018  Deadline to submit application.\n12/13/2018  Tentative date for written exam for most qualified applicants.\nBased on the information provided in the application documents, the qualified applicants may be invited for further examination and will either be pre-scheduled by the Department of Human Resources or be invited to self-schedule. All applicants meeting the minimum qualifications are not guaranteed advancement through any subsequent phase of the examination. Depending upon the number of applications received, the selection process may consist of an initial application screening, a mandatory information meeting, a supplemental questionnaire assessment, a written and/or practical exam, an oral board exam, or any combination listed. Responses to supplemental questions may be used as screening and testing mechanisms and will be used to assess an applicants ability to advance in the process; as such, responses to supplemental questions should be treated as test examination responses. Information contained herein does not constitute either an expressed or implied contract.\n\nA minimum score of 70% is required to continue in the selection process, unless otherwise announced.\n\nAll potential new hires and employees considered for promotion to management, confidential positions or unrepresented positions will be subject to a background and reference check after contingent job offer is accepted. These provisions are subject to change.\n\nRETIREES - Solano County invites all qualified candidates to apply for positions; however pursuant to Government Code Section 21221(h) and 21224, hiring restrictions may apply to California Public Sector Pension Plan Retirees."}, {"title": "Construction Laborer", "company": "Trimble Construction and Custom Painting", "location": "San Mateo, CA", "job url": "Not Available", "description": "$10,000 - $50,000 a yearPart-timeResidential construction helperJob Type: Part-timeSalary: $10,000.00 to $50,000.00 /yearLicense:Ca drivers license (Required)Language:English (Required)"}, {"title": "Construction Laborer", "company": "TA Loving Company", "location": "Wilson, NC", "job url": "Not Available", "description": "Who We AreWith over 93 years of higher education, healthcare and bridge/utility experience, T.A. Loving Company is a proven leader in the construction industry. Our commitment to quality and integrity are just two examples of why we have a repeat client list. We appreciate the long-term relationships that we carry with us, and also the longstanding employees that have stayed with our company for many years. Our loyal employees make the success of our company possible, and many employees have dedicated their entire careers to T.A. Loving.What We Stand ForWhat you do matters. Experience T.A. Loving Company's culture where you are valued and appreciated to work together to live out our 5 Core Values: Integrity, Safety, Excellence, Client Advocacy, Teamwork, and High Ethical Standards.Job DescriptionThe Laborer works under the supervision of the Foreman. Performs duties on construction project by transferring from one task to another where demands require worker to understand and follow instructions and have varied experience and ability to work without close supervision.Job Attributes-Displays professionalism, a good work ethic, and is accountable for ones actions.-Listens, follows directions, and communicates well with individuals and team members.-Acts in an ethical manner, treats coworkers, customers, vendors and visitors with respect, and is adaptable to a changing environment.Responsibilities and Duties-The Laborer operates hand and power tools of all types: shovel, sledge hammer, pick axe, wrecking bar, concrete saw, chain saw, water pump, air compressor, hand tools, chipper, grinder, sander, paving breaker, jack hammer, and air wrench.-Measures distances from grade stakes, drives stakes and stretches tight line.-Bolts, nails, align and blocks up under forms.-May signal operators of construction equipment to facilitate alignment, movement and adjustment of machinery to conform to grade specifications.-Levels earth to grade specifications.-Mixes concrete; smooth and finish freshly placed concrete.-Mops, brushes or spreads paints or bituminous compounds over surfaces for protection.-Sprays materials such as water, sand, steam, vinyl, paint or stucco through hose to clean, coat or seal surfaces.-Applies caulking compounds by hand or with caulking gun to seal crevices.-Grinds, sands or polishes surfaces such as concrete, marble, terrazzo or wood flooring.-Demolishes buildings, saws lumber, dismantles forms, removes projections from concrete, mounts pipe hangers, and cuts and attaches insulating material.*Must be willing to travel if required.Qualifications and SkillsWhile performing the duties of this job, the employee is required to:-Stand; walk; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; and stoop, kneel, crouch or crawl.-Work as a teamplayer by communicating effectively-Be able to lift and/or move up to 80 pounds.-Work in all weather conditions and rugged terrain-Be knowledgeable about and follow the companys safety policies and procedures as described in the Company safety manualEducation and/or ExperienceHigh School diploma or general education degree (GED) and one to three months related experience or training, or an equivalent combination of education and experience.BenefitsT.A. Loving offers medical, dental, life, flexible spending account for medical and/or day care expenses, and long term disability (salaried employees only) after your successful completion of sixty (60) days of employment as a full time employee (working 35 hours or more per week). We also have a competitive 401K plan in which new employees may enroll quarterly.T.A. LOVING COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER.Job Type: Full-time"}, {"title": "Construction Worker", "company": "Halverson Decor", "location": "Laguna Niguel, CA", "job url": "Not Available", "description": "$50,000 a yearOur company is expanding rapidly with tons of builds and is only going to continue to grow! We specialize in custom decor, and do commercial remodeling, residential remodeling and everything in between. There is room for advancement and we pay competitively and based on experience as well as qualifications!This is an exciting opportunity to work for a very good company that is treated like a family!Only apply with experience and resumes to prove so. We will be scheduling interviews immediately as we are looking for qualified candidates to start right away.Job Type: Full-timeSalary: $50,000.00 /year"}, {"title": "Skilled Laborer", "company": "Advanced Creative Concrete", "location": "Yucaipa, CA 92399", "job url": "Not Available", "description": "Looking for a Laborer / concrete finisher. Must be reliable and be able to to lift 100 lbs. Must know or be willing to learn the trade of concrete and masonry.Job Type: Full-timeExperience:Skilled Labor: 2 years (Preferred)"}, {"title": "Construction Laborer", "company": "Trimble Construction and Custom Painting", "location": "San Mateo, CA", "job url": "Not Available", "description": "$10,000 - $50,000 a yearPart-timeResidential construction helperJob Type: Part-timeSalary: $10,000.00 to $50,000.00 /yearLicense:Ca drivers license (Required)Language:English (Required)"}, {"title": "Laborer (Hourly)", "company": "Packer Sanitation Services, Inc. | Packers Sanitation Services, Inc.", "location": "Brawley, CA 92227", "job url": "https://www.indeed.com/rc/clk?jk=dc4b9fcd05357c63&from=vj&pos=top", "description": "Para ver la descripcion de trabajo en espanol, por favor desplacese hacia abajo hasta el final de la pagina.\n\nPOSITION SUMMARY\nThe position performs sanitation labor by performing the seven steps of sanitation while understanding and complying with all safety policies and procedures. The sanitation team member must understand how to work with necessary chemicals, work at a pace and delivers a clean plant to the customer on time and abide by company policies, including satisfactory attendance.\nESSENTIAL FUNCTIONS\nTo be qualified to perform a Sanitation team member job, an individual must be able to perform each essential duty satisfactorily, with or without reasonable accommodation:\nWork cooperatively with leads and PSSI management to ensure sanitation procedures are followed.\nFrequently lift hoses, equipment and chemical containers, etc.\nWear employer-specified PPE (gloves, face shield, eye goggles, aprons, boots, safety glasses, etc.).\nExposer to chemicals (with PPE required for the task).\nAll night standing, lifting, crouching for periods at a time).\nPerform all tasks safely.\nUse Lock-out/Tag-out.\nOther duties as assigned.\nJOB PERFORMANCE MEASURES\nTeam members are considered to be qualified (fully trained) when they achieve satisfactorily the following five categories:\nSeven steps of sanitation- Capable of following all the steps with detailed supervision.\nSafety- Understanding and compliance all of the safety policies covered during training.\nChemicals- Understanding of chemical types, labeling, PPE and warnings regarding to mixing chemicals.\nPace-Work at a acceptable speed to deliver the plant on time.\nAttendance- Dependability in both: arriving and completing the work shift and compliance with attendance policy.\nMINUMUM QUALIFICATIONS\nAccountable for his/her own actions, ability to take direction and instruction from managers, prompt and timely, safety awareness, attention to detail, ability to focus on tasks at hand, adaptability, communication with peers, strong work ethic, ability to wear personal protective equipment, ability to work in environments with extreme temperature fluctuations.\nSKILLS & ABILITIES\nThis position requires safety awareness, attention to detail, adaptability and a strong work ethic.\nPHYSICAL DEMANDS\n\n\nLift/Carry\n\nStand C (Constantly) 10 1bs or less C (Constantly)\n\nWalk C (Constantly) 11-20 lbs F (Frequently)\n\nSit O (Occasionally) 21-50 lbs F (Frequently)\n\nHandling / Fingering C (Constantly) 51-100 lbs O (Occasionally)\n\nReach Outward F (Frequently) Over 100 lbs O (Occasionally)\n\nReach Above Shoulder F (Frequently) Push/Pull\n\n\nClimb O (Occasionally) 12 lbs or less C (Constantly)\n\nCrawl O (Occasionally) 13-25 lbs F (Frequently)\n\nSquat or Kneel F (Frequently) 26-40 lbs F (Frequently)\n\nBend F (Frequently) 41-100 lbs O (Occasionally)\n \n\nN (Not Applicable) Activity is not applicable to this occupation.\n O (Occasionally) Occupation requires this activity up to 33% of the time (0 - 2.5+ hrs/day).\n F (Frequently) Occupation requires this activity from 33% - 66% of the time (2.5 - 5.5+ hrs/day).\n C (Constantly) Occupation requires this activity more than 66% of the time (5.5+ hrs/day).\n\nWORK ENVIRONMENT\nThis position would involve you to be in a wet, hot, and or cold environment. Shift may vary depending on location. JOB DESCRIPTION ACKNOWLEDGMENT I have received, reviewed and fully understand the job description for the Sanitation Team Member position. I understand that the Sanitation Team Member position is a non-exempt position. I further understand that I am responsible for the satisfactory execution of the essential functions described herein.\n\nRESUMEN DE LA POSICION\nEsta posicion lleva a cabo una labor de saneamiento por medio de los siete pasos de saneamiento fundamentales, todo esto bajo el entendimiento y el seguimiento de las politicas y procedimientos de seguridad. El empleado de saneamiento debe saber como funcionan los quimicos, como trabajar a ritmo constante para entregar la planta limpia al cliente en el tiempo requerido y debe asistir de manera continua, siguiendo las politicas de la compania, incluyendo una asistencia satisfactoria.\nFUNCIONES ESENCIALES/ LABORES DEL TRABAJO\nPara cualificar para la realizacion del trabajo del miembro del equipo de saneamiento, el individuo debe ser capaz de realizar cada labor esencial de manera satisfactoria, con o sin acomodacion razonable:\nTrabajar en cooperacion con los lideres y los gerentes de PSSI para asegurarse que los procedimientos de saneamiento se estan llevando a cabo.\nCon frecuencia levantar mangueras, equipos y contenedoras de quimicos etc.\nHacer uso del Equipo de Proteccion Personal PPE (Guantes, careta, gafas protectoras, mandiles, botas y lentes de seguridad).\nExposicion con quimicos (Haciendo uso del PPE requerido para la realizacion de las labores).\nEstar toda la noche de pie, levantando objetos y agachandose durante extensos periodos de tiempo.\nRealizar todas las labores de manera segura.\nUsar el procedimiento de candado/ etiqueta.\nOtras tareas que le sean asignadas.\nMEDIDAS DE REALIZACION DEL TRABAJO\nLos miembros del equipo son considerados como cualificados (totalmente entrenados) cuando ellos alcanzan de manera satisfactoria las siguientes categorias:\nLos 7 pasos de saneamiento- Se deben seguir estos pasos con minima supervision.\nSeguridad- Entendimiento y seguimiento de las politicas de seguridad discutidas durante el entrenamiento inicial.\nQuimicos- Comprension de los diferentes tipos de quimicos, su etiqueta, el PEE y las advertencias acerca de la mezcla de quimicos.\nRitmo de trabajo- Trabajar a una velocidad considerable con el fin de entregar la planta en el tiempo determinado.\nAsistencia- Incluye tanto llegar a tiempo y completar el trabajo de turno como seguir las politicas respecto a la asistencia.\nCUALIFICACIONES MINIMAS\nResponsable por sus propias acciones, habilidad de seguir direcciones e instrucciones de la gerencia, ser raudo y puntual, consciente de la seguridad, detallista, habilidad para enfocarse en tareas que estan a la mano, adaptabilidad, comunicacion con los colegas, una etica de trabajo fuerte, habilidad para utilizar equipo de proteccion personal, habilidad para trabajar en ambientes con fluctuacion extrema de temperatura.\nCOMPETENCIAS Y HABILIDADES\nEsta posicion requiere de una consciencia de seguridad, ser detallista, tener adaptabilidad y una etica de trabajo fuerte.\nDEMANDAS FISICAS\nDemandas fisicas Cargas\n\n\nCargas\n\nDe pie C (Constante) 10 lbs o menos C (Constante)\n\nCaminar C (Constante) 11-20 lbs F (Frecuente)\n\nSentado O (Ocasional) 21-50 lbs F (Frecuente)\n\nManipular / Uso de dedos C (Constante) 51-100 lbs O (Ocasional)\n\nAlcanzar hacia afuera F (Frecuente) Mas de 100 lbs O (Ocasional)\n\nAlcanzar sobre el hombro F (Frecuente) Empujar / Halar\n\n\nEscalar O (Ocasional) 12 lbs o menos C (Constante)\n\nGatear O (Ocasional) 13-25 lbs F (Frecuente)\n\nArrodillarse F (Frecuente) 26-40 lbs F (Frecuente)\n\nDoblarse F (Frecuente) 41-100 lbs O (Ocasional)\n\n\nN (No Aplica) La actividad no es aplicable para esta ocupacion\nO (Ocasional) La ocupacion requiere de esta actividad hasta de un 33% del tiempo (0- 2.5+horas/dia)\nF (Frecuente) La ocupacion requiere de esta actividad de 3% a 66% del tiempo (2.5-5.5 +horas/dia)\nC (Constante) La ocupacion requiere de esta actividad mas del 66% del tiempo (5.5 +horas/dia)\n\nAMBIENTE DE TRABAJO\nEsta posicion lo involucra en un ambiente mojado caliente y/o frio. El turno puede variar dependiendo de la locacion.\n\nRECONOCIMIENTO DE LA DESCRIPCION DEL TRABAJO\nYo he recibido, revisado y totalmente he entendido la descripcion de trabajo para la posicion de miembro del equipo de saneamiento. Yo entiendo que la posicion de miembro del equipo de saneamiento es una posicion no-exenta. Mas alla entiendo que soy responsable por la ejecucion satisfactoria de las funciones esenciales descritas aca.\n\nWith over 15,000 employees and 460 food processing facilities that we clean nightly, we have more sanitation boots on the ground than any company in North America. We have extensive large plant experience with primary supplier position in Tyson Foods, JBS/Pilgrims, and Cargill with over 6,000 PSSI employees cleaning their plants daily. After 40 years in the business, PSSI is positioned for growth through diversification of services and acquisition.Con ms de 15,000 empleados y 460 empresas procesadoras de comida que limpiamos cada noche, tenemos ms botas de saneamiento en el piso que cualquier otra compaa en Norte Amrica. Tenemos una extensa experiencia en plantas con posiciones de suministro primario en Tyson Food, JBS/Pilgrims y Cargill, con ms de 6,000 empleados que limpian sus plantas diariamente. Despus de 40 aos en el negocio, PSSI est posicionado para el crecimiento a travs de la diversificacin de servicios y adquisiciones.\n\nBrand: Packer Sanitation Services, Inc.\nAddress: 57 Shank Road Brawley, CA - 92227\nProperty Description: 707 - One World Beef LLC\nProperty Number: 0707"}, {"title": "Construction Bid Coordinator", "company": "Sun Country Builders", "location": "Vista, CA 92084", "job url": "Not Available", "description": "$34,000 - $64,000 a yearSuccessful Multi-Family General Contractor is seeking to hire a Bid Coordinator for their North County San Diego Office.Responsibilities: (not all inclusive)Manage Bid Invitations and maintain estimating scheduleCommunicate with Vendors and Subs to solicit pricingOrganize sub-contractor quotesAdministrative support to Estimating & Self-PerformAnalyze drawings and specificationsProvide clear detailed quantity take-offsMaintain sub databaseRequirements: Requires 2-4 years construction experienceStrong Word, Excel, MS Project and general computer skills.Strong written and verbal communicationGoal Oriented, self-starter, well organized and able to establish priorities and deadlinesTeam player with the ability to get along and respect othersWe offer a competitive compensation and benefits package and an excellent and supportive work environment.Job Type: Full-timeSalary: $34,000.00 to $64,000.00 /yearExperience:Project Coordinator: 1 year (Preferred)Construction: 1 year (Preferred)"}, {"title": "General Laborer", "company": "MBM Construction Services, LLC", "location": "Schenectady, NY", "job url": "Not Available", "description": "$17.50 an hourDesired: Construction ExperienceGrowing construction company based out of Schenectady looking to hire reliable, full-time general laborers.Job Type: Full-timeSalary: $17.50 /hourExperience:construction: 1 year (Preferred)"}, {"title": "Installer I", "company": "Tesla", "location": "Vista, CA", "job url": "https://www.indeed.com/rc/clk?jk=76fb21f37a3703df&from=vj&pos=top", "description": "THE ROLE\n\nThe Installer I will be part of Teslas Energy Field Operations team. As an integral member of the team, the ideal candidate will work cooperatively with other team members to successfully complete the installation of residential PV solar systems, battery storage and EV wall connectors safely and on time. It is the responsibility of every Installer to ensure safe work practices for Teslas installation team. New hire training and continued training will be provided.\n\nRESPONSIBILITIES\n\nLayout, assembly and installation of solar array and mounting hardware\nAssist with the electrical wiring of all energy products\nPrepare and clean-up job site\nWork with the warehouse team to pull materials for each installation job\nAttend weekly team meetings and mandatory training sessions on new products, installation methodology and safety\nProvide an exceptional customer experience to all customers throughout the process\nAdditional duties required as needed\n\nREQUIREMENTS\n\nRoof work, general construction, or carpentry experience preferred\n Ability to safely handle tools and materials such as: ladders, inverters, solar panels, panel boards, batteries, and other similar electrical equipment, lumber, roofing materials, etc.\nAbility to work in extreme environments (example: hot sun, cold, crawl spaces, etc.)\n Capable of working at heights including on rooftops, climbing ladders and stairs; and performing repetitious duties, including lifting, bending and standing for long periods of time\nExperience using basic hand and power tools\nBasic computer skills preferred\nMust have excellent written and verbal communication skills\nMust have excellent customer service skills\nExcellent attendance is crucial for the team to achieve success\nAbility to work well with others in a collaborative team environment\n\n\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Cashier", "company": "Builders FirstSource", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=0eab382381a81c74&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "General Construction Laborer", "company": "DBS CONSTRUCTION", "location": "Ukiah, CA 95482", "job url": "Not Available", "description": "$15 - $18 an hourPart-timePart time construction worker wanted for small construction company working in Lake and Mendocino counties. Must have some experience and reliable transportation. Must be able to Work occasional weekends and flexible hours. Immediate availability. Please provide contact info a brief summary of experience.Job Type: Part-timeSalary: $15.00 to $18.00 /hourExperience:Construction: 1 year (Preferred)Work authorization:United States (Preferred)"}, {"title": "Construction Laborer", "company": "Mrwestco", "location": "Denver, CO", "job url": "Not Available", "description": "$42,000 a yearEstablished company needs 4 new field employees. No experience necessary. Must be handy with tools , we will train to drywall/framing/painting. Reliable transportation is a MUST!Job Type: Full-timeSalary: $42,000.00 /year"}, {"title": "Fiber Construction Planner", "company": "Wiverse", "location": "San Diego, CA", "job url": "Not Available", "description": "ContractWIVERSE provides specialized staffing solutions for the Telecommunication Industry and wants to help you find your path! Our client is looking to hire a Construction Planner for their San Diego, CA locationSummary:The Construction Planner plans, coordinates and builds new, rebuild and upgrade construction projects. Performs field engineering, creates efficient route designs and estimates costs. May allocate and activates fiber when applicable. Plans network splicing for coax and fiber optic networks. May obtain access and right-of-way agreements where applicable. Coordinates permitting and pole applications, joint-trenching, and make-ready for utility poles. Repairs and inspects Hybrid Fiber Coax (HFC) networks and ensures backbone is available for launch or deployment of products.Responsibilities:Performs field engineering of proposed projects and ensures alternative routing delivers the most cost-effective design for construction.Coordinates all customer implementation activities including site walk-throughs, node placements and subcontract labor.Coordinates contractor work, coordinates and/or obtains permits, access, or ROW agreements where applicable, distributes design prints and other necessary working documents. Negotiates and approves design or construction changes.Researches and reviews plans, gathers necessary data and listing material requirements for project.Coordinates with public works personnel, developers, commercial customers, building owners, and utilities on joint trench projects.Maintains workflow databases and updates schedules. Participates in managing and estimating cost forecasts, material planning, capital and expense budgets.Estimates construction costs, prepares budgets, and tracks expenses.Participates in managing and estimating revenue forecasts, material planning, capital and expense budgets.Verifies serviceability, surveys proposed service routing, and estimates material, construction, and labor costs.Initiates customer contacts, coordinates and/or secures access or ROW agreements, completes route designs, and takes necessary steps to meet customer needs.May order materials or coordinate with administrative personnel; may verify and reconcile invoices.May plan and allocate fibers for splicing and activation.May inspect construction work or coordinate inspection assignments.Releases addresses as serviceable and notifies other departments of serviceability.As projects are completed, performs tasks to close tasks in database/tool, reconcile assets, and generate reports to ensure proper closure of project.Job Type: ContractExperience:Fiber: 2 years (Preferred)Civil Engineering Drawings: 2 years (Preferred)Construction Planning: 2 years (Preferred)"}, {"title": "Construction Laborer", "company": "KR Wolfe", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=5891391b016283b5&from=vj&pos=top", "description": "Summary:\nThe position of Construction Laborer is an essential role who will be assisting the project team in ensuring timely and successful completion of construction projects.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nCore duties and responsibilities include, but are not limited to, the following:\n\nAssist Project Superintendent\n\nMaintaining a clean job site - pick up tools and equipment and secure job site each day in order to eliminate potential hazards\n\nFraming and Drywall experience\n\nSet up and take down ladders, barriers and other temporary structure\n\nMay assist with controlling traffic\n\nOperate and care for construction equipment and machines\n\nHelp equipment operator, carpenters, and other skilled labor when necessary\n\nLoad or unload construction materials\n\nFollow instructions from supervisors\n\nAssist craft workers\n\nReady to learn from on-the-job training when necessary\n\nCOMPETENCIES:\nTo perform the job successfully, an individual should demonstrate the following competencies:\n\nAnalytical - Synthesizes complex or diverse information; collects and researches data; uses intuition and experience to complement data; designs work flows and procedures.\n\nDesign - Generates creative solutions; translates concepts and information into images; uses feedback to modify designs; applies design principles; demonstrates attention to detail.\n\nProblem Solving - Identifies and resolves problems in a timely manner; gathers and analyzes information skillfully; develops alternative solutions; works well in group problem solving situations; uses reason even when dealing with emotional topics.\n\nProject Management - Develops project plans; coordinates projects; communicates changes and progress; completes projects on time and budget; manages project team activities.\n\nTechnical Skills - Assesses own strengths and weaknesses; pursues training and development opportunities; strives to continuously build knowledge and skills; shares expertise with others.\n\nCustomer Service - Manages difficult or emotional customer situations; responds promptly to customer needs; solicits customer feedback to improve service; responds to requests for service and assistance; meets commitments.\n\nInterpersonal Skills - Focuses on solving conflict, not blaming; maintains confidentiality; listens to others without interrupting; keeps emotions under control; remains open to others' ideas and tries new things.\n\nOral Communication - Speaks clearly and persuasively in positive or negative situations; listens and gets clarification; responds well to questions; demonstrates group presentation skills; participates in meetings.\n\nWritten Communication - Writes clearly and informatively; edits work for spelling and grammar; varies writing style to meet needs; presents numerical data effectively; able to read and interpret written information.\n\nTeamwork - Balances team and individual responsibilities; exhibits objectivity and openness to others' views; gives and welcomes feedback; contributes to building a positive team spirit; puts success of team above own interests; able to build morale and group commitments to goals and objectives; supports everyone's efforts to succeed.\n\nVisionary Leadership - Displays passion and optimism; inspires respect and trust; mobilizes others to fulfill the vision; provides vision and inspiration to peers and subordinates.\n\nChange Management - Develops workable implementation plans; communicates changes effectively; builds commitment and overcomes resistance; prepares and supports those affected by change; monitors transition and evaluates results.\n\nDelegation - Delegates work assignments; matches the responsibility to the person; gives authority to work independently; sets expectations and monitors delegated activities; provides recognition for results.\n\nLeadership - Exhibits confidence in self and others; inspires and motivates others to perform well; effectively influences actions and opinions of others; accepts feedback from others; gives appropriate recognition to others.\n\nManaging People - Includes staff in planning, decision-making, facilitating and process improvement; takes responsibility for subordinates' activities; makes self available to staff; provides regular performance feedback; develops subordinates' skills and encourages growth; solicits and applies customer feedback (internal and external); fosters quality focus in others; improves processes, products and services.; continually works to improve supervisory skills.\n\nQuality Management - Looks for ways to improve and promote quality; demonstrates accuracy and thoroughness.\n\nBusiness Acumen - Understands business implications of decisions; displays orientation to profitability; demonstrates knowledge of market and competition; aligns work with strategic goals.\n\nCost Consciousness - Works within approved budget; develops and implements cost saving measures; contributes to profits and revenue; conserves organizational resources.\n\nDiversity - Demonstrates knowledge of EEO policy; shows respect and sensitivity for cultural differences; educates others on the value of diversity; promotes a harassment-free environment; builds a diverse workforce.\n\nEthics - Treats people with respect; keeps commitments; inspires the trust of others; works with integrity and ethically; upholds organizational values.\n\nOrganizational Support - Follows policies and procedures; completes administrative tasks correctly and on time; supports organization's goals and values; benefits organization through outside activities; supports affirmative action and respects diversity.\n\nStrategic Thinking - Develops strategies to achieve organizational goals; understands organization's strengths & weaknesses; analyzes market and competition; identifies external threats and opportunities; adapts strategy to changing conditions.\n\nJudgment - Displays willingness to make decisions; exhibits sound and accurate judgment; supports and explains reasoning for decisions; includes appropriate people in decision-making process; makes timely decisions.\n\nMotivation - Sets and achieves challenging goals; demonstrates persistence and overcomes obstacles; measures self against standard of excellence; takes calculated risks to accomplish goals.\n\nPlanning/Organizing - Prioritizes and plans work activities; uses time efficiently; plans for additional resources; sets goals and objectives; organizes or schedules other people and their tasks; develops realistic action plans.\n\nProfessionalism - Approaches others in a tactful manner; reacts well under pressure; treats others with respect and consideration regardless of their status or position; accepts responsibility for own actions; follows through on commitments.\n\nQuality - Demonstrates accuracy and thoroughness; looks for ways to improve and promote quality; applies feedback to improve performance; monitors own work to ensure quality.\n\nQuantity - Meets productivity standards; completes work in timely manner; strives to increase productivity; works quickly.\n\nSafety and Security - Observes safety and security procedures; determines appropriate action beyond guidelines; reports potentially unsafe conditions; uses equipment and materials properly.\n\nPhysical  Must maintain a healthy physique able to lift a minimum of 50 lbs, hold a minimum of 30 lbs overhead for an extended period, squat/sit in small space for extended period, and aid in other overall physical job requirements.\n\nAdaptability - Adapts to changes in the work environment; manages competing demands; changes approach or method to best fit the situation; able to deal with frequent change, delays, or unexpected events.\n\nAttendance/Punctuality - Is consistently at work and on time; ensures work responsibilities are covered when absent; arrives at meetings and appointments on time.\n\nDependability - Follows instructions, responds to management direction; takes responsibility for own actions; keeps commitments; commits to long hours of work when necessary to reach goals; completes tasks on time or notifies appropriate person with an alternate plan.\n\nInitiative - Volunteers readily; undertakes self-development activities; seeks increased responsibilities; takes independent actions and calculated risks; looks for and takes advantage of opportunities; asks for and offers help when needed.\n\nInnovation - Displays original thinking and creativity; meets challenges with resourcefulness; generates suggestions for improving work; develops innovative approaches and ideas; presents ideas and information in a manner that gets others' attention.\n\nQUALIFICATIONS:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Must have valid drivers license.\n\nEDUCATION AND/OR EXPERIENCE:\n2+ years medical construction experience, familiarity with low voltage audio/video cabling, basic construction functions, as well as employee management and customer service. Demonstrated knowledge of proper use of equipment, materials and supplies used on commercial construction projects. Ability to work independently and complete daily activities according to work schedule.\n\nLANGUAGE SKILLS:\nAbility to read, analyze, and interpret the most complex documents. Ability to respond effectively to the most sensitive inquiries or complaints. Ability to write speeches and articles using original or innovative techniques or style. Ability to make effective and persuasive speeches and presentations on controversial or complex topics to top management, public groups, and/or boards of directors.\n\nMATHEMATICAL SKILLS:\nAbility to work with mathematical concepts such as probability and statistical inference, and fundamentals of plane and solid geometry and trigonometry. Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.\n\nREASONING ABILITY:\nAbility to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.\n\nCOMPUTER SKILLS:\nTo perform this job successfully, an individual should have basic knowledge of Project Management software; Accounting software; Contact Management systems; Database software; Design software; Development software; Internet software; Inventory software; Manufacturing software; Order Processing systems; Spreadsheet software and Word Processing software utilized by KR Wolfe Inc.\n\nPHYSICAL DEMANDS:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job, the employee is regularly required to sit; use hands to finger, handle, or feel and talk or hear. The employee is frequently required to reach with hands and arms. The employee is occasionally required to stand; walk; climb or balance; stoop, kneel, crouch, or crawl and taste or smell.\n\nThe employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 75 pounds.\n\nSpecific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.\n\nFULL TIME:\nThis position requires a minimum of a 40-hour work week, and our work week is Monday through Sunday. This is an hourly position and considered non-exempt, which means you are eligible to earn overtime. At times additional hours will be required within the guidelines of the job description.\n\nKR Wolfe is an Equal Opportunity Employer."}, {"title": "Construction Laborer", "company": "A nyc construction company.", "location": "New York, NY", "job url": "Not Available", "description": "$15 an hourMust be energetic and have a team player personality.Understand safety in the work place.Have osha 10.Your job will be.To keep job site clean.Assist carpenters when needed.Dust protection on floors and plastic door areas when needed.Lift garbage from apartment to the street for pickup.Job Type: Full-timeSalary: $15.00 /hourExperience:construction: 3 years (Preferred)Language:English (Preferred)Work authorization:United States (Preferred)"}, {"title": "Construction Intern", "company": "Meritage Homes Corporation", "location": "Irvine, CA", "job url": "https://www.indeed.com/rc/clk?jk=04b8c7a3ee37cdb1&from=vj&pos=top", "description": "Temporary, InternshipResponsibilities\nThe Meritage Homes Internship program allows driven college/grad students the opportunity to gain experience with a National New Home Builder leading to possible future opportunities within the Meritage Homes family. You will work in an environment that fosters learning and allows you to take responsibility to help our team lead the way in our Green Building initiatives. The internship program uses your pursuit of education to drive you to a company where you can take your in class learning to hands-on applications. Meritage will work with your school schedule, because we value education as much as you do. You will work side by side with top professionals and executives as you start your career.\n\nThe Construction Intern will manage the new home construction process within assigned communities. Responsible for ensuring homes are delivered within specific cycle time and budget targets as well as customer quality expectations when closed. Responsible for maintaining customer satisfaction goals and providing needed customer care/warranty services in assigned communities.\n\nThe Construction Intern will work with and learn:\nThe permitting and building inspection process through the local jurisdiction(s)\nBuilding plans, materials and specifications\nAll Meritage processes required to build our homes\nProper scheduling and quality improvement systems\nStorm water pollution prevention and safety programs\nCustomer satisfaction programs including all customer points of contact\nThe Meritage Green System\nThe Meritage Customer Service program\nQualifications\nCurrently enrolled in a Bachelors or Masters degree program in Construction Management\nStrong academic record\nExcellent oral and written communication skills\nComputer skills in MS Office applications\nAbility/Desire to work in a team environment\nThis is a 3-month temporary field position taking place during the summer. This intern must be flexible to work at any of our locations throughout the summer.\nOverview\nAre you looking for an amazing career opportunity? Well, look no further! At Meritage Homes, we offer a variety of different careers and are dedicated to building beautiful, environmentally friendly homes, that give our customers the most memorable moments with their loved ones. Meritage Homes is a national top 10 homebuilder and a 2018 ENERGY STAR Partner of the Year in Sustained Excellence for being a leader in protecting the environment and advancing energy efficiency in homebuilding. If you have a self-starter mindset and want to be a part of something great, come join a company that helps people live happier, healthier lives.\nWhen joining Meritage Homes, you and your career can benefit in several ways, including:\nA work environment that encourages creativity and innovative ideas from every level\nAn organization that lives by its core values everyday\nMaintaining a consistent competitive drive to be the best\nA competitive pay structure\nStrong benefits\nState of the art technology to provide an optimal working environment\nFlexibility in work-life integration\nHaving pride in delivering a quality product that benefits people and the environment\nThe opportunity to further your career in a growing national organization\nTeam atmosphere where every individual is considered a vital part of the team"}, {"title": "Construction Worker", "company": "SCCP LLC", "location": "Sharonville, OH", "job url": "Not Available", "description": "$100 a daydont need experience we teach the workwork experience is a plusJob Type: Full-timeSalary: $100.00 /dayEducation:High school or equivalent (Preferred)"}, {"title": "Entry Level Construction Assistant", "company": "Highlands Energy Services", "location": "Newark, CA", "job url": "Not Available", "description": "Job DescriptionHighlands Energy Services an Alvarado Group company is a coalition of companies that includes civil engineering and construction company Vanguard Construction Services, general contracting company Highlands Diversified, and Highlands Energy Services, which focuses on energy conservation.We have immediate openings for Weatherization Specialists I. This is an entry level position with a two-week paid training. The ideal candidate will have experience with hand tools and the ability to provide excellent customer service!This position will require driving a company vehicle and clearing a Motor Vehicle Report.Responsibilities and DutiesDevelop the skills to ensure proper and timely installation of approved Energy Efficiency Measures and assists in the identification of additional energy efficiency measures available to the Customer.The Entry Level Construction Assistant position offers a Two-week paid training course.First week training: In-classSecond week training: Hands-on (basic hand tools required)Per Diem (meal allowance, mileage reimbursement, hotel expenses)Weekends off during trainingFull-Time Schedule:Monday - Friday 8-10 hours a dayOccasional Saturdays as neededEssential Duties and Responsibilities:Installs approved Energy Efficiency Measures as trained.Identifies and documents non-feasibility reason(s) of measure(s) not installed on work order as trained.Contributes to team effort by accomplishing related results as needed.Maintains continuity by documenting and communicating actions, irregularities, and continuing needs.Participate in all training sessions/meetings.Maintains safe and clean working environment by complying with procedures, policies, and regulations (including vehicle maintenance schedule and cleanliness policies).Report to work prepared and on time.Any tasks/duties given by the Production Supervisor.Responsible for the good image of the company outside the working area.Respect all the machinery, tooling and property of Highlands Energy Services.Actively pursue a \"Team Work\" environment.Protect the confidentiality of any processes inherent in the operation of Highland Energy Services.Required to drive a company vehicle and qualify for company insuranceOther duties as assigned.Skills and Qualifications: Ability to read, analyzes, interpret, and identify, document and report information as trained.Ability to install approved Energy Efficiency Measures as trained.Education and Experience: Required to have a High School Diploma or equivalent.Required to have a valid California Drivers License and a clear a Motor Vehicle Report.Physical Demands: While performing the duties of this job, the employee is frequently required to walk, climb, crawl, push, pull, reach, sit, stand, climb ladders, and work with various tools and equipment. Must be able to operate a pallet jack. Must be willing to work outside on a consistent basis. Have the ability to listen, understand, and communicate in writing and verbally. The employee will frequently be required to lift objects up to 50 pounds.BenefitsWe offer employees working full-time comprehensive benefits, including health coverage (medical, dental and vision), 401K, Employee Discounts, 8 paid Holidays off, Vacation Time and Sick Leave.Job Type: Full-timeApplication Questions: You have requested that Indeed ask candidates the following questions: How many years of construction experience do you have?How many years of Hand Tools experience do you have?Do you have the following license or certification: Valid CA Driver License?Are you willing to undergo a background check, in accordance with local law/regulations?Are you authorized to work in the following country: United States?Job Type: Full-timeExperience:construction: 1 year (Preferred)Hand Tools: 1 year (Preferred)License:Valid CA Driver License (Required)Work authorization:United States (Preferred)Onboarding time:Less than 1 month"}, {"title": "Apartment Rehab/Construction Laborer", "company": "FPI Management, Inc.", "location": "Los Angeles, CA 90027", "job url": "https://www.indeed.com/rc/clk?jk=5be5d037ce74879b&from=vj&pos=top", "description": "Job Details\nFPI Management is currently looking for a Rehab Maintenance Technician to join our team!\n\nOUR IDEAL CANDIDATE has verifiable work experience in an Apartment Maintenance or Facilities Maintenance role. Has the ability to be on-call, and has basic computer skills (email and internet). Is a self-motivated, customer service-oriented individual with exceptional attention to detail, and is someone who takes great pride in the quality of their work and is passionate about providing exemplary customer service!\n\nMINIMUM REQUIREMENTS for consideration are: a High School diploma or equivalent, English language proficiency (read, speak and write), and the ability to pass a full background check and drug screening (Note: As it relates to marijuana use, FPI will consider any applicable state law when dispositioning test results).\n\nWhy look at FPI for your next career step? We are one of the largest third-party property management companies in the Nation, an industry leader in both the Conventional and Affordable Housing spaces, with over 700 properties (over 100,000 units) across 14 states under our management. We offer comprehensive compensation and benefits packages, on-going training and professional development, and plenty of growth opportunities. Come join Team FPI!\n\nInterested? Click the Apply button above to learn more about this great opportunity to work with an industry leader!\n\n#WeAreTeamFPI\n\nEEO/EVerify Statements\nFPI Management is an Equal Opportunity Employer. All qualified applicants are encouraged to apply. FPI Management participates in the E-Verify program.\nSoftware Skills Required\nBasic Computer Skills, Internet Use, Google Apps (Gmail, Drive, Docs, Sheets)"}, {"title": "Concierge", "company": "THE LOT", "location": "La Jolla, CA 92037", "job url": "https://www.indeed.com/rc/clk?jk=a9a082098ed2550b&from=vj&pos=top", "description": "Desired: Restaurant ExperienceGuest ServicesUpsellingHospitality ExperienceTHE LOT is a revolutionary Entertainment, Experience, Lifestyle Venue that merges premium entertainment with our unique California communities to create an experience that is unsurpassed. A premium cinema and dining destination that is a social hub for elevated cuisine, craft coffee, special events, sophisticated cocktails as well as a comfortable co-work space, THE LOT truly creates the ultimate guest experience. THE LOT opened in Southern California - La Jolla in September of 2015, Liberty Station in May of 2016, and Newport Beach in April of 2018. THE LOT San Ramon is currently under construction, due to open in November with training to begin in October.\n\nAs Concierge at THE LOT, you will oversee our host stand, concierge section, and dining room floor. You are the face of the Company and will lead our guest experience. You will learn our brand and lifestyle entertainment concept. You will play an intricate role in FOH operations and will be the first smile a guest sees when coming to THE LOT. Whether seating guests in our Restaurant or selling the ultimate experience at Concierge, our Concierge Agents are the most helpful people around.\n\nRequirements\nPrevious work experience in guest services required.\nPrevious work experience in a hospitality industry strongly preferred.\nExperience working with Open Table, reservation systems, and handling multiple phone lines preferred.\nProvide the guest with an experience that will always be remembered and with the highest level of responsiveness.\nArrange for, suggest, recommend, book, and confirm, services that may include, but not limited to, purchasing gift cards, premium tickets, dining experiences and other promotional offers.\nProject an approachable and professional image in personal appearance, manner, and demeanor.\nAssure prompt and positive action on all guest concerns and suggestions, as well as conduct quality assurance follow-up.\nUse professional telephone etiquette in handling internal and external guest requests.\nPresent loyalty program and up-selling opportunities to our guests\nMust be at least 18 years of age.\nPrevious experience working in a restaurant required\nPrevious work experience as a Host strongly preferred\nOpen Weekend and Holiday Availability\n\n\nWe are an Equal Opportunity Employer\n\n"}, {"title": "Accounting Assistant", "company": "TW Construction", "location": "La Jolla, CA", "job url": "Not Available", "description": "$20 an hourPart-timeBoutique Construction Company seeking professional accounting assistant to assist Financial Controller with Billing12 construction jobs.Responsibilities consist of, but are not limited to, entering invoices, executing APR cycle, organizing invoicing system, taking control of invoicing email, corresponding with superintendents and sub-contractors on daily basis and job filing.Applicant must have a intermediate to high level of expertise on QuickBooks, able to multi-task, work in high-stress environment, and is able to work in an open space office area.Hours consist of but are not limited to: Monday- Friday 8:00 AM-4:00 PM, some Saturdays if needed. This Job can be part time and full time. Depending on work demand.Job Types: Full-time, Part-timeSalary: $20.00 /hourExperience:Accounting: 1 year (Required)"}, {"title": "Material Handler I Yard", "company": "Builders FirstSource", "location": "San Diego, CA 92110", "job url": "https://www.indeed.com/rc/clk?jk=2d1bc5ae6ee84142&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, handles and maintains the flow of materials and products on the premises according to established guidelines.\n\n\nPhysically handles materials used to construct components and finished products to ensure movement of such items is optimized; lifts, carries, stacks items as needed.\nOperates motorized and non-motorized material handling equipment, some of which may require specialized training.\n\nRequirements: High school diploma or General Education Degree (GED). This is a entry level position where the incumbent will receive on-the-job training.\n\nBajo supervisin directa, manipular y mantener el flujo de materiales y productos en las instalaciones segn los lineamientos establecidos. * Manipular fsicamente los materiales usados para construir componentes y productos terminados para garantizar el ptimo movimiento de dichos elementos; levantar, transportar y apilar elementos segn sea necesario. * Operar equipos de manipulacin de materiales motorizados y no motorizados, algunos de los cuales pueden requerir conocimiento especializado. Requisitos: ttulo secundario o ttulo de educacin general (GED, por sus siglas en ingls). Este es un puesto de nivel inicial donde el contratado recibir capacitacin laboral.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Sewer Work Construction Laborer", "company": "TV Plumbing", "location": "Culver City, CA", "job url": "https://www.indeed.com/rc/clk?jk=85b55abd0dec11ac&from=vj&pos=top", "description": "$30,000 - $40,000 a yearPart-timeOverview:\nWe are seeking a responsible assistant to join our team to perform manual labor tasks in support of skilled sewer line installer and plumber such as dig and back-fill, excavations, shore trenches, repair concrete patches. Plumbing Knowledge is a plus.\n\nResponsibilities:\nDigging thru dirt, mud, base material, concrete, asphalt by shovel and with mechanical equipment.\nCarry heavy objects no physical limitations.\n\n\n\nAbout TV Plumbing\n\n\nTV Plumbing has been locally owned and operated in Los Angeles since 1982. We have continually provided the most up-to-date technologies and friendliest service to our customers. We specialize in plumbing repairs, diagnostics and drain cleaning. We have the latest equipment and technology to quickly locate and solve your plumbing problems."}, {"title": "Permit Runner", "company": "Vivint Solar", "location": "San Diego, CA 92126", "job url": "Not Available", "description": "$14 - $16 an hourJoin Vivint Solar: Its Sunnier Here!Vivint Solar is the brighter and more affordable way to power your home. We believe people should have a choice in how to produce the energy they use to live every day. This is why were making it easy for people nationwide to choose to go solar. Were proud to be a leader in the renewable energy industry.The Vivint Solar team is in need of a Permit Specialist who will become a strong contributor and make a difference. In the Permit specialist role, you will be delivering and picking up building permits from municipalities as well as general office dutiesKey Job Duties:Run reports to ensure that all available permits are in the appropriate status and step in the approval processCompile permit packet with correct information for each cityDrive personal vehicle to cities in assigned territories to drop off and pick up building permitsCommunicate with City Officials to obtain permit approvalsCommunicate with internal Vivint Solar departments in regards to account status and approvalsScan received permits and update the account information in Salesforce and Google DocsFile paperworkMaintain current information on permitting requirements within assigned territoriesAssist in closing out permitsWork with Inspection team as neededGeneral customer support as neededPerform other general clerical duties as directed by office managementNecessary Skills and Experience:1 to 2 years of experience working in a fast paced administrative environmentExperience providing exceptional customer serviceHigh School Diploma or equivalentStrong interpersonal and human relations skillsExceptional written and verbal communication skillsStrong computer skills including but not limited to web based programs and ExcelAbility to multi-task and prioritizeAbility to work well with othersStrong analytical and creative problem solving skillsAbility to keep a positive attitudeBonus Points:Experience with construction permitsEmployees of Vivint Solar must submit to a criminal history check, motor vehicles check, drug screening, and obtain clearance from the state based upon the state requirements.We do not accept resumes from headhunters, placement agencies, or other suppliers that have not signed a formal agreement with us.Vivint Solar is a proud promoter of employment opportunities to our Military and Veterans. We, an equal opportunity employer, do not consider any protected traits (e.g. race, creed, color, religion, gender, national origin, non-job-related disability, age, or any other protected trait) when hiringunder federal, state and local laws.Job Type: Full-timeSalary: $14.00 to $16.00 /hour"}, {"title": "Fiber Construction Planner", "company": "Wiverse", "location": "San Diego, CA", "job url": "Not Available", "description": "ContractWIVERSE provides specialized staffing solutions for the Telecommunication Industry and wants to help you find your path! Our client is looking to hire a Construction Planner for their San Diego, CA locationSummary:The Construction Planner plans, coordinates and builds new, rebuild and upgrade construction projects. Performs field engineering, creates efficient route designs and estimates costs. May allocate and activates fiber when applicable. Plans network splicing for coax and fiber optic networks. May obtain access and right-of-way agreements where applicable. Coordinates permitting and pole applications, joint-trenching, and make-ready for utility poles. Repairs and inspects Hybrid Fiber Coax (HFC) networks and ensures backbone is available for launch or deployment of products.Responsibilities:Performs field engineering of proposed projects and ensures alternative routing delivers the most cost-effective design for construction.Coordinates all customer implementation activities including site walk-throughs, node placements and subcontract labor.Coordinates contractor work, coordinates and/or obtains permits, access, or ROW agreements where applicable, distributes design prints and other necessary working documents. Negotiates and approves design or construction changes.Researches and reviews plans, gathers necessary data and listing material requirements for project.Coordinates with public works personnel, developers, commercial customers, building owners, and utilities on joint trench projects.Maintains workflow databases and updates schedules. Participates in managing and estimating cost forecasts, material planning, capital and expense budgets.Estimates construction costs, prepares budgets, and tracks expenses.Participates in managing and estimating revenue forecasts, material planning, capital and expense budgets.Verifies serviceability, surveys proposed service routing, and estimates material, construction, and labor costs.Initiates customer contacts, coordinates and/or secures access or ROW agreements, completes route designs, and takes necessary steps to meet customer needs.May order materials or coordinate with administrative personnel; may verify and reconcile invoices.May plan and allocate fibers for splicing and activation.May inspect construction work or coordinate inspection assignments.Releases addresses as serviceable and notifies other departments of serviceability.As projects are completed, performs tasks to close tasks in database/tool, reconcile assets, and generate reports to ensure proper closure of project.Job Type: ContractExperience:Fiber: 2 years (Preferred)Civil Engineering Drawings: 2 years (Preferred)Construction Planning: 2 years (Preferred)"}, {"title": "Laborer Worker", "company": "Rogan Concrete Cutting Inc.", "location": "Anaheim, CA 92807", "job url": "Not Available", "description": "Laborer will assist concrete cutting and coring technician with equipment set-up, cleanup and concrete demo and removal.Job Type: Full-timeWork authorization:United States (Required)"}, {"title": "Construction Laborer", "company": "J.D. Danken Construction, Inc.", "location": "Middletown, OH 45044", "job url": "Not Available", "description": "$600 - $1,000 a weekGeneral Construction in a Heavy Industrial Setting. General labor, Carpentry, Concrete, Welding & Burning Experience Helpful But Not Required. OSHA 10 Hour Required, (Employer Will Provide) Pre-Employment Drug Screen Required. No Travel Required.Job Type: Full-timeSalary: $600.00 to $1,000.00 /weekExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Laborer / apprentice carpenter", "company": "The Karl Frank Company", "location": "Alamo, CA", "job url": "Not Available", "description": "$18 - $20 an hourLooking for construction laborers and apprentice carpenters no experience necessary will train. If you are looking to learn the construction trade from a well established company working on residential homes in the ease bay. This maybe your opportunity to learn a trade or further develop your skills.Job Type: Full-timeSalary: $18.00 to $20.00 /hourExperience:construction: 1 year (Preferred)Seasonal job:No"}, {"title": "Public Works Trainee", "company": "County of Solano", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=52c0ac27cabf220c&from=vj&pos=top", "description": "$42,381 - $51,515 a yearPart-timeDelivering Solutions for a Safe Community\nThe Department of Resource Management is a comprehensive agency comprised of the Public Works, Building and Safety, Planning Services, Environmental Health Services, Parks, and Administrative Services Divisions. The department provides for the well-being of Solano County's present and future residents and the public at-large through administration and enforcement of Federal, State, and Local laws and policies pertaining to transportation, building construction, land use planning environmental health, and recreation.\n\nThe Public Works Division is committed to providing a safe, well maintained and efficient roadway system. Public Works-Roads constructs and maintains the County's public roads and bridges in addition to maintaining roads, parking lots, and drainage facilities for other agencies.\nTo learn more about the Department of Resource Management, please visit:\nhttp://www.solanocounty.com/depts/rm/default.asp\nThe Position\nThe Public Works-Roads Divison has an exciting opporturtunity for entry level candidates looking to start a rewarding career as a Public Works Trainee.\n\nUnder immediate supervision, Public Works Trainees learn work methods and techniques in an assigned section of the Public Works Division. This entry level class performs a wide variety of tasks related to construction, repair, and maintenance of roads, flood control channels, roadside drainage, bridges, and traffic markings and signs. Grounds keeping work along roads, drainage channels, etc. and is done primarily to keep them free of obstructions, fallen limbs, overgrown vegetation, etc. Incumbents may be assigned to the Roads, Traffic Maintenance, or Flood Control sections.\n\nThe eligible list established from this recruitment will be used to fill full-time and part-time regular, limited-term or extra-help positions as vacancies occur or the need arises.\nPOSITION REQUIREMENTS\n\nEDUCATION AND EXPERIENCE:\nHigh school diploma or GED equivalent required. AND Three (3) months work experience in construction trades required.\nLICENSING, CERTIFICATION AND REGISTRATION REQUIREMENTS:\nApplicants are required to possess a valid California Drivers License, Class C. Possession of a valid Class B California Drivers License is required within three (3) months of employment.\nPossession of a valid Class A California Drivers License is required within six (6) months of employment.\n\nNote: The drivers license must be kept current while employed in this class. A Hazmat certification may be required.\n To view the job description for this position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=15996\nBENEFITS\nSolano County offers a cafeteria-style medical package with health benefits, offered through CalPERS. The County contribution for family coverage for the 2018 calendar year is $1,520.73 per month. The County offers a cash back provision for those who choose employee-only or who waive medical insurance coverage. The County may offer a supplemental contribution for employees enrolled in Employee plus Two or More coverage.\nDental and vision insurances for the employee and eligible dependents are paid 100% by the County.\nSolano County participates in CalPERS retirement and contributes to Social Security.\nThe County observes 12 fixed, paid holidays per year.\n\nVacation is accrued at approximately 10 days per year for the first 3 years.\nSick leave accrues at approximately 12 days per year.\nEmployees are eligible to receive an additional 2.5% longevity pay, per level, after the completion of continuous service at 10, 20, 25, 30, 35 years.\nTo view the benefits for a regular position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=16477\nExtra-help employees who work less than 29 hours per week do not typically receive or accrue benefits of regular employees during their period of employment. All extra-help employees accrue .034 hours of Sick Leave for every full hour worked.\n\nTo view the benefits for an extra-help position, please visit: http://www.solanocounty.com/civicax/filebank/blobdload.aspx?blobid=21216\nSelection Process\n11/29/2018  Deadline to submit application and required documents.\n12/20/2018  Tentative date for written exam.\n01/09/2019 and 01/10/2019  Tentative date for practical exam for most qualified applicants.\nBased on the information provided in the application documents, the qualified applicants may be invited for further examination and will either be pre-scheduled by the Department of Human Resources or be invited to self-schedule. All applicants meeting the minimum qualifications are not guaranteed advancement through any subsequent phase of the examination. Depending upon the number of applications received, the selection process may consist of an initial application screening, a mandatory information meeting, a supplemental questionnaire assessment, a written and/or practical exam, an oral board exam, or any combination listed. Responses to supplemental questions may be used as screening and testing mechanisms and will be used to assess an applicants ability to advance in the process; as such, responses to supplemental questions should be treated as test examination responses. Information contained herein does not constitute either an expressed or implied contract.\n\nA minimum score of 70% is required to continue in the selection process, unless otherwise announced.\n\nAll potential new hires and employees considered for promotion to management, confidential positions or unrepresented positions will be subject to a background and reference check after contingent job offer is accepted. These provisions are subject to change.\n\nRETIREES - Solano County invites all qualified candidates to apply for positions; however pursuant to Government Code Section 21221(h) and 21224, hiring restrictions may apply to California Public Sector Pension Plan Retirees."}, {"title": "Prefabricator (Construction / Laborers / Builders)", "company": "Tuff Shed, Inc.", "location": "Escondido, CA 92029", "job url": "https://www.indeed.com/rc/clk?jk=cf028eb1e16264be&from=vj&pos=top", "description": "$13.50 - $14.50 an hourTuff Shed, the industry leader in storage buildings and garages, is currently looking for construction/laborers/builders for our manufacturing facility in Escondido.\nDuties include painting, cutting lumber or plywood, assembling wall sections, trusses, doors, or any other fabricating and assembly duties associated with the construction of the Tuff Shed storage buildings.\nGreat benefits including paid vacation, paid holidays, medical/dental/vision and life insurance, and a 'Safe Harbor' 401(k) plan.\n\nSKILLS & EXPERIENCEAbility to carry out instructions communicated in writing, orally, or in diagram formAbility to read a tape measure, working drawings, and speed squareAbility to operate air compressors, air tools, hammer, saw, drill, and other basic power tools\nAbility to add and subtract in all units of standard US measures, using whole numbers, common fractions, and decimals\nAbility to regularly lift and/or move up to 50 pounds at least 100 feetCurrent valid driver's license and satisfactory Motor Vehicle Report preferredMust complete a criminal background check and drug screening\nTuff Shed, Inc. is an Equal Opportunity Employer M/F/Disability/Veteran."}, {"title": "Intern (Engineering-Construction)", "company": "Port of San Diego", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=d9343fd7effcd70d&from=vj&pos=top", "description": "$14.45 - $22.41 an hourPart-time, InternshipDesired: Driver's LicenseMicrosoft OfficeDescription\n\nThis Intern position will support the business administration efforts in the Engineering-Construction Department and report directly to the Department Administrative Manager. The Engineering-Construction (E-C) Department is a fast paced office environment with multiple and rapidly changing priorities.\n\nDuties will include but are not limited to the following: updating and developing written procedures and training, monthly, quarterly, and annual analytical report development, assist with contract administration and compliance, department invoice processing, monitoring assigned tasks, budget assistance preparation, meeting coordination and scheduling and agenda preparation. Substantial knowledge of Outlook and MS Office preferred.\n\nGENERAL PURPOSE\nWith general supervision, provides part-time employment opportunities for college level interns to perform job assignments that are closely related to their area of study. Any full-time college or graduate level student may apply for consideration for vacancies.\n\nDISTINGUISHING CHARACTERISTICS\nTotal scheduled work hours shall not exceed 25 hours per work week (Monday through Friday). Intern positions do not include benefits and are not eligible to receive paid leave, paid holidays, retirement and/or any type of insurance.\nEssential Duties and Responsibilities\n\nDuties and responsibilities assigned to Interns will vary depending on the department they are assigned.\nQualifications\n\nMINIMUM REQUIREMENTS\n\nEducation, Training and Experience:\nIntern I: College level students currently enrolled in at least twelve (12) semester units at an accredited college or university, majoring in a field of study closely related to current vacancies, may qualify for Intern I appointments. Students in their final semester/quarter who need less than full-time enrollment to graduate with a 2 or 4-year degree need only be enrolled part-time in courses required for degree completion, with verification from the college or university registrar.\n\nIntern II: Students in a graduate program leading to an advanced or doctoral degree enrolled in an accredited college or university, majoring in a filed of study closely related to current vacancies, may qualify for Intern II appointment with verification from the college or university registrar. Full-time student status is not required for students in a graduate program.\n\nLicenses; Certificates; Special Requirements:\n\nA current, valid California Class C driver's license at time of appointment and maintained at all times thereafter in order to operate a vehicle on District business.\nIf assigned to perform work at any of the District's maritime facilities you must be able to pass a background check in accordance with current Federal and State requirements.\n\nIf assigned to perform work at any of the District's Harbor Police facilities you must be able to pass a background investigation that includes, but is not limited to a polygraph examination.\n\nHow to Apply:\n\nApplications will only be accepted online. We do not accept hard copy applications.\n\nNOTE: A COLLEGE UNITS VERIFICATION FORM OR TRANSCRIPT MUST BE SCANNED AND UPLOADED TO THE ATTACHMENT SECTION OF YOUR APPLICATION.\n\nAPPLICATIONS WITHOUT UNITS VERIFICATION FORM OR TRANSCRIPT WILL BE DISQUALIFIED.\n\nSupplemental Information\n\nPHYSICAL AND MENTAL DEMANDS\nPersons with disabilities may be able to perform the essential duties of this class with reasonable accommodation. Reasonable accommodation will be evaluated on an individual basis and depends, in part, on the specific requirements for the job, the limitations related to disability and the ability of the hiring department to accommodate the limitation.\nResolution #:2014-130\nDated: June 10, 2014"}, {"title": "Construction Maintenance Worker I", "company": "City of Poway, CA", "location": "City of Poway, CA", "job url": "https://www.indeed.com/rc/clk?jk=bab0cea80a169261&from=vj&pos=top", "description": "$19.17 - $23.30 an hourTemporaryThe City of Poway is gearing up for its annual Asphalt Maintenance Program. We are looking to hire full-time (up to 999 hours per fiscal year), seasonal Construction Maintenance Workers to help us complete our program. The Asphalt Maintenance Program runs February 1 through approximately June 30. The Seasonal Construction Maintenance Workers are active in the construction and repair of Poway's pristine streets and roadways and have the opportunity to operate a variety of equipment. Apply to join a team of highly talented and qualified people who strive to provide optimum services to the Poway community!\nPerforms a variety of work in the construction, modification, maintenance, and repair of City infrastructure, including streets, sidewalks, curbs and gutters, roadway base and sub-base, guard rails, asphalt pavement, crack seal application, pavement markings, concrete repair, traffic and street sign installation, repair, and reflectivity; uses and operates a variety of hand and power tools and light to medium power driven equipment.\n\nReceives direct or general supervision from the Construction Maintenance Supervisor or assigned supervisor. Exercises no direct supervision over staff. May provide technical and functional direction to lower-level staff.\n Key Responsibilities:\nManagement reserves the right to add, modify, change or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job.\nPerforms construction, maintenance, and repair activities of City streets and roadways to ensure safe and efficient access for the public, including alleys, sidewalks, curbs and gutters, roadway base and sub-base, guard rails, asphalt pavement, crack seal application, concrete repair, traffic and street sign installation, repair, and reflectivity, and pavement markings.\nProvides installation, maintenance, and repair of traffic signs, including making signs, and installing sign posts and signs in accordance with Federal, State, and City codes.\nParticipates in the asphalt program, including demolition and preparation of areas to be resurfaced; applying, raking, compacting, and paving appropriate materials to the surface, and cleaning up area.\nParticipates in the crack seal program, including cleaning and preparing surfaces with the appropriate equipment and applying crack sealing material and applicable chemicals to the surface.\nParticipates in the concrete program, including attending to trip hazards, demolishing and removing concrete, and forming, pouring, and finishing sidewalks, handicapped ramps, curbs, and gutters.\nParticipates in the sign retro-reflectivity program, including updating all City traffic signs in compliance with the Federal Highway Administration's Manual on Uniform Traffic Control Devices.\nInspects City premises for graffiti vandalism, uses appropriate chemicals and high-pressure equipment to remove graffiti.\nPerforms tree trimming and removal services, including pruning branches, grinding tree stumps to ground level, and removing trees safely and efficiently.\nPerforms legend painting and striping of City streets and parking lots using appropriate materials.\nPerforms related duties as assigned.\nParticipates in the City-wide inspection program, including inspecting assigned City infrastructure for safety issues, structural integrity, and possible future work projects and programs, and appropriately marking areas that need to be repaired.\nOperates and maintains specialized vehicles and a variety of light and medium equipment related to the construction, maintenance, and repair of construction systems and facilities.\nOperates a variety of hand and power tools and equipment related to work assignment as instructed.\nObserves safe work methods and makes appropriate use of related safety equipment as required.\nMaintains public facilities, shop and garage areas, storage sites, and other work areas in a clean and orderly condition, including securing equipment at the close of the workday.\nInstalls street barricades and cones and controls traffic around work sites and special events to ensure safe conditions for the general public and City workers.\nProvides needed information and demonstrations concerning how to perform certain work tasks to new employees in the same or similar class of positions.\nMaintains accurate logs and records of work performed and materials and equipment used.\nMaintains attendance and punctuality that is observant of scheduled hours on a regular basis.\nResponds to after-hours emergencies, as requested.\n Minimum Requirements/License or Certificates Required:\nExperience:\nSix months of recent experience in streets and roadways construction, maintenance, and/or repair of related facilities, systems, and appurtenances.\nEducation/Training:\nEquivalent to the completion of the 12th grade.\nLicenses and Certifications:\n\nClass C California driver's license, required.\nClass B California driver's license, desirable.\nTraffic Control Certificate, desirable.\nFork Lift Certificate, desirable.\n\nPhysical Demands\nMust possess mobility to work in the field; strength, stamina, and mobility to perform medium to heavy physical work, to work in confined spaces and around machines, to climb and descend ladders, to operate varied hand and power tools and construction equipment, and to operate a motor vehicle and visit various City sites; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone or radio. The job involves fieldwork requiring frequent walking in operational areas to identify problems or hazards. Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard or calculator and to operate above-mentioned tools and equipment. Positions in this classification bend, stoop, kneel, reach, and climb to perform work and inspect work sites. Employees must possess the ability to lift, carry, push and pull materials and objects weighing up to 100 pounds, or heavier weights with assistance or with the use of proper equipment.\n\nEnvironmental Elements\nEmployees work in the field and are exposed to loud noise levels, cold and hot temperatures, inclement weather conditions, road hazards, vibration, confining workspace, chemicals, mechanical and/or electrical hazards, and hazardous physical substances and fumes. Employees may interact with upset staff and/or public and private representatives and contractors in interpreting and enforcing departmental policies and procedures.\n\nWorking Conditions\nMay be required to be on-call and to work various shifts or emergencies on evenings, weekends, and holidays. In case of a City-wide emergency or natural disaster, employees in this class are required to serve as an Emergency Responder.\n Examination Process:\nA completed NeoGov application, including supplemental questions, must be submitted through NeoGov for consideration by the application deadline. Application materials will not be accepted separate from NeoGov or after the deadline.\nA FULLY COMPLETED APPLICATION AND RESPONSES TO SUPPLEMENTAL QUESTIONS ARE REQUIRED AND PART OF THE REVIEW AND QUALIFYING PROCESS. QUESTIONS MUST BE ANSWERED COMPLETELY; REFERENCING YOUR RESUME OR PREVIOUS SECTIONS OF THE APPLICATION IN LIEU OF ANSWERING A QUESTION WILL BE CAUSE FOR DISQUALIFICATION.\nApplicants will be evaluated on the basis of relevant training and experience. The process may include interviews and/or performance tests. Successful candidates will be placed on the eligibility list established, which will be in effect for a period of up to six months. A background investigation including LIVESCAN fingerprinting and a verification of a valid driver's license and satisfactory driving record from the Department of Motor Vehicles are required. All appointments are also subject to the successful completion of a pre-placement physical examination that includes a drug screening. Applicants will be required to submit verification of the legal right to work in the United States. The City of Poway participates in E-Verify. All employees are required by law to sign a loyalty oath to the United States and the State of California Constitution at time of hire."}, {"title": "Barista", "company": "THE LOT", "location": "La Jolla, CA 92037", "job url": "https://www.indeed.com/rc/clk?jk=4d5c4de03d8483a1&from=vj&pos=top", "description": "THE LOT is a revolutionary Entertainment, Experience, Lifestyle Venue that merges premium entertainment with our unique California communities to create an experience that is unsurpassed. A premium cinema and dining destination that is a social hub for elevated cuisine, craft coffee, special events, sophisticated cocktails as well as a comfortable co-work space, THE LOT truly creates the ultimate guest experience. THE LOT opened in Southern California - La Jolla in September of 2015, Liberty Station in May of 2016, and Newport Beach in April of 2018. THE LOT San Ramon is currently under construction, due to open in November with training to begin in October.\n\nAs a Barista at THE LOT, you will work in our Caf preparing and selling craft coffee drinks. Moving away from the traditional movie-going experience, our Team Members design the ultimate guest experience. Baristas offer locally roasted craft coffee and artisan pastries baked daily. Baristas will be educated on preparing and selling craft coffee drinks, following company recipes and preparation techniques. Gourmet pours by people who know your name.\n\nRequirements\nPrevious work experience as a Barista strongly preferred\nPrevious work experience in customer service and cash-handling skills required\nPositive and Professional Attitude with a great high-energy Guest Focus\nStrong attention to detail\nProvides personal insight about products, entertainment and services provided at THE LOT\nAnticipates the guests' needs and responds appropriately with a sense of urgency\nWelcomes all guests by determining their coffee interests and needs\nEducates guests by presenting and explaining the coffee drink menu; answering questions\nSells cafe menu items by explaining differences in coffee beans and coffee preparation machines; demonstrating how brewing equipment operates\nPrepares and sells coffee drinks by following prescribed recipes and preparation techniques for coffee drinks\nWorks as a team, assisting with all Guest and Team Member needs\nMust be 18 years of age or older\nWe are an Equal Opportunity Employer\nOpen Weekend and Holiday Availability. Must be available to work at least 3 shifts per week.\nPrevious work experience as a Barista strongly preferred\nAbility to lift to 50 lbs\nAbility to smile while standing 8 hours a day"}, {"title": "CONSTRUCTION LABORER-Tribal Construction", "company": "Sycuan Casino", "location": "El Cajon, CA 92019", "job url": "https://www.indeed.com/rc/clk?jk=ec345a5fee9a9f91&from=vj&pos=top", "description": "The ancestors of the Sycuan Band of the Kumeyaay Nation existed many centuries ago as a community of peoplea Tribe living together, farming, hunting and fishing to survive.\n\nMuch has changed since that time. Today the Sycuan Tribe governs its Reservation, owns and operates a Casino and a Golf Resort, and owns a number of other business ventures in the San Diego Region.\n\nOne attribute that remains unchanged, however, is Sycuan's sense of community. Sycuan is more than just a business. Sycuan is a community of people working together toward a common goal. Whether you work in our state-of-the-art Casino, our beautiful Resort, or become a staff member in our Tribal Government division, you will be part of the Sycuan family.\nJob Purpose:\nPerforms general repairs, installations, and adjustments to tribal buildings\n\nJob Duties and Responsibilities:\n(Note: Duties and responsibilities may be added, deleted, or changed at the sole discretion of Sycuan Management at any time)\nKeeps tribal facilities operational by responding to minor repair requests, performing carpentry, carpeting, tiling, plumbing, and plumbing repairs, basic installations, adjusting and performing preventive maintenance, maintaining the shop log, and informing Tribal Construction Supervisor of major repair needs following established procedures. - 70%\nMaintains safe work and storage areas by observing all applicable local, state and federal safety guidelines and codes while using tools, performing equipment repairs, organizing parts inventory, and storing tools and equipment. - 20%\nAssists Tribal Construction Supervisor by performing set up and clean up tasks at the job site, digging pits, trenches, and foundations, and performing other duties as assigned. - 10%\n\nJob Specifications:\nEducation and Experience:\nEssential:\n2 years of vocational general maintenance training or related experience\nCA Driver's License in good standing\nDesirable:\nBuilding construction and maintenance experience\nBasic plumbing experience\nSkills and Knowledge:\nEssential:\nAbility to diagnose and repair equipment and utilities\nAbility to use tools of the appropriate trade\nAbility to work from ladders, scaffolds and lifts\nAbility to reach, crouch, bend and kneel\nAbility to understand and follow verbal directives and written directions\nAbility to lift up to 80 lbs\nAbility to operate power tools\nAbility to perform simple mathematical calculations and measurements\nAbility to accept constructive criticism\nAbility to interact effectively with team members and guests\nAbility to maintain professionalism and composure\nAbility to work in a smoking environment\nAbility to appear for work on time and in proper attire\nDesirable:\nMulti-lingual\nSupervisory/Managerial Accountability:\nDirect: None\nIndirect: None\nIf you enjoy being part of a community dedicated to creating a memorable guest experience, we invite you to explore career opportunities with Sycuan and join our winning team!\nOther details\nPay Type Hourly"}, {"title": "Laborer", "company": "City of San Diego", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=7ae9dbc5ad40bacd&from=vj&pos=top", "description": "$14.49 - $17.26 an hourDesired: Landscape MaintenanceConstruction ExperienceDriver's LicenseCDL APesticide Applicators LicenseLaborer positions perform manual construction and maintenance work as a member of a crew by lifting, loading, moving, digging and scraping; operate a jackhammer to break pavement for the repair and maintenance of streets and water utilities services; dig water and sewer pipelines and mains; and perform other duties as assigned.\n\n NOTES:\nLaborer employees may be required to lift and carry items weighing up to 100 pounds.\nAfter gaining the requisite experience, Laborer employees may be eligible for career advancement to higher level classifications.\nFor positions in the Public Utilities Department, Water System Operations and Water Construction & Maintenance Divisions, Laborer employees are required to meet the following requirements to career advance to Water Systems Technician I: 1) Possess a California Class A or B Driver License within six months from date of hire and 2) Obtain a Grade D2 or higher Water Distribution Operator Certification issued from the State of California within three years from date of hire. A high school diploma, General Education Development (GED) examination or California High School Proficiency Examination (CHSPE) is required to obtain Distribution Operator Certification. Failure to meet the requirements may result in termination.\nFor positions in the Public Utilities Department, Wastewater Collection Division, Laborer employees are required to meet the following requirement to career advance to Utility Worker I: Possess a California Class A or B Driver License within six months from date of hire. Failure to meet this requirement may result in termination.\nSome positions may require a Confined Space Certificate within six months from date of hire. Employees in this position will be required to maintain the certification as a condition of employment.\n MINIMUM REQUIREMENTS:\nYou must meet the following requirements on the date you apply, unless otherwise indicated.\n\nAGE: 18 years of age or older; except for high school graduates (or persons with GED equivalency) who are 17.\n\nCITIZENSHIP: You must be a United States citizen or have the current legal right to work in the United States.\n\nLICENSE: A valid California Class C Driver License is required at the time of hire.\n\n NOTES:\nSome positions may require a California Class B Driver License at the time of interview or at the time of hire.\nSome positions may require a California Class A or B Driver License within six months from the date of hire.\n\nHIGHLY DESIRABLE:\nLandscaping/landscape maintenance experience including brush cutting/thinning, weeding, planting, digging, use of chainsaws and other hand-held power equipment, and experience in working in rugged terrain with steep slopes.\nExperience/knowledge in working with native plant vegetation.\nPossession of a Water Distribution Operator Certificate issued from the State of California.\nConstruction experience.\nPossession of a valid Qualified Applicator Certificate issued from the State of California Department of Pesticide Regulation.\n SCREENING PROCESS:\nPlease ensure all information is complete and accurate as the responses you provide on the supplemental questions will be reviewed using an automated evaluation system. If you are successful in this initial screening process, your application will be reviewed for applicable education, experience, and/or training to ensure all minimum requirements have been met. Successful candidates will be placed on a list which will be used to fill position vacancies during the next six months (180 days). For each vacancy, only those candidates with the most appropriate qualifications will be contacted by the hiring department for an interview.\n SUPPLEMENTAL INFORMATION:\nPRE-EMPLOYMENT REQUIREMENTS: Employment offers are conditional pending the results of all screening processes that are applicable to this job, which may include but are not limited to the following: Confirmation of citizenship/legal right to work in the United States; completion of a pre-employment medical review/exam (which may include drug/alcohol testing); reference checks; and a fingerprint check. The fingerprints will be submitted to the Federal Bureau of Investigation and the California Department of Justice for a conviction record report. Certain positions may require additional screening processes which may include a polygraph examination and/or background investigation. All of these processes must be successfully completed before employment begins. A positive test for alcohol, illegal drugs, including marijuana, or inadequately explained prescription drugs, misrepresentation, falsification, or omission of pertinent facts in any step of the screening/selection process may be cause for disqualification and/or termination of employment. Nothing in this job posting constitutes an expressed or implied contract for employment with the City of San Diego. Applicants must notify the Personnel Department of any changes in their name, address (home, email), or phone number or they may miss employment opportunities.\n\nRev. 1 - November 16, 2018 (New Recruitment Date)"}, {"title": "Civil Construction Laborer", "company": "SpawGlass", "location": "Houston, TX 77041", "job url": "https://www.indeed.com/rc/clk?jk=9b307905dd990546&from=vj&pos=top", "description": "Position Summary:\n\nThe Laborer will assist the project with various assignments as necessary. Often will work on a variety of tasks within a given day.\nReporting:\n\nLaborer will report to general foreman and/or superintendent.\nRequirements:\n\nGood attitude\nWillingness to get the job done\nAbility to use a hammer, wheelbarrow, chipping gun (air or electric), broom, wrecking bar, sledge hammer (10#), compacting equipment, concrete vibrator, shovel, rake, concrete moving hand tools, pumps, hoses, power tools, air tools, t-post driver, pick axe, chainsaw, or power washer.\nFamiliar working alongside and within the vicinity of motorized equipment. Ability to communicate with operators, workers, and pedestrians.\nAbility to direct and flag traffic.\nAble to work on a ladder, platform, or scaffold.\nAble to follow verbal and/or written direction.\nAble to complete tasks without constant supervision.\nAble to work at heights six feet and greater when provided safety equipment and training.\nFamiliar with the operation of small engines.\nResponsibilities\nGeneral Labor and daily housekeeping\nInstall and remove temporary protection\nSupport carpenters in daily activities\nWreck concrete forms\nAssist Carpenters in scaffolding\nLoading and Unloading of materials\nClean occupied and soon to be occupied spaces\nMowing and light landscaping\nMoving materials\nSupport concrete finishers in daily activities.\nMust be able to work in a safe and effective manner while helping accomplish project tasks as directed by verbal or written communication without constant supervision.\nWork Environment:\n\nYou may be exposed to noise, dampness, heat, cold, dust, fumes (occasionally, but always well-ventilated), chemicals (will work with, but normally won't work in a chemical environment) and confined spaces (on occasion).\n50% of day is spent standing, 50% of work is inside (usually not air conditioned), 50%\nof work is outside.\nTemperatures range from 25 to 1150F.\nEssential Job Functions:\n\nYou must be able to twist, stoop, bend, squat, kneel, crawl, climb ladders, climb stairs, walk on uneven ground, work above ground on scaffolds, see colors to read GHS labeling on containers, have depth perception to avoid excavations and other hazards, hear well enough to recognize the sound of horns on moving equipment and have good finger manipulation.\nThere is constant lifting of 10 pounds and under and occasional lifting of 60 pounds. Lifting also entails reaching at, above and below shoulder height.\nSpecial Clothing:\n\nYou will be required to wear puncture resistant footwear, long pants and four- inch sleeves on shirts. PPE (hard hat, safety glasses, etc.) is required. All safety appliances (hard hat, safety glasses, gloves, high visibility vest, ear plugs, fall protection, respiratory equipment, etc.) will be provided.\nSpawGlass is an EEO Employer"}, {"title": "General Construction Worker", "company": "Toohey Construction", "location": "Quad Cities", "job url": "Not Available", "description": "This job opening is for the Construction Worker position at Toohey Construction in Quad Cities.Job Type: Full-time"}, {"title": "Construction Recruiter", "company": "Inspection Consulting", "location": "San Diego, CA", "job url": "Not Available", "description": "$15 - $20 an hourWe are a construction inspection company looking to hire a recruiter.The position would entail recruiting for upcoming construction projects, complete clerical and organizational tasks for office, document and report processing, etc.Requirements:Extreme proficiency in MS Office (MS Excel, in particular)Extreme proficiency in Adobe AcrobatStrong computer skills- in general (a must)Time management skills and the ability to prioritize workAttention to detail and problem solving skillsExcellent written and verbal communication skills is mandatoryStrong organizational skills with the ability to multi-task*Previous experience in the recruiting industry preferably in construction industry a plusJob Type: Full-timeSalary: $15.00 to $20.00 /hourEducation:High school or equivalent (Preferred)Location:San Diego, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "Brewpub Project Assistant", "company": "Karl Strauss Brewing Company", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=62946ead11383431&from=vj&pos=top", "description": "Position Summary\nTo support the brewpub division on construction, capital,\nfacility management projects and supports the operations team.\nEssential\nFunctions & Duties\nConstruction &\n\nCapital Projects:\nAssists in preparation and submits necessary\nlicense/permits.\nReviews proposals with Brewpub Project Manager\nand performs cost comparisons.\nAssists in accounting and coding of invoicing\nfor capital expenses and construction projects.\nTracks payments and communicates summary of\ntransactions to team.\nAdministrative support in project close out\ndocuments.\nOrganization of documentation related to budget,\nscheduling, and other aspects of construction and capital projects.\nAttends project meetings and takes notes and\ndistributes meeting minutes to attendees.\nGeneral administrative support to projects\nOrganize and maintain project files and\ndatabases\nAssists in vendor follow up on scheduling and\ncompletion.\n\nFacilities Support:\nCompiles and creates facility management\nreporting as needed.\nOrganizes fixed asset tracking sheets.\nAdministrative support for location specific\nfacility information.\nAssists in preparation of facility audit\nchecklists, surveys and spec books.\nAssists in vendor follow up on scheduling and\ncompletion.\n\nDepartment Administration:\nDepartment\n\nAdministration:\nProcesses internal brewpub orders\nProcesses monthly multi-unit invoices.\nCompiles Brewpub Division reporting as needed.\nOrganizes and maintain department files and\ndatabases\n\nNecessary Knowledge,\n\nSkills, and Abilities:\nMust be proficient with Microsoft Office\napplications including Outlook, Word, Project and Power Point\nStrong Excel skills required\nStrong written and verbal communication skills\nStrong interpersonal skills"}, {"title": "Construction Asst. Superentendant", "company": "Commercial Construction Solutions", "location": "Orange, CA 92865", "job url": "Not Available", "description": "$24 - $28 an hourAssist project manager in running small & mid size commercial tenant improvement projects in the OC & LA county areas.Meet city inspectors, schedule sub contractors & perform some trades.Must have dependable transportation & a minimum of 5 years commercial TI experience.Job Type: Full-timeSalary: $24.00 to $28.00 /hourExperience:construction: 5 years (Required)Education:High school or equivalent (Required)Shifts:Morning (Preferred)"}, {"title": "Construction Laborer", "company": "HiTech Environmental", "location": "Lawndale, CA", "job url": "Not Available", "description": "$15 - $17 an hourPart-timeSeeking Experienced Construction Laborers, who will be performing assistance at residential and commercial properties. Laborers would be responsible for assisting with loading and unloading job materials, prepping the areas, assisting with work as needed following instructions from Supervisor; operate and care for company equipment and machines, perform site clean-up. Company vehicle will be driven to each job site location. There will be training in the field performing the remediation jobs by our Senior Supervisor.Desired Qualifications: -Must have great attitude/team player, be punctual/reliable, and hard working individual.-Knowledge of basic engineering and construction principles/methods.-Must have great customer service and communication skills.-Must be able to access and work in small areas including crawlspaces and attics.-Must have a professional appearance.-Must have a valid drivers license (bring print out).-Must speak English fluently, bilingual a plus!-Ability to read instructions and blueprints when needed.-Must be able to perform physical labor and other strenuous physical tasks.-Keep a clean and neat jobsite at all times leaving a first class impression of our work to our clients.Certification for Asbestos, Lead or Mold remediation is a HUGE PLUS!!!Job Type: Part-timeSalary: $15.00 to $17.00 /hourExperience:Construction: 2 years (Preferred)"}, {"title": "Cashier", "company": "Builders FirstSource", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=0eab382381a81c74&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Installer I", "company": "Tesla", "location": "Vista, CA", "job url": "https://www.indeed.com/rc/clk?jk=76fb21f37a3703df&from=vj&pos=top", "description": "THE ROLE\n\nThe Installer I will be part of Teslas Energy Field Operations team. As an integral member of the team, the ideal candidate will work cooperatively with other team members to successfully complete the installation of residential PV solar systems, battery storage and EV wall connectors safely and on time. It is the responsibility of every Installer to ensure safe work practices for Teslas installation team. New hire training and continued training will be provided.\n\nRESPONSIBILITIES\n\nLayout, assembly and installation of solar array and mounting hardware\nAssist with the electrical wiring of all energy products\nPrepare and clean-up job site\nWork with the warehouse team to pull materials for each installation job\nAttend weekly team meetings and mandatory training sessions on new products, installation methodology and safety\nProvide an exceptional customer experience to all customers throughout the process\nAdditional duties required as needed\n\nREQUIREMENTS\n\nRoof work, general construction, or carpentry experience preferred\n Ability to safely handle tools and materials such as: ladders, inverters, solar panels, panel boards, batteries, and other similar electrical equipment, lumber, roofing materials, etc.\nAbility to work in extreme environments (example: hot sun, cold, crawl spaces, etc.)\n Capable of working at heights including on rooftops, climbing ladders and stairs; and performing repetitious duties, including lifting, bending and standing for long periods of time\nExperience using basic hand and power tools\nBasic computer skills preferred\nMust have excellent written and verbal communication skills\nMust have excellent customer service skills\nExcellent attendance is crucial for the team to achieve success\nAbility to work well with others in a collaborative team environment\n\n\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Construction Laborer", "company": "PCC corp", "location": "New York, NY 10004", "job url": "Not Available", "description": "TemporaryDesired: Construction ExperienceMust known how to installs laminate wood tiles, painting, countertop installation and cutting, cabinet installation and basic handyman knowledge.Job Type: TemporaryExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "TMF construction LLC", "location": "Bozeman, MT", "job url": "Not Available", "description": "$50,000 a yearContractRC channel and fire tape Monday through Friday eight hours a day $25-$35 an hour Me and my recent partner need to split up into two crews to get double the work load done looking for a hard-working Individuals who want to make a lot of money it is a contract job you will be paid for what you put inJob Type: Full-timeSalary: $50,000.00 /yearExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Laborer", "company": "Method Construction, Inc.", "location": "San Jose, CA", "job url": "Not Available", "description": "$14 - $20 an hourDesired: Construction ExperienceLocal long established General Contracting Company looking for laborers for South Bay Area projects. Start Immediately. Full-time.Laborer:-Must have reliable transportation to get to work.-Pay rate: Based on experience with opportunity for advancement.-Benefits.Reply by phone (408-842-0054), email or fax (408-842-0906) resumes: must include work history, business references and pay requirement with return contact information.Principals only. Recruiters, please don't contact this job posterJob Type: Full-timeSalary: $14.00 to $20.00 /hourExperience:construction: 1 year (Preferred)License:Drivers (Preferred)"}, {"title": "Construction Worker/Laborer", "company": "Rios &amp; Company", "location": "Sunnyvale, CA", "job url": "Not Available", "description": "$17 - $18 an hourDesired: Clean Driving RecordConstruction ExperienceBilingualDriver's LicenseRios & Company is looking for an experienced and knowledgeable Construction Worker/Laborer with knowledge in multiple aspects of the construction fields such as Plumbing, Roofing, Electrical, Framing and more. This is a ful time position starting at $17.00 - $18.00 an hour with an opportunity to negotiate pay based on experience. This job will require traveling around the Bay Area to contracted work sites.We are seeking enthusiastic individuals who are:ReliablePunctualExcellent written and verbal communication skills requiredSelf Starter and able to work aloneMust be able to read plansMust be able to work as a teamBilingual a plusRequirements:Must have a clean driving record/valid drivers licenseMust have a minimum 2 years experience in constructionJob Type: Full-timeSalary: $17.00 to $18.00 /hourExperience:Construction: 2 years (Required)License:Driver's License (Required)Required travel:100% (Required)"}, {"title": "Construction Estimation and Sales", "company": "Berkley Construction Inc.", "location": "San Diego, CA 92102", "job url": "Not Available", "description": "$50,000 - $75,000 a year-Visit potential clients in the field, develop projects, estimate, and sell.-Residential and commercial projects, large and small.-Candidate must have practical estimating and sales experience.-Salary + performance bonus.-Must be self motivator, friendly, and well organized.Job Type: Full-timeSalary: $50,000.00 to $75,000.00 /yearExperience:Construction Estimating: 1 year (Preferred)Estimating: 1 year (Preferred)Education:High school or equivalent (Required)Location:San Diego, CA 92102 (Required)Work authorization:United States (Required)"}, {"title": "road construction laborer", "company": "kauai seal coating inc.", "location": "Kapaa, HI", "job url": "Not Available", "description": "$15 - $25 an hourPart-timeDesired: Construction ExperienceDriver's LicenseNeed workers for asphalt and sealcoating labor. The more skills, the more money. Part time can turn into full time with benefits. Self starter, on time and ready to work. Must be willing to learn new skills. Being able to tow trailer and equipment a plus. Must be able to work in hot sun and lift 50lbs. You will need a valid drivers license, legal vehicle and must be able to pass a background check, if hired, as we work for state and federal jobs. Pay may vary as we do work for Davis Bacon Wages. We work mostly during the week and have some work on weekends. We work all over Kauai and not just in one area. Must be on the island of Kauai, as you may need to start the next day.Job Type: Part-timeSalary: $15.00 to $25.00 /hourExperience:construction: 1 year (Required)Education:High school or equivalent (Required)Location:Kaua'i, HI (Required)License:drivers (Required)Language:english (Required)"}, {"title": "Construction Worker", "company": "Rancho Energy", "location": "Escondido, CA", "job url": "Not Available", "description": "$14 - $15 an hourDesired: Clean Driving RecordBilingualDO YOU HAVE POWER TOOLS AND KNOW HOW TO USE THEM? WE ARE LOOKING FOR YOU!!!LOOKING FOR A HANDY MAN!MUST PROVIDE A PHONE NUMBER WE NEED TO BE ABLE TO REACH YOU TO SETUP INTERVIEW TIMES.CLEAN DRIVING RECORD BECAUSE YOU WILL BE DRIVING OUR TRUCKSYOU WILL NEED YOUR BASIC HANDY MAN TOOLS (DRILL, HAMMER, TAPE MEASURE...)BILINGUAL IS A PLUS AS MOST OF OUR CUSTOMERS SPEAK SPANISHPLEASE DON'T BOTHER APPLYING IF YOU'RE LOOKING FOR A POSITION THAT PAYS MORE THAN $16. PER HR.THIS IS A GOOD JOB THAT OFFERS PLENTY OF OVERTIME FOR THOSE THAT DON'T MIND WORKING ON THE WEEKENDS.WE INSTALL THE FOLLOWING ON THE DAILY:-DOORS (SOLID SLAB) MUST BE ABLE TO LIFT UP TO 85-95LBS-SHOWER HEADS (HAND HELD AND STANDARD) AND AERATORS- DOOR REPAIR SUCH AS THRESHOLDS, DOOR SHOES, STRIKER PLATES AND MORE-WEATHER STRIPPING-GLASS-INSULATION ON SELECT DAYS-LIGHT FIXTURES, LIGHT BULBS, STAND UP LAMPS AND PORCH LIGHTS-SMOKE DETECTORS AND CO DETECTORS-MICROWAVESSO AS YOU CAN SEE THIS IS NOT A ROCKET SCIENCE TYPE OF JOB SO THE PAY IS $14-$15 TO START WITH ROOM TO GROW UP TO $16-$20.IF YOU'RE LOOKING AT GETTING INTO THE CONSTRUCTION FIELD THIS IS THE PERFECT STARTING OFF POINT FOR YOU. YOU MUST HAVE TOOLS BUT WE WILL TRAIN YOU!!!Job Type: Full-timeSalary: $14.00 to $15.00 /hourLanguage:SPANISH AND ENGLISH (Preferred)"}, {"title": "Stormwater Maintenance &amp; Construction Wo...", "company": "City of Poway, CA", "location": "City of Poway, CA", "job url": "https://www.indeed.com/rc/clk?jk=4d67ade4c341aa4e&from=vj&pos=top", "description": "$19.17 - $23.30 an hourDesired: Construction ExperienceMaintenanceDriver's LicenseCDL AThe Stormwater Maintenance & Construction Worker I is active in the construction, maintenance and repair of City stormwater and drainage systems, including 9 miles of concrete channels, 20 miles of brow ditches, 10 static and 4 mechanical detention basins, 64 miles of storm pipe, 105 miles of open channels, and 1,400 drop inlets. If you want to join a team of highly talented and qualified people who work hard to provide optimum services to the Poway community, you are encouraged to apply.\nPerforms a variety of work in the construction, modification, maintenance, and repair of City stormwater and drainage systems and facilities; uses and operates a variety of manual and power tools and light to heavy power driven equipment; receives direct or general supervision from the Construction Maintenance Supervisor or assigned supervisor; exercises no direct supervision over staff; may provide technical and functional direction to lower-level staff.\n\n Key Responsibilities:\nManagement reserves the right to add, modify, change or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job.\n\nPerforms construction, maintenance, and repair activities of City construction systems and facilities to ensure safe and efficient access for the public, including concrete and open channels, creeks, pipes, drains, detention basins, and drop inlets.\nPerforms a variety of duties in the maintenance of drainage structures to ensure efficient drainage, including inspecting, repairing, and replacing patrol tide areas, and opening and closing tide valves along assigned routes.\nPerforms concrete and open channel maintenance, including inspecting and repairing stormwater conveyance systems to ensure water quality, removing/abating weeds and other invasive vegetation, removing coefficients, sediments, debris, and trash from channels, applying site delineation, best management practices, and erosion control before, during, and after maintenance activities, and keeping in compliance with applicable Federal, State, and local water regulatory laws and regulations.\nInspects, maintains, and repairs box coverts under roads and bridges.\nInspects, maintains, and repairs dynamic and static stormwater detention basins; monitors water quality for pollution, contamination, and turbidity reduction in the event of rain, in compliance with the Environmental Protection Agency's Standard Urban Storm Water Mitigation Plan (SUSMP).\nInspects, maintains, and repairs all City drop inlets, storm drains, stormwater pipes, and brow ditches; repairs damage and cleans out dirty or clogged facilities, in compliance with the City's Jurisdictional Urban Runoff Management Program (JURMP) for compliance with the City's stormwater permit.\nPerforms related duties as assigned.\nParticipates in the City-wide inspection program, including inspecting assigned City infrastructure for safety issues, structural integrity, and possible future work projects and programs, and appropriately marking areas that need to be repaired.\nOperates and maintains specialized vehicles and a variety of light, medium, and heavy equipment related to the construction, maintenance, and repair of construction systems and facilities.\nOperates a variety of hand and power tools and equipment related to work assignment as instructed.\nObserves safe work methods and makes appropriate use of related safety equipment as required.\nMaintains public facilities, shop and garage areas, storage sites, and other work areas in a clean and orderly condition, including securing equipment at the close of the workday.\nInstalls street barricades and cones and controls traffic around work sites and special events to ensure safe conditions for the general public and City workers.\nProvides needed information and demonstrations concerning how to perform certain work tasks to new employees in the same or similar class of positions.\nMaintains accurate logs and records of work performed and materials and equipment used.\nMaintains attendance and punctuality that is observant of scheduled hours on a regular basis.\nResponds to after-hours emergencies.\n Minimum Requirements/License or Certificates Required:\nExperience:\nOne year of recent experience in construction maintenance and/or repair of stormwater and drainage, or related facilities, systems, and appurtenances.\n\nEducation/Training:\nEquivalent to the completion of the 12th grade.\n\nLicenses and Certifications:\n\nA valid class C driver's license.\nAbility to obtain and maintain a class A driver's license.\nAbility to obtain and maintain a Traffic Control Certificate.\nAbility to obtain and maintain a Fork Lift Certificate.\nAbility to pass SCBA Fitness Testing and the certification process.\nAbility to obtain and maintain a Confined Space Certificate.\nAbility to obtain and maintain a Trench Shoring Certificate.\n\nPHYSICAL DEMANDS\nMust possess mobility to work in the field; strength, stamina, and mobility to perform medium to heavy physical work, to work in confined spaces and around machines, to climb and descend ladders, to operate varied hand and power tools and construction equipment, and to operate a motor vehicle and visit various City sites; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone or radio. The job involves fieldwork requiring frequent walking in operational areas to identify problems or hazards. Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard or calculator and to operate above-mentioned tools and equipment. Positions in this classification bend, stoop, kneel, reach, and climb to perform work and inspect work sites. Employees must possess the ability to lift, carry, push and pull materials and objects weighing up to 100 pounds, or heavier weights with assistance or with the use of proper equipment.\n\nEnvironmental Elements\nEmployees work in the field and are exposed to loud noise levels, cold and hot temperatures, inclement weather conditions, road hazards, vibration, confining workspace, chemicals, mechanical and/or electrical hazards, and hazardous physical substances and fumes. Employees may interact with upset staff and/or public and private representatives and contractors in interpreting and enforcing departmental policies and procedures.\n\nWORKING CONDITIONS\nMay be required to be on-call and to work various shifts or emergencies on evenings, weekends, and holidays. In case of a City wide emergency or natural disaster, employees in this class may be required to serve as an Emergency Responder.\n Examination Process:\nA completed NeoGov application, including supplemental questions, must be submitted through NeoGov for consideration by the application deadline. Application materials will not be accepted separate from NeoGov or after the deadline.\n\nA FULLY COMPLETED APPLICATION AND RESPONSES TO SUPPLEMENTAL QUESTIONS ARE REQUIRED AND PART OF THE REVIEW AND QUALIFYING PROCESS. QUESTIONS MUST BE ANSWERED COMPLETELY; REFERENCING YOUR RESUME IN LIEU OF ANSWERING A QUESTION WILL BE CAUSE FOR DISQUALIFICATION.\n\nApplicants will be evaluated on the basis of relevant training and experience. The process may include interviews and/or performance tests. Successful candidates will be placed on the eligibility list established, which will be in effect for a period of six months. A background investigation including LIVESCAN fingerprinting is required. All appointments are also subject to the successful completion of a pre-placement physical examination that includes a drug screening. Applicants will be required to submit verification of the legal right to work in the United States. The City of Poway participates in E-Verify. All employees are required by law to sign a loyalty oath to the United States and the State of California Constitution at time of hire."}, {"title": "Energy", "company": "DuctTesters", "location": "Ripon, CA", "job url": "https://www.indeed.com/rc/clk?jk=065f114cca51d139&from=vj&pos=top", "description": "$12 - $20 an hourAre you looking for a position in the green/energy/sustainability/construction field? We have a career for you. We are looking for individuals willing to be team players and grow within the company and themselves.\n\nJob Summary:\nThe Apprentice position would start by shadowing a California Certified HERS Rater (CA Energy Code Compliance Certified) in order to learn how to check work that was installed by subcontractors in homes and/or buildings. The individual will develop their skills and learn about the different types of verification, schedule management, tracking and reporting results, enhancing subcontractor installations and education, and much more. The team player will move on to earn their own HERS Rater Certification in Alterations/Additions and then New Construction. From their the levels of growth can continue with other verification certifications and services we offer. The Apprentice may live anywhere in Southern California because they will travel within their region from project to project on a daily basis performing field inspections (HERS testing) verifying quality assurance for the client and state.\n\nQualifications:\nWe are looking to hire someone who is a team player, reliable, honest, and can manage their time well.\n\nWe provide a number of benefits including phone, car, gas, insurances, and more. You must have a clean driving background and hold a valid California Drivers License.\n\n\n\nAbout DuctTesters\n\n\nDuctTesters is an energy consulting and third-party verification company that was established in 2003. We have over 50 employees covering the entire state of California. The company has worked on thousands of projects and is well-known within the industry."}, {"title": "Construction Laborer- Multifamily", "company": "Fairfield Residential", "location": "Fremont, CA", "job url": "https://www.indeed.com/rc/clk?jk=f5c449b4cfe76f05&from=vj&pos=top", "description": "~ CAREER CHAT ~\n\nJoin us in a 10 minute virtual career chat to speak to a Fairfield Recruiter on this opportunity. Click on the link (or copy the URL and paste it into your web browser) to register:\nWednesday 2:00pm EASTERN TIME\nURL: https://app.brazenconnect.com/a/ffr/s/4vOLa/next\n~~~~~~\n\nOur Construction Laborer performs general manual labor tasks including loading, unloading, lifting, and moving materials. Assists a variety of functions with manual labor tasks as needed. Has knowledge of commonly-used concepts, practices, and procedures within a particular field. Relies on instructions and pre-established guidelines to perform the functions of the job. Works under immediate supervision. Primary job functions do not typically require exercising independent judgment. Typically reports to a supervisor or manager.\n\n\nMay be required to operate Man/Material lifts and temporary elevators. Qualified candidates will also be required to attend CPR and 10 hour OSHA certification classes.\n\n\nDuties Include:\nMaintain a clean jobsite\nSweeping\nCleaning\nErosion control\nGeneral labor"}, {"title": "Skilled Laborer", "company": "Advanced Creative Concrete", "location": "Yucaipa, CA 92399", "job url": "Not Available", "description": "Looking for a Laborer / concrete finisher. Must be reliable and be able to to lift 100 lbs. Must know or be willing to learn the trade of concrete and masonry.Job Type: Full-timeExperience:Skilled Labor: 2 years (Preferred)"}, {"title": "Skilled Laborer", "company": "Advanced Creative Concrete", "location": "Yucaipa, CA 92399", "job url": "Not Available", "description": "Looking for a Laborer / concrete finisher. Must be reliable and be able to to lift 100 lbs. Must know or be willing to learn the trade of concrete and masonry.Job Type: Full-timeExperience:Skilled Labor: 2 years (Preferred)"}, {"title": "Intern (Engineering-Construction)", "company": "Port of San Diego", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=d9343fd7effcd70d&from=vj&pos=top", "description": "$14.45 - $22.41 an hourPart-time, InternshipDesired: Driver's LicenseMicrosoft OfficeDescription\n\nThis Intern position will support the business administration efforts in the Engineering-Construction Department and report directly to the Department Administrative Manager. The Engineering-Construction (E-C) Department is a fast paced office environment with multiple and rapidly changing priorities.\n\nDuties will include but are not limited to the following: updating and developing written procedures and training, monthly, quarterly, and annual analytical report development, assist with contract administration and compliance, department invoice processing, monitoring assigned tasks, budget assistance preparation, meeting coordination and scheduling and agenda preparation. Substantial knowledge of Outlook and MS Office preferred.\n\nGENERAL PURPOSE\nWith general supervision, provides part-time employment opportunities for college level interns to perform job assignments that are closely related to their area of study. Any full-time college or graduate level student may apply for consideration for vacancies.\n\nDISTINGUISHING CHARACTERISTICS\nTotal scheduled work hours shall not exceed 25 hours per work week (Monday through Friday). Intern positions do not include benefits and are not eligible to receive paid leave, paid holidays, retirement and/or any type of insurance.\nEssential Duties and Responsibilities\n\nDuties and responsibilities assigned to Interns will vary depending on the department they are assigned.\nQualifications\n\nMINIMUM REQUIREMENTS\n\nEducation, Training and Experience:\nIntern I: College level students currently enrolled in at least twelve (12) semester units at an accredited college or university, majoring in a field of study closely related to current vacancies, may qualify for Intern I appointments. Students in their final semester/quarter who need less than full-time enrollment to graduate with a 2 or 4-year degree need only be enrolled part-time in courses required for degree completion, with verification from the college or university registrar.\n\nIntern II: Students in a graduate program leading to an advanced or doctoral degree enrolled in an accredited college or university, majoring in a filed of study closely related to current vacancies, may qualify for Intern II appointment with verification from the college or university registrar. Full-time student status is not required for students in a graduate program.\n\nLicenses; Certificates; Special Requirements:\n\nA current, valid California Class C driver's license at time of appointment and maintained at all times thereafter in order to operate a vehicle on District business.\nIf assigned to perform work at any of the District's maritime facilities you must be able to pass a background check in accordance with current Federal and State requirements.\n\nIf assigned to perform work at any of the District's Harbor Police facilities you must be able to pass a background investigation that includes, but is not limited to a polygraph examination.\n\nHow to Apply:\n\nApplications will only be accepted online. We do not accept hard copy applications.\n\nNOTE: A COLLEGE UNITS VERIFICATION FORM OR TRANSCRIPT MUST BE SCANNED AND UPLOADED TO THE ATTACHMENT SECTION OF YOUR APPLICATION.\n\nAPPLICATIONS WITHOUT UNITS VERIFICATION FORM OR TRANSCRIPT WILL BE DISQUALIFIED.\n\nSupplemental Information\n\nPHYSICAL AND MENTAL DEMANDS\nPersons with disabilities may be able to perform the essential duties of this class with reasonable accommodation. Reasonable accommodation will be evaluated on an individual basis and depends, in part, on the specific requirements for the job, the limitations related to disability and the ability of the hiring department to accommodate the limitation.\nResolution #:2014-130\nDated: June 10, 2014"}, {"title": "Laborer Worker", "company": "Rogan Concrete Cutting Inc.", "location": "Anaheim, CA 92807", "job url": "Not Available", "description": "Laborer will assist concrete cutting and coring technician with equipment set-up, cleanup and concrete demo and removal.Job Type: Full-timeWork authorization:United States (Required)"}, {"title": "Technician", "company": "Restoration Management Company", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=2ef0cfd0965bdfed&from=vj&pos=top", "description": "We are looking for a multi-skilled tradesperson who can preform the construction buildback of a home or commercial property effected by water and environmental remediation damage.\n\nDuties include but are not limited to:\nInstalling baseboards, crown molding, trim of different materials\nPlumbing\nFaceplates\nDrywall and Painting\nInstall cabinetry\nOther related projects for the buildback\n\nRequirements include but are not limited to:\nPassing a Background Check and Drug Test\nMust have their own tools to perform work and a vehicle to get to job sites\nMust have experience in the construction industry, 2 years is a plus"}, {"title": "Construction Laborer", "company": "KW Carter Construction Company.,LLC", "location": "Jacksonville, NC", "job url": "Not Available", "description": "TemporaryTuhis job opening is for the Construction Laborer position at KW Carter Construction Company.,LLC in Jacksonville, NC.We are looking to hire a skilled labor.- Siding, Window, Carpentry-These are residential projects located in Jacksonville, Havelock,NC area. All applicants must be able to pass a drug test, have their own personal vehicle and be ready to work hard outside for 40+ hours a week. Pay will be weekly.Requirements. Be professional at all times. Show up on time everyday. Perform the task at hard to the best Of your abilitesJob Type: Temporary"}, {"title": "Construction Worker", "company": "iks outfitters", "location": "Florence, SC", "job url": "Not Available", "description": "$600 - $1,200 a weekPart-time, Temporary, Contract, Internship, CommissionRoofing, sheet rock,tape and bed,painting,light electrical and light plumbing.Job Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionSalary: $600.00 to $1,200.00 /weekExperience:carpentry: 1 year (Preferred)Construction: 1 year (Preferred)Location:Florence, SC (Preferred)"}, {"title": "Superintendent of Construction", "company": "JWG Construction Company Inc.", "location": "El Cajon, CA", "job url": "Not Available", "description": "$70,000 - $90,000 a yearOnsite superintendent with experience in medical and dentistry T.I.Looking for minimum of 15-20 years experiencePlan reading and scheduling of sub-contactorsField problem solvingMaintain ScheduleCompile daily reportsJob Type: Full-timeSalary: $70,000.00 to $90,000.00 /year"}, {"title": "Construction Intern", "company": "Meritage Homes Corporation", "location": "Irvine, CA", "job url": "https://www.indeed.com/rc/clk?jk=04b8c7a3ee37cdb1&from=vj&pos=top", "description": "Temporary, InternshipResponsibilities\nThe Meritage Homes Internship program allows driven college/grad students the opportunity to gain experience with a National New Home Builder leading to possible future opportunities within the Meritage Homes family. You will work in an environment that fosters learning and allows you to take responsibility to help our team lead the way in our Green Building initiatives. The internship program uses your pursuit of education to drive you to a company where you can take your in class learning to hands-on applications. Meritage will work with your school schedule, because we value education as much as you do. You will work side by side with top professionals and executives as you start your career.\n\nThe Construction Intern will manage the new home construction process within assigned communities. Responsible for ensuring homes are delivered within specific cycle time and budget targets as well as customer quality expectations when closed. Responsible for maintaining customer satisfaction goals and providing needed customer care/warranty services in assigned communities.\n\nThe Construction Intern will work with and learn:\nThe permitting and building inspection process through the local jurisdiction(s)\nBuilding plans, materials and specifications\nAll Meritage processes required to build our homes\nProper scheduling and quality improvement systems\nStorm water pollution prevention and safety programs\nCustomer satisfaction programs including all customer points of contact\nThe Meritage Green System\nThe Meritage Customer Service program\nQualifications\nCurrently enrolled in a Bachelors or Masters degree program in Construction Management\nStrong academic record\nExcellent oral and written communication skills\nComputer skills in MS Office applications\nAbility/Desire to work in a team environment\nThis is a 3-month temporary field position taking place during the summer. This intern must be flexible to work at any of our locations throughout the summer.\nOverview\nAre you looking for an amazing career opportunity? Well, look no further! At Meritage Homes, we offer a variety of different careers and are dedicated to building beautiful, environmentally friendly homes, that give our customers the most memorable moments with their loved ones. Meritage Homes is a national top 10 homebuilder and a 2018 ENERGY STAR Partner of the Year in Sustained Excellence for being a leader in protecting the environment and advancing energy efficiency in homebuilding. If you have a self-starter mindset and want to be a part of something great, come join a company that helps people live happier, healthier lives.\nWhen joining Meritage Homes, you and your career can benefit in several ways, including:\nA work environment that encourages creativity and innovative ideas from every level\nAn organization that lives by its core values everyday\nMaintaining a consistent competitive drive to be the best\nA competitive pay structure\nStrong benefits\nState of the art technology to provide an optimal working environment\nFlexibility in work-life integration\nHaving pride in delivering a quality product that benefits people and the environment\nThe opportunity to further your career in a growing national organization\nTeam atmosphere where every individual is considered a vital part of the team"}, {"title": "Construction Laborer", "company": "Method Construction, Inc.", "location": "San Jose, CA", "job url": "Not Available", "description": "$14 - $20 an hourDesired: Construction ExperienceLocal long established General Contracting Company looking for laborers for South Bay Area projects. Start Immediately. Full-time.Laborer:-Must have reliable transportation to get to work.-Pay rate: Based on experience with opportunity for advancement.-Benefits.Reply by phone (408-842-0054), email or fax (408-842-0906) resumes: must include work history, business references and pay requirement with return contact information.Principals only. Recruiters, please don't contact this job posterJob Type: Full-timeSalary: $14.00 to $20.00 /hourExperience:construction: 1 year (Preferred)License:Drivers (Preferred)"}, {"title": "Construction Laborer", "company": "American Septic Services., INC", "location": "San Bernardino, CA 92410", "job url": "Not Available", "description": "CLASS A OR B PREFERREDLOCAL SEWER CONTRACTORS LOOKING FOR LABORERHEAVY EQUIPMENTHAND TRENCHINGLABOR INTENSIVEPLUMBING-FITTINGSSEPTIC TANK INSTALLATIONPUMPINGJob Type: Full-timeExperience:Plumbing: 1 year (Preferred)Construction: 1 year (Preferred)Septic Systems: 1 year (Preferred)License:Class B CDL (Preferred)Class A CDL (Preferred)Language:Spanish (Preferred)Work authorization:United States (Required)"}, {"title": "Construction Laborer Masonry", "company": "Bagwell Masonry", "location": "Palm Springs, CA", "job url": "Not Available", "description": "Part-timeDesired: Construction ExperienceDriver's LicenseMasonryCall760-401-9010 for a on phone interview and more job information. Candidate must have their own vehicle And drivers licenseThe contact is Shauna BagwellJob Type: Part-timeExperience:Construction: 1 year (Preferred)Masonry: 1 year (Required)"}, {"title": "Construction Laborer", "company": "Puopolo contruction", "location": "Omaha, NE", "job url": "Not Available", "description": "$100 a dayLooking for reliable labor worker. Job requires heavy lifting. Must have transportation to work.Job Type: Full-timeSalary: $100.00 /dayExperience:construction: 1 year (Preferred)"}, {"title": "General Laborer", "company": "McCarthy Building Co", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=bbae80af25a68b25&from=vj&pos=top", "description": "Position Summary\n\nMcCarthy is currently accepting applications for Union Laborers with experience on large construction jobsites. The Laborer role is essential and assists the project team in ensuring timely and successful completion of construction projects.\n\nResponsibilities\nMaintain a clean job site: pick up tools and equipment and secure job site each day in order to eliminate potential hazards\nSet up and take down ladders, scaffolding and other temporary structures\nLoad and unload trucks and haul and hoist materials\nMay assist with controlling traffic\nAssist carpenters and other trades\nQualifications\nMember of the Laborers Union\nKnowledge of proper use of equipment, materials and supplies used on commercial construction projects\nAbility to work independently and complete daily activities according to work schedule\nAbility to meet attendance schedule with dependability and consistency\nProof of Identity and Employment Authorization.\nMcCarthy Building Companies, Inc. is the oldest privately held national construction company in the country. We are a 100% employee-owned top 10 ENR company with the goal of being the best builder in America. Unlike many firms of our size, we are true builders; a fact which our clients appreciate since they continually come to us with their most complex building challenges. We provide general contracting, construction management, design-build and self-perform service nationwide. The firm has full-service offices in Atlanta, Dallas, Houston, Phoenix, Las Vegas, St. Louis, San Diego, Newport Beach, San Francisco and Sacramento and has built in nearly every state with projects ranging in size from $1 million to $1 billion.\n\nMcCarthy is proud to be an equal opportunity and affirmative action employer regardless of race, color, gender, age, sexual orientation, gender identity, religious beliefs, marital status, genetic information, national origin, disability or protected veteran status."}, {"title": "Project Field Manager in Cusco, Peru", "company": "Maximo Nivel", "location": "San Diego, CA 92121", "job url": "Not Available", "description": "$800 - $1,000 a monthADMINISTRATIVE WORKThe Field Manager provides support for overall program management, including: - Orientation and welcome - Site visits and problem-solving - Housing support and problem solving - Airport pick-up - Coordinating donations and aid - Sales and client service - Sending emails, answering phones, and updating the CRM system - Scheduling: Volunteers, Spanish classes, family-stays - Travel details (Flights, hotel, arrival, departure, etc.)There are several reports and administrative tasks that the Field Manager assists with on a regular basis using Microsoft Excel: Monthly program registration, Weekly Arrivals, Spanish & Beds, weekly Spanish class schedule, and participant feedback summary. The Field Manager is also involved with collecting payments and basic invoicing and proactively liaising and working with the Academic and Accounting departments.QUALIFICATIONS- Bachelors Degree - Bi-lingual English/Spanish. - 2-3 years professional experience - Business minded and very strong at managing details - Must be very client service oriented - Passion for traveling and helping others - Excellent computer skills including Word and ExcelJob Type: Full-timeSalary: $800.00 to $1,000.00 /month"}, {"title": "Construction Worker", "company": "Rancho Energy", "location": "Escondido, CA", "job url": "Not Available", "description": "$14 - $15 an hourDO YOU HAVE POWER TOOLS AND KNOW HOW TO USE THEM? WE ARE LOOKING FOR YOU!!!LOOKING FOR A HANDY MAN!MUST PROVIDE A PHONE NUMBER WE NEED TO BE ABLE TO REACH YOU TO SETUP INTERVIEW TIMES.CLEAN DRIVING RECORD BECAUSE YOU WILL BE DRIVING OUR TRUCKSYOU WILL NEED YOUR BASIC HANDY MAN TOOLS (DRILL, HAMMER, TAPE MEASURE...)BILINGUAL IS A PLUS AS MOST OF OUR CUSTOMERS SPEAK SPANISHPLEASE DON'T BOTHER APPLYING IF YOU'RE LOOKING FOR A POSITION THAT PAYS MORE THAN $16. PER HR.THIS IS A GOOD JOB THAT OFFERS PLENTY OF OVERTIME FOR THOSE THAT DON'T MIND WORKING ON THE WEEKENDS.WE INSTALL THE FOLLOWING ON THE DAILY:-DOORS (SOLID SLAB) MUST BE ABLE TO LIFT UP TO 85-95LBS-SHOWER HEADS (HAND HELD AND STANDARD) AND AERATORS- DOOR REPAIR SUCH AS THRESHOLDS, DOOR SHOES, STRIKER PLATES AND MORE-WEATHER STRIPPING-GLASS-INSULATION ON SELECT DAYS-LIGHT FIXTURES, LIGHT BULBS, STAND UP LAMPS AND PORCH LIGHTS-SMOKE DETECTORS AND CO DETECTORS-MICROWAVESSO AS YOU CAN SEE THIS IS NOT A ROCKET SCIENCE TYPE OF JOB SO THE PAY IS $14-$15 TO START WITH ROOM TO GROW UP TO $16-$20.IF YOU'RE LOOKING AT GETTING INTO THE CONSTRUCTION FIELD THIS IS THE PERFECT STARTING OFF POINT FOR YOU. YOU MUST HAVE TOOLS BUT WE WILL TRAIN YOU!!!Job Type: Full-timeSalary: $14.00 to $15.00 /hourLanguage:SPANISH AND ENGLISH (Preferred)"}, {"title": "Stormwater Maintenance &amp; Construction Wo...", "company": "City of Poway, CA", "location": "City of Poway, CA", "job url": "https://www.indeed.com/rc/clk?jk=4d67ade4c341aa4e&from=vj&pos=top", "description": "$19.17 - $23.30 an hourThe Stormwater Maintenance & Construction Worker I is active in the construction, maintenance and repair of City stormwater and drainage systems, including 9 miles of concrete channels, 20 miles of brow ditches, 10 static and 4 mechanical detention basins, 64 miles of storm pipe, 105 miles of open channels, and 1,400 drop inlets. If you want to join a team of highly talented and qualified people who work hard to provide optimum services to the Poway community, you are encouraged to apply.\nPerforms a variety of work in the construction, modification, maintenance, and repair of City stormwater and drainage systems and facilities; uses and operates a variety of manual and power tools and light to heavy power driven equipment; receives direct or general supervision from the Construction Maintenance Supervisor or assigned supervisor; exercises no direct supervision over staff; may provide technical and functional direction to lower-level staff.\n\n Key Responsibilities:\nManagement reserves the right to add, modify, change or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job.\n\nPerforms construction, maintenance, and repair activities of City construction systems and facilities to ensure safe and efficient access for the public, including concrete and open channels, creeks, pipes, drains, detention basins, and drop inlets.\nPerforms a variety of duties in the maintenance of drainage structures to ensure efficient drainage, including inspecting, repairing, and replacing patrol tide areas, and opening and closing tide valves along assigned routes.\nPerforms concrete and open channel maintenance, including inspecting and repairing stormwater conveyance systems to ensure water quality, removing/abating weeds and other invasive vegetation, removing coefficients, sediments, debris, and trash from channels, applying site delineation, best management practices, and erosion control before, during, and after maintenance activities, and keeping in compliance with applicable Federal, State, and local water regulatory laws and regulations.\nInspects, maintains, and repairs box coverts under roads and bridges.\nInspects, maintains, and repairs dynamic and static stormwater detention basins; monitors water quality for pollution, contamination, and turbidity reduction in the event of rain, in compliance with the Environmental Protection Agency's Standard Urban Storm Water Mitigation Plan (SUSMP).\nInspects, maintains, and repairs all City drop inlets, storm drains, stormwater pipes, and brow ditches; repairs damage and cleans out dirty or clogged facilities, in compliance with the City's Jurisdictional Urban Runoff Management Program (JURMP) for compliance with the City's stormwater permit.\nPerforms related duties as assigned.\nParticipates in the City-wide inspection program, including inspecting assigned City infrastructure for safety issues, structural integrity, and possible future work projects and programs, and appropriately marking areas that need to be repaired.\nOperates and maintains specialized vehicles and a variety of light, medium, and heavy equipment related to the construction, maintenance, and repair of construction systems and facilities.\nOperates a variety of hand and power tools and equipment related to work assignment as instructed.\nObserves safe work methods and makes appropriate use of related safety equipment as required.\nMaintains public facilities, shop and garage areas, storage sites, and other work areas in a clean and orderly condition, including securing equipment at the close of the workday.\nInstalls street barricades and cones and controls traffic around work sites and special events to ensure safe conditions for the general public and City workers.\nProvides needed information and demonstrations concerning how to perform certain work tasks to new employees in the same or similar class of positions.\nMaintains accurate logs and records of work performed and materials and equipment used.\nMaintains attendance and punctuality that is observant of scheduled hours on a regular basis.\nResponds to after-hours emergencies.\n Minimum Requirements/License or Certificates Required:\nExperience:\nOne year of recent experience in construction maintenance and/or repair of stormwater and drainage, or related facilities, systems, and appurtenances.\n\nEducation/Training:\nEquivalent to the completion of the 12th grade.\n\nLicenses and Certifications:\n\nA valid class C driver's license.\nAbility to obtain and maintain a class A driver's license.\nAbility to obtain and maintain a Traffic Control Certificate.\nAbility to obtain and maintain a Fork Lift Certificate.\nAbility to pass SCBA Fitness Testing and the certification process.\nAbility to obtain and maintain a Confined Space Certificate.\nAbility to obtain and maintain a Trench Shoring Certificate.\n\nPHYSICAL DEMANDS\nMust possess mobility to work in the field; strength, stamina, and mobility to perform medium to heavy physical work, to work in confined spaces and around machines, to climb and descend ladders, to operate varied hand and power tools and construction equipment, and to operate a motor vehicle and visit various City sites; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone or radio. The job involves fieldwork requiring frequent walking in operational areas to identify problems or hazards. Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard or calculator and to operate above-mentioned tools and equipment. Positions in this classification bend, stoop, kneel, reach, and climb to perform work and inspect work sites. Employees must possess the ability to lift, carry, push and pull materials and objects weighing up to 100 pounds, or heavier weights with assistance or with the use of proper equipment.\n\nEnvironmental Elements\nEmployees work in the field and are exposed to loud noise levels, cold and hot temperatures, inclement weather conditions, road hazards, vibration, confining workspace, chemicals, mechanical and/or electrical hazards, and hazardous physical substances and fumes. Employees may interact with upset staff and/or public and private representatives and contractors in interpreting and enforcing departmental policies and procedures.\n\nWORKING CONDITIONS\nMay be required to be on-call and to work various shifts or emergencies on evenings, weekends, and holidays. In case of a City wide emergency or natural disaster, employees in this class may be required to serve as an Emergency Responder.\n Examination Process:\nA completed NeoGov application, including supplemental questions, must be submitted through NeoGov for consideration by the application deadline. Application materials will not be accepted separate from NeoGov or after the deadline.\n\nA FULLY COMPLETED APPLICATION AND RESPONSES TO SUPPLEMENTAL QUESTIONS ARE REQUIRED AND PART OF THE REVIEW AND QUALIFYING PROCESS. QUESTIONS MUST BE ANSWERED COMPLETELY; REFERENCING YOUR RESUME IN LIEU OF ANSWERING A QUESTION WILL BE CAUSE FOR DISQUALIFICATION.\n\nApplicants will be evaluated on the basis of relevant training and experience. The process may include interviews and/or performance tests. Successful candidates will be placed on the eligibility list established, which will be in effect for a period of six months. A background investigation including LIVESCAN fingerprinting is required. All appointments are also subject to the successful completion of a pre-placement physical examination that includes a drug screening. Applicants will be required to submit verification of the legal right to work in the United States. The City of Poway participates in E-Verify. All employees are required by law to sign a loyalty oath to the United States and the State of California Constitution at time of hire."}, {"title": "Construction Laborer", "company": "BMC-Building Materials and Construction Solutions", "location": "Monroe, NC", "job url": "Not Available", "description": "BMC is looking for Construction Laborers who would like to transition into Truss Assembly. It is year round work and we offer a competitive benefits package.Major Responsibilities: Assembles building material components such as wall panels, roof and floor trusses. Processes include insertion or positioning of materials, clamping, splicing, fitting parts and use of both hand and power tools.Plans and implements the assembly process by reading and understanding set-up sheets, work orders, drawings or blueprints and gathers necessary materials and tools to complete order.Ensures that assembled items meet specific quality specifications; may propose process improvements in order to increase finished quality or efficiency of assembly processes.Plans and paces own work efficiency in order to meet daily, weekly, project, or team related production goals.Responds attentively to training from Supervisor or more senior assemblers in order to increase own knowledge of work processes.Understands and observes all safety procedures and practices in order to prevent injury to self or co-workers; attends periodic safety meetings as required; may recommend changes to improve safety procedures.May perform other duties or projects as assigned by management.Required Skills: Minimum education preferredHigh school diploma or General Education Degree (GED).Knowledge of and ability to use a variety hand and power tools to assemble either building materials components products.Manual dexterity.Knowledge of safety procedures while performing assembly tasks.Ability to apply common sense understanding to carry out detailed but uninvolved written or oral instructions.Ability to read and understand simple diagrams or blueprints.Other: Temperatures will vary. Dusty and noisy environment when operating machines and tools. Ear protection required when exposed to noise for an extended period of time. Eye protection and steel toed (safety toed) hard sole leather boots required at all times. Overtime work could be involved. Must be able to lift and carry up to 50 pounds frequently and on occasion up to 100 pounds.Job Type: Full-time"}, {"title": "CONSTRUCTION GRADE SETTER", "company": "McCuen Construction", "location": "Loomis, CA", "job url": "Not Available", "description": "Please send your resume to:\ncontact@mccueninc.com\nJob Requirements:\nWork in a safe and efficient way according to all relevant legislation, policies and procedures\nAssist construction site workers in grading and underground operations\nInterpret survey stakes and plans to provide control ahead of grading and underground operations\nInform the Foreman of discrepancies between the plans and site conditions\nCollaborate with Foreman to maintain as-built drawings\nWork well with all parties involved including, coworkers, inspectors and management\n\nPersonal Requirements:\nPunctual, reliable and able to maintain a consistent work schedule\nSelf-motivated with positive attitude and strong work ethic\nTake initiative and ask questions as needed\nAbility to follow directions to ensure completion of daily tasks\nAble to communicate with the public and co-workers effectively\nReliable transportation to get to and from work\nFlexibility to work extra hours"}, {"title": "Construction Laborer", "company": "Lakeview Rock Products", "location": "North Salt Lake, UT 84054", "job url": "https://www.indeed.com/rc/clk?jk=34fb63b7ae0cbd78&from=vj&pos=top", "description": "Lakeview Rock Products, Inc. is a longstanding family owned business with almost 40 years of experience, depth of knowledge and tradition. We are known within the industry for our outstanding employee culture and a business model offering steady, year-round employment.\nWe are proud to offer you:\n\nWeekly Pay\nMedical / RX Insurance\nDental Insurance\nVision Insurance\nLife Insurance\nShort-Term Disability\nEmployee Assistance Program\nAccident Plan\nCritical Illness Plan\n401(K)\nFlex 125 Cafeteria Plan\nIn-House Training Opportunities\nCompany Store\nJob Summary:\nLakeview Rock Products, Inc. is actively searching for a Laborer to join our growing team! This individual will perform tasks involving our gravel pit and commercial construction projects. May operate a variety of hand and power tools. May clean and prepare sites, dig trenches, set braces to support the sides of excavations, clean up rubble and debris and remove waste materials. May assist other craft workers.\nEssential Functions: (Essential functions, as defined under the Americans with Disabilities Act, may include the following tasks, knowledge, skills and other characteristics. This list of tasks is illustrative ONLY, and is not a comprehensive listing of all functions and tasks performed by positions in this class. It does not imply that all positions within the class perform all of the duties listed, nor does it necessarily list all possible duties that may be assigned.)\n\nPerform a variety of tasks involving manual labor in gravel pit operations and construction projects.\nMaintain a clean job site: pick up all tools and equipment and secure job site each day in order to eliminate potential hazards.\nEnsure that proper safety and incident reporting procedures are followed. Bring problems to the attention of the Superintendent/Foreman, Safety Manager, Safety Officer or HR Manager.\nKnowledge, Skills and Abilities:\n\nSome knowledge of proper use of equipment, materials and supplies used in gravel pit operations.\nSome knowledge of first aid and applicable safety precautions.\nAbility to work independently and complete daily activities according to work schedule.\nAbility to repeatedly lift and carry heavy objects (50 pounds), walk and stand for long periods of time and perform physical labor under adverse field conditions.\nAbility to communicate orally and in writing.\nAbility to use equipment and tools properly and safely.\nAbility to understand, follow and transmit written and oral instructions.\nAbility to meet attendance schedule with dependability and consistency.\nEducation, Training and Experience:\n\nAny combination of education and experience that demonstrates the knowledge and ability to perform the work.\nWillingness and ability to perform manual work following verbal and written instructions.\nSpecial Requirements: Must be able to pass controlled substance tests prior to and at all times during employment."}, {"title": "Laborer", "company": "California State University - Fullerton", "location": "Fullerton, CA", "job url": "https://www.indeed.com/rc/clk?jk=78e796c73f29f9af&from=vj&pos=top", "description": "$2,789 - $4,901 a monthIt is an exciting time to join Cal State Fullerton as we are an in demand comprehensive University that is driven to shape the future of education and foster a vibrant community of diverse students, faculty, staff and administrators who uphold values of inclusive excellence, free speech, and an environment free from discrimination. We are continuously seeking individuals from a variety of career disciplines that share in the Universitys mission and core values. We warmly welcome you to consider joining the Titan Community where minds expand and opportunities flourish.\n\nAbout CSUF:\nStanding on 241 acres at the heart of Southern California, the university was founded in 1957 and has grown into a population of over 40,000 students. As Titans, we believe that diverse perspectives deepen our understanding. We are committed to giving students the support they need to graduate, while responding to Californias revolving work force needs. At California State University, Fullerton we strive for continual improvement of students, staff, faculty and administrators through orientations, training programs and professional development opportunities. As part of the Titan Community, you have access to many campus facilities and services including but not limited to the Grand Central Art Center in Santa Ana, CSUF Garden Grove Center, Fullerton Arboretum, cultural events and performances in the Clayes Performing Arts Center, Cal State Fullerton Athletics sports events, Titan Recreation Center, and the Employee Wellness Program.\n\nAbout the Position:\nThe Capital Programs and Facilities Management Department is committed to planning, developing, and maintaining a safe, sustainable, and high quality learning and working environment for the campus community. We are seeking an exceptional individual to join our team as a Laborer. The ideal candidate in this role should have a positive attitude and an active, energetic mind that is characterized by highly ethical practices and a commitment to diversity, openness, flexibility, integrity, and kindness.\n\nUnder supervision of the Building Trades Manager, this position assists Moving Services Department with on and off Campus moves and for assisting the coordination of outside moving companies for large contracted moves. Position assists the coordination of long and short term housing of classroom and DSS furniture, working closely with campus customers to ensure that furniture is properly stored. Supports the Department with Property Disposition, Recycling of: Metals, E- Waste, Waste Disposal, Donation and Archive Support. Serves as the Laborer for the Moving Services Department within Physical Plant. Position will assist in the day-to-day operations of the Moving Services Department and operations, manage vendor contracts, inspects completed work for conformance with specifications, requirements and compliance with documents, and applicable building safety codes and regulations. Other duties as assigned.\n\nEssential Qualifications Ability to follow simple oral and written directions. Ability and willingness to do strenuous manual labor including lifting and safely moving heavy objects. Ability to read basic signs and labels appropriate to the duties of the position.\n\n\nA background check (including a criminal records check) must be completed satisfactorily and is required for employment. CSU will make a conditional offer of employment, which may be rescinded if the background check reveals disqualifying information, and/or it is discovered that the candidate knowingly withheld or falsified information. Failure to satisfactorily complete the background check may affect the continued employment of a current CSU employee who was conditionally offered the position.\n\nPreferred Qualifications Experience working in a campus environment.\n\nPossession of Forklift certification from EH&IS.\n\nExperience using a computerized facilities management program.\n\nAbility to use a computer, including Microsoft Word, Excel, and Outlook.\n\nLicense/ Certification Ability to obtain a Forklift Operators Certificate\n\nAbility to obtain Asbestos O&M Certification\n\nValid California Driver's License.\n\nSpecial Working Conditions Works on uneven surfaces, in and around construction sites, and on roofs and other elevated surfaces. Works with hazard containing materials, such as asbestos and lead. Will carry master keys.\n\n\nWork Schedule: May be required to work alternate/compressed, off hour shifts, and/or weekends.\n\n\nCalifornia State University, Fullerton celebrates all forms of diversity and is deeply committed to fostering an inclusive environment within which students, staff, administrators and faculty thrive. Individuals interested in advancing the Universitys strategic diversity goals are strongly encouraged to apply. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose.\n\n\nMultiple positions may be hired from this recruitment based on the strength of the applicant pool.\n\n\nIf you are applying for a staff position, please note that you are not eligible to work concurrently in a staff position and an Academic Student position such as Graduate Assistant, Teaching Associate, Instructional Student Assistant or a Student Assistant position.\n\n\nRegular attendance is considered an essential job function; the inability to meet attendance requirements may preclude the employee from retaining employment.\n\n\nEmployee/applicant who submits an application for a position may be required to successfully complete job related performance test(s) as part of the selection process.\n\n\nOnline application/resume must be received by electronic submission on the final filing date by 9:00 PM (Pacific Standard Time)/midnight (Eastern Standard Time). Applicants who fail to complete all sections of the online application form will be disqualified from consideration.\n\n\nCalifornia State University, Fullerton is not a sponsoring agency for staff or management positions (i.e. H1-B Visas).\n\n\nCalifornia State University, Fullerton celebrates all forms of diversity and is deeply committed to fostering an inclusive environment within which students, staff, administrators and faculty thrive. Individuals interested in advancing the Universitys strategic diversity goals are strongly encouraged to apply. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose.\n\nHiring Preference None"}, {"title": "Construction Laborer", "company": "Corradini Ventures Corp", "location": "Colorado Springs, CO", "job url": "Not Available", "description": "$15 - $18 an hourGeneral Labor Work for tearing down Roofs on a on-going large project. You will need a good work ethic and be available Monday thru Friday for a 40 hour+ work week. Must be able to lift 25 to 40 lbs and be willing to work on a roof. No Experience necessary and willing to train but the more you know the better your wages.Job Type: Full-timeSalary: $15.00 to $18.00 /hourExperience:Construction: 1 year (Preferred)Work authorization:United States (Required)Shifts:Morning (Required)Mid-Day (Required)"}, {"title": "Construction Laborer/Helper", "company": "Razzano Construction Corp", "location": "Slate Hill, NY 10973", "job url": "Not Available", "description": "$12 - $17 an hourDesired: Construction ExperienceLocal builder seeking a Construction Laborer with general experience in new home construction.We are currently framing a new home in Slate Hill NY but also do all phases of construction.$12-$17. per hr based on experience.Job Type: Full-timeSalary: $12.00 to $17.00 /hourExperience:Construction: 1 year (Preferred)"}, {"title": "Construction Helper/Laborer", "company": "Krueger Bros. Builders, Inc.", "location": "Napa, CA", "job url": "Not Available", "description": "Desired: Construction ExperienceDriver's LicenseLong established General Contractor working in Napa, the North Bay, and the East Bay areas in the custom residential field seeks a motivated individual with the following qualifications.Minimum 2-years verifiable construction trade experience.Basic hand tools and reliable transportation, possession of a valid driver's license.Good work ethic, reliable and willing to learn the trade.This is an excellent opportunity for the right candidate who values a good job opportunity and the chance to learn the trade.If you have an alcohol or controlled substance problem please do not apply as we do test.Job Type: Full-timeExperience:Construction: 2 years (Required)Location:Napa, CA (Preferred)Work authorization:United States (Required)"}, {"title": "Construction Laborer", "company": "dnl power", "location": "Brooklyn, NY 11214", "job url": "Not Available", "description": "$15 - $20 an hourwe are looking electrician helpers / windows installation must have Osha with exper/with out experJob Type: Full-timeSalary: $15.00 to $20.00 /hourExperience:construction: 2 years (Preferred)"}, {"title": "Brick Yard Laborer Needed!", "company": "Go-Staff Inc.", "location": "Encinitas, CA", "job url": "Not Available", "description": "$11.50 an hourGO-STAFF is currently hiring for General Laborers for a Brickyard in Encinitas. Must be willing to come to our office in Oceanside for the interview. If you have arecent labor or relevant experience (within the last 12 months) and are eligible to work in the United States you could be working ASAP!Job Includes (but not limited to):- moving bricks- Heavy Lifting- Shoveling Dirt- Clean up on job site- Other duties as neededPay Rate Starting at $11.50/hrRequirements:- Must have good work history- with verifiable reference- Must be reliable and dependable- Work Saturdays (Off Sunday and 1 weekday)-Must be able to lift heavy items-Background friendly-clean drug screenPlease call760-730-8520to schedule an interview.Job Type: Full-timeSalary: $11.50 /hourJob Type: Full-timeSalary: $11.50 /hourExperience:Heavy Lifting: 1 year (Preferred)"}]