[{"title": "Route Driver (CDL or Non CDL)", "company": "Iron Mountain", "location": "La Mesa, CA", "job url": "Not Available", "description": "Iron Mountain Incorporated (NYSE: IRM), founded in 1951 and in the rank of Forbes 2018 Americas Best Employers, is the global leader for storage and information management services. Trusted by more than 225,000 organizations around the world, and with a real estate network of more than 85 million square feet across more than 1,400 facilities in over 50 countries, Iron Mountain stores and protects billions of valued assets, including critical business information, highly sensitive data, and cultural and historical artifacts. Providing solutions that include information management, digital transformation, secure storage, secure destruction, as well as data centers, cloud services and art storage and logistics, Iron Mountain helps customers lower cost and risk, comply with regulations, recover from disaster, and enable a more digital way of working. Visit www.ironmountain.comfor more information.Details of the position: Local routesCompetitive, hourly pay + paid overtimeQuarterly performance bonusCompany paid uniforms & safety footwearFull benefits -eligible day 1 of employmentMedicalDentalVisionOther benefits-Tuition Reimbursement401k (with company match)Employee Stock Purchase ProgramPaid vacation, holidays, sick/personal timeIron Mountain is an equal opportunity employer, and does not unlawfully discriminate on the basis of race, color, religion, sex, national origin, marital status, age, sexual orientation, gender identity characteristics or expression, disability, medical condition, U.S. Military or veteran status or other legally protected classifications in making employment decisions.Job Type: Full-timeExperience:Regulations: 1 year (Preferred)"}, {"title": "Courier Driver", "company": "Griffin &amp; Company", "location": "San Diego, CA", "job url": "Not Available", "description": "$600 - $900 a weekContractDesired: Clean Driving RecordDriver's LicenseCustomer ServiceTransportation company hiring package delivery drivers in the Vista, CA areaThis is a 1099 position meaning your responsible for providing your vehicle and fuel .We deliver packages for Amazon, Walmart and Google as well as many other companies. Closest comparison to the job description would be that of a UPS or FedEx Driver. We will respond within 24 hours to any questions.Qualifications for the position are:-21+ with a valid drivers license-You will be subject to a background check, No criminal history of theft, breach of trust etc.-Clean Driving Record .-Helpful skills include:-Ability to use GPS effectively-Familiar route planner apps for smart phones-Good customer service skills-Ability to think on your feet and overcome obstacles (not every delivery is a drop at the door)-Job Type: Full-time-Job Location:-Vista, CA-Required experience:-Must have package delivery experience.Job Types: Full-time, ContractLocation:San Diego, CA (Required)License:DOT (Preferred)Work authorization:United States (Required)Shifts:Morning (Required)Job Types: Full-time, ContractSalary: $600.00 to $900.00 /week"}, {"title": "Full Time Driver position", "company": "Healthcare Services Inc/Lighthouse Residential Treatment/Community Transition Center", "location": "Point Loma, CA", "job url": "Not Available", "description": "$30,160 a yearDesired: Driving ExperienceCDL CDriver for Criminal Justice Rehabilitation Program in San Diego.Must have good driving DMV record, able to clear Department of Justice backround checks,submit pre-hire and random urinalysis/drug test, 0 tolerance,No THC.Medical Insurance benefits paid for after 90 days, low cost dental/vision available.Apply with resumeJob Type: Full-timeSalary: $30,160.00 /yearExperience:Driving: 2 years (Preferred)Education:High school or equivalent (Preferred)Location:Point Loma, CA (Preferred)License:California DMV (Preferred)CDL Class C (Preferred)Language:English (Preferred)Work authorization:United States (Preferred)Shifts:Morning (Preferred)Mid-Day (Preferred)Evening (Preferred)"}, {"title": "Business Center Truck Driver", "company": "Costco Wholesale", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=cc479055a53e9b8a&from=vj&pos=top", "description": "Desired: CDL BDrives and unloads commercial truck. Verifies items and quantities delivered to members, collects payment and completes paperwork. Must possess a Class B Commercial license with no restrictions."}, {"title": "Driver Helper", "company": "UNITED PARCEL SERVICE", "location": "La Jolla, CA", "job url": "https://www.indeed.com/rc/clk?jk=b09755743f780214&from=vj&pos=top", "description": "UPS is hiring individuals to work as temporary, seasonal Driver Helpers. This is a physical, fast-paced, outdoor position that involves continual lifting, lowering and carrying packages that typically weigh 25 - 35 lbs. and may weigh up to 70 lbs. It requires excellent customer contact skills and a lot of walking.\n\nAs a Driver Helper you will not drive the delivery vehicle but assist the driver in the delivery of packages.\n\nDriver Helpers usually meet the UPS driver at a mutually agreed upon time and location each weekday. Workdays can vary (Monday  Friday) or (Tuesday  Saturday) depending on the building needs. Hours vary but usually begin after 8:00 a.m. and end before 8:00 p.m. Driver Helpers must comply with UPS appearance guidelines.\n\nDriver Helper seasonal opportunities are typically between the Thanksgiving and Christmas holiday time period.\n\nThis job posting includes information about the minimum qualifications (including the UPS Uniform and Personal Appearance Guidelines), locations, shifts, and operations within the locations which may consider my application. An applicant or employee may request an exception or change to, or an accommodation of, any condition of employment (including the UPS Uniform and Personal Appearance Guidelines) because of a sincerely held religious belief or practice.\nUPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law"}, {"title": "Advanced Driver Assistance Systems (ADAS) Test Operator", "company": "Tesla", "location": "Atlanta, GA", "job url": "https://www.indeed.com/rc/clk?jk=97d5b6ae4f1b4d55&from=vj&pos=top", "description": "We are looking for a highly motivated individual to accelerate our vehicle-level testing for autonomous vehicles. The Advanced Driver Assistance Systems (ADAS) Test Operator will help drive Teslas Autopilot by testing daily Autopilot firmware updates on a local, predetermined route, to allow tracking of improvements across firmware revisions. The role requires someone highly organized, objectively-focused when making judgements, and confident in their ability to manage their own daily routine.\nThis role could require the flexibility of traveling to domestic and international destinations as necessary, to test vehicles on public roads, test tracks and Proving Grounds.\nThe position is based out of Austin, TX and will be based on a standard Mon-Fri week.\nResponsibilities\nDrive a local pre-determined test route daily with the same vehicle to record data for, and provide subjective feedback on, the performance of daily Autopilot firmware updates.\nStart/Stop recording devices, and do minor equipment/software debugging when necessary.\nDo minor vehicle debugging and document issues with TIRs when necessary.\nAnalyze data collected during testing to sanity check it before handing to engineers, and make recommendations to the internal design teams based on subjective and objective findings.\nWrite daily End-of-Shift (EOS) email detailing observations and issues for engineers to follow up on.\nBe on-call for questions and requests from engineers on specific occurrences.\nCheck vehicle is in proper and safe working order every day, and if not, notify team for repair.\nRequirements\nClean driving record and safe driving habits.\nExcellent attention to detail and highly observational.\nExcellent written and spoken English.\nExcellent PC skills, particularly MS Office (Word, Outlook, Excel), navigating hard drives, making data transfers and checking data.\nGood navigational skills.\nFamiliarity with ADAS/Autopilot systems and their sensors is preferred.\nBasic knowledge of vehicle systems and how they work, such as brakes and power assisted steering, is preferred.\nMust be comfortable driving prototype vehicles that may lack safety features such as airbags, or contain safety risks such as un-validated-firmware, on public roads.\nAbility to multi-task, prioritize and work in an extremely fast-paced environment.\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Test Operator", "company": "Tesla", "location": "Fremont, CA", "job url": "https://www.indeed.com/rc/clk?jk=710702ad370a8177&from=vj&pos=top", "description": "We are looking for a highly motivated individual to accelerate our vehicle-level testing for autonomous vehicles. The Advanced Driver Assistance Systems (ADAS) Test Operator will help drive Teslas Autopilot by testing daily Autopilot firmware updates on a local, predetermined route, to allow tracking of improvements across firmware revisions. The role requires someone highly organized, objectively-focused when making judgements, and confident in their ability to manage their own daily routine.\nThis role could require the flexibility of traveling to domestic and international destinations as necessary, to test vehicles on public roads, test tracks and Proving Grounds.\nResponsibilities\nDrive a local pre-determined test route daily with the same vehicle to record data for, and provide subjective feedback on, the performance of daily Autopilot firmware updates.\nStart/Stop recording devices, and do minor equipment/software debugging when necessary.\nDo minor vehicle debugging and document issues with TIRs when necessary.\nAnalyze data collected during testing to sanity check it before handing to engineers, and make recommendations to the internal design teams based on subjective and objective findings.\nWrite daily End-of-Shift (EOS) email detailing observations and issues for engineers to follow up on.\nBe on-call for questions and requests from engineers on specific occurrences.\nCheck vehicle is in proper and safe working order every day, and if not, notify team for repair.\nRequirements\nClean driving record and safe driving habits.\nExcellent attention to detail and highly observational.\nExcellent written and spoken English.\nExcellent PC skills, particularly MS Office (Word, Outlook, Excel), navigating hard drives, making data transfers and checking data.\nGood navigational skills.\nFamiliarity with ADAS/Autopilot systems and their sensors is preferred.\nBasic knowledge of vehicle systems and how they work, such as brakes and power assisted steering, is preferred.\nMust be comfortable driving prototype vehicles with non-production firmware\nAbility to multi-task, prioritize and work in an extremely fast-paced environment.\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Personal Driver", "company": "Freight Chasers", "location": "Dallas, TX", "job url": "Not Available", "description": "$800 - $1,000 a weekPart-time, TemporaryDesired: Driving ExperienceDriver's LicensePersonal Drivers wanted for morning and night shifts. Unlimited earning potential for drivers. We provide you with one of our company cars, and we take care of the insurance and maintenance for you. All you need is a great personality, a valid drivers license, and a good driving history to put money in your pocket. Personal drivers are paid weekly!! NO experience necessary, we will provide training if needed. Opportunity for growth within the company.Job Types: Full-time, Part-time, TemporarySalary: $800.00 to $1,000.00 /weekExperience:driving: 3 years (Preferred)License:valid drivers license and a good driving history. (Preferred)"}, {"title": "Professional Chauffeur / Driver.", "company": "Sbcfire", "location": "San Diego, CA", "job url": "Not Available", "description": "$2,500 a monthPart-timeDesired: Clean Driving RecordDriving ExperienceDriver's LicenseWe seek a courteous and professional Private Chauffeur. The successful candidate will be highly adaptable and will have a proven track record of providing discrete protective services. Responsibilities include but are not limited to:Drive to and from general destinations, appointments, meetings, secondary residences, airports and heliportsExcellent knowledge of San Diego Area with or without GPSFlexibility with schedule.Assist with luggage, heavy lifting and household choresAble to multi-task, think quickly and respond effectively in a dynamic and ever changing environment.Keep inspections and service requirements up to dateRun errands, general maintenance, and carry out special requests.This is a full-time and Part-time position.The position requires schedule flexibility.Requirements:Excellent references from both current and previous employersMust have a minimum of 2-3 years of Private Chauffeur experienceStrong communication and technical skillsMust have professional appearance and pleasant demeanorAbility to work independently.Excellent command of the English language.Detail oriented with exceptional organizational skillsFlexibility with hours and schedulingValid drivers license with clean recordUnited States work authorizationAbility to maintain confidentiality and discretion at all times.Job Types: Full-time, Part-timeSalary: $2,500.00 /monthExperience:Driving: 1 year (Preferred)Chauffeur: 2 years (Preferred)License:Drivers (Preferred)Driver's License (Preferred)Language:English (Preferred)Work authorization:United States (Preferred)"}, {"title": "Parts Driver", "company": "Poway Hyundai Mitsubishi", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=9273e28894d9a683&from=vj&pos=top", "description": "If you're looking for an opportunity to join the automotive industry as a valued team member, your search is complete. Poway Auto Group recognizes top talent and believes in promoting from within. There's plenty of room for advancement at both of our locations. This position responsible for supporting delivery of parts to commercial customers and controlling inventory processes in the store.\n\nWhat We Offer\n\n\nMentorship and coaching\nExcellent Opportunities for Career Growth\nWere all on the same Team atmosphere\nFull insurance\nVacation, Holiday, Illness PTO options\n\nResponsibilities\n\n\nSafely deliver parts to customers as needed\nPick and stage parts for customer orders\nPick up returns and cores\nChecks with the parts manager, wholesale representative, inventory control administrator, parts counter specialist, or shipping and receiving clerk before leaving to coordinate any last minute pick-ups and deliveries.\nVerifies that invoice matches purchase order for each pick-up and also parts matches invoice.\nChecks payments received with the invoices for each delivery\nKeeps an accurate log of daily deliveries and pick-ups. Requests recipients signature on each delivery entry.\nUnloads truck end of each day. Turns in all paperwork and undelivered parts and returns.\nHandles basic maintenance of the delivery truck including filling tank with gas, checking oil, keeping it clean, and making sure required inspections are performed.\nAdvises parts manager if delivery trucks need major repairs and maintenance.\nAbility to lift between 50 LBS to 80 LBS\nHelp maintain the professional appearance of parts department\nHelps with stocking and receiving orders when they arrive to expedite delivery to shop technicians and wholesale accounts.\nMaintains professional appearance.\n\nQualifications\n\n\nBasic driving and navigation ability\nFriendly communication\nAbility to locate and stock parts\nSafety knowledge and skills\nSpeak and write English\nCommunicate effectively\nRead and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, packing list and procedure manuals\nUse basic math accurately: add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals\nAbility to work an assortment of days and weekends as needed\n\n"}, {"title": "NEMT Driver", "company": "Intulife", "location": "San Diego, CA", "job url": "Not Available", "description": "$40 - $100 a dayContractGreat opportunity to make extra money for those who have Sheriff ID, once approved you will be called to fulfill our work orders as they come.Job Type: ContractSalary: $40.00 to $100.00 /dayExperience:driving: 1 year (Preferred)"}, {"title": "PARTS DRIVER", "company": "Frank Subaru", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=ee8261e2547b9a2c&from=vj&pos=top", "description": "Desired: Clean Driving RecordManual Transmission ExperienceBilingualFrank Motors Group been calling San Diego home for over 100 years, one of the oldest continuously operated family businesses in our area. It's a story of hard work, perseverance and caring for the community. We recognize top talent and believe in promoting from within & advancement across the entire group. Almost 10% of our employees have been with us for over 20 years!\n\nOur busy parts department is growing & we need driven individuals to join the team.\n\nWe Offer:\n\nCompetitive Compensation Packages\nMentorship and coaching\nExcellent Opportunities for Career Growth\nOngoing training\n401k\nFull insurance\n\nResponsibilities:\n\nSafely deliver auto parts to body shops and repair shops\nCarefully load parts truck with outgoing deliveries\nPick up returns from shops and document for credit\nCollect payments from shops\nMaintain positive relationships with the shops you deliver to\nKeep parts truck clean and free from damages\nPerform other various tasks as needed for the department\n\nQualifications:\n\nCandidate must have clean driving record and must be able to pass pre-employment drug screen\nPotential candidate must have strong work ethic\nMust be able to drive a manual transmission\nAuto parts knowledge and experience preferred but not required\nMust be able to communicate in English (Bi-Lingual a plus)\nMust follow directions, but also be able to work independently at times\n\n"}, {"title": "Driver for kids", "company": "ZUM", "location": "San Diego, CA", "job url": "Not Available", "description": "$16 - $32 an hourPart-timeBe a Driver for the fastest growing ride service for kids!Monday through Friday mornings and mid day drivers needed.Must be 21 years or older, complete a criminal back ground check and a DMV history check, drive a 2006 or newer vehicle with 4 doors, have experience with kids.Take advantage of our sign on bonus up to $500Please click on the link below to begin your application process and schedule your in-person session with our On-Board Specialist.https://www.fountain.com/zum/apply/san-diego-escondido-san-diego-county?utm_source=BA&utm_campaign=Michelle*Having trouble with the link?...you may also need to cut and paste it into your browser bar.Job Types: Full-time, Part-timeSalary: $16.00 to $32.00 /hourExperience:Driving: 2 years (Required)License:CA Driver's License (Preferred)Language:English (Required)Work authorization:United States (Required)Shifts:Morning (Preferred)Mid-Day (Preferred)"}, {"title": "Delivery Driver", "company": "SCM", "location": "San Diego, CA", "job url": "Not Available", "description": "$14.00 - $14.95 an hourSAN DIEGOWe need to hire 20+ route drivers ASAP. We have been in business for 30+ years and expanding rapidly. Qualified applicants may be offered a ride along evaluation immediately. Working weekends is required.Requirements:Must be 21 or olderMust have a clean driving recordMust have some delivery experienceMust have experience driving a Cargo VanMust pass the background checkMust pass the drug test.Medical benefits offered after 60 days of employment.You may also contact the hiring team directly at (858) 549-8000.Job Type: Full-timeSalary: $14.00 to $14.95 /hourExperience:delivery driving: 1 year (Required)License:DL Class C (Required)Language:English (Required)"}, {"title": "Shuttle Driver", "company": "Frank Toyota", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=b339c9efcfb85d55&from=vj&pos=top", "description": "Frank Motors Group been calling San Diego home for over 100 years, one of the oldest continuously operated family businesses in our area. It's a story of hard work, perseverance and caring for the community. We recognize top talent and believe in promoting from within & advancement across the entire group. Almost 10% of our employees have been with us for over 20 years.\n\nThis position responsible for supporting delivery of parts, controlling inventory processes in the store & assisting with driving customers to and from dealership.\n\nWe Offer:\n\nCompetitive Compensation Packages\nMentorship and coaching\nExcellent Opportunities for Career Growth\nOngoing training\n401k\nFull insurance\n\nResponsibilities\n\n\nSafely deliver parts to customers as needed\nPick and stage parts for customer orders\nAssist with re-stocking & inventory control\nOversee workflow of vehicles within lot\nAssist customers to and from dealership\n\nQualifications\n\n\nBasic driving and navigation ability\nFriendly communication\nSafety knowledge and skills\nCommunicate effectively\nRead and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals\nPlease no phone calls - a representative from Frank Motors will reach out to you directly to discuss next steps.*\n\n"}, {"title": "Executive/Personal Driver", "company": "Advancing Opportunities", "location": "Washington, DC", "job url": "Not Available", "description": "$18 an hourPart-time$18.00 an hour Reporting to the Branch Manager, the Driver will ensure that all vehicles are presented in the correct manner when parking in ready bays/ delivered to site and that vehicles are cleaned and checked to company standards.Core ResponsibilitiesQuality ControlEnsure that all vehicles are moved when ready, parking in a 'drive out' position, leaving the gear in neutral, heaters turned off with vents closed and a 'ready hanger' present.Ensure that the radio is turned off and the volume is low for when the customer uses this.Ensure that the water & oil levels etc are checked and adjusted if so required.Ensure Tyres are checked for damage, wear and that they are correctly inflated.MiscellaneousEnsure all vehicles are left locked when unattended. Keys should be kept in a secure place at all times.Assist in the delivery and collection of vehicles at your manager's request or aid in any ad-hoc duties required on branch.Ensure full professional uniform is worn at all times.Ensure any lost property items found in vehicles are handed over via the relevant process.Report any potential issues within the garage area that may lead to dangerous Health and Safety problems.Report any damage to vehicles to the Branch Manager or branch staffEnsure that paperwork is filled in full and correctly as instructed by branch staffJob Types: Full-time, Part-timeSalary: $18.00 /hourExperience:commercial driving: 1 year (Preferred)Driving: 2 years (Preferred)License:Driver's License (Preferred)CDL Class A or B (Preferred)"}, {"title": "Advanced Driver Assistance Systems (ADAS) Test Operator", "company": "Tesla", "location": "Atlanta, GA", "job url": "https://www.indeed.com/rc/clk?jk=97d5b6ae4f1b4d55&from=vj&pos=top", "description": "We are looking for a highly motivated individual to accelerate our vehicle-level testing for autonomous vehicles. The Advanced Driver Assistance Systems (ADAS) Test Operator will help drive Teslas Autopilot by testing daily Autopilot firmware updates on a local, predetermined route, to allow tracking of improvements across firmware revisions. The role requires someone highly organized, objectively-focused when making judgements, and confident in their ability to manage their own daily routine.\nThis role could require the flexibility of traveling to domestic and international destinations as necessary, to test vehicles on public roads, test tracks and Proving Grounds.\nThe position is based out of Austin, TX and will be based on a standard Mon-Fri week.\nResponsibilities\nDrive a local pre-determined test route daily with the same vehicle to record data for, and provide subjective feedback on, the performance of daily Autopilot firmware updates.\nStart/Stop recording devices, and do minor equipment/software debugging when necessary.\nDo minor vehicle debugging and document issues with TIRs when necessary.\nAnalyze data collected during testing to sanity check it before handing to engineers, and make recommendations to the internal design teams based on subjective and objective findings.\nWrite daily End-of-Shift (EOS) email detailing observations and issues for engineers to follow up on.\nBe on-call for questions and requests from engineers on specific occurrences.\nCheck vehicle is in proper and safe working order every day, and if not, notify team for repair.\nRequirements\nClean driving record and safe driving habits.\nExcellent attention to detail and highly observational.\nExcellent written and spoken English.\nExcellent PC skills, particularly MS Office (Word, Outlook, Excel), navigating hard drives, making data transfers and checking data.\nGood navigational skills.\nFamiliarity with ADAS/Autopilot systems and their sensors is preferred.\nBasic knowledge of vehicle systems and how they work, such as brakes and power assisted steering, is preferred.\nMust be comfortable driving prototype vehicles that may lack safety features such as airbags, or contain safety risks such as un-validated-firmware, on public roads.\nAbility to multi-task, prioritize and work in an extremely fast-paced environment.\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Route Driver", "company": "IdeliverUSA", "location": "Fallbrook, CA", "job url": "Not Available", "description": "$1,000 - $1,250 a weekPackage Delivery Contractors needed. Our facility is located on Miramar Road andwe are currently Seeking individuals who possibly live and/or are familiar with:FallbrookThis is a 1099 position and no benefits are included with the contract.The position requires a cargo van or bigger . We also have lease program available for vehiclesWe deliver packages for Amazon, , Staples and Google and many other companies. We do have routes that are primarily residential and our on-call routes are typically just for residential and small packages though being able to life 50 lb boxes over and over is necessary for permanent route drivers. Closest comparison to the job description would be that of a UPS or FedEx Driver.Qualifications for the position are:You must have delivery experience21+ with a valid drivers licenseYou will be subject to a background check, No criminal history of theft, breach of trust etc.Clean Driving Record .Helpful skills include:Ability to use GPS effectivelyFamiliar route planner apps for smart phonesGood customer service skillsAbility to think on your feet and overcome obstacles (not every delivery is a drop at the door)Job Type: Full-timeSalary: $1000 to $ 1,250.00/weekJob Location:Bonsall / Fallbrook CaRequired experience:Delivery Driver: 1 yearSasha 858-226-3742Area ManagerJob Type: Full-time"}, {"title": "RAMP AGENT F/T", "company": "Delta Air Lines Global Services", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=5bb4be0e68abd19f&from=vj&pos=top", "description": "RAMP AGENT F/T - DELTA $12.00\n(Job Number: 01DJA)\n\nPosition Summary :\n\nUnder the supervision of the lead agent and/or supervisor on duty, Ramp Agents are responsible for marshalling aircraft in and out of the gate, loading, unloading and sorting freight, mail and baggage in a safe manner while also achieving on-time departures and arrivals. Ramp Agents may also be responsible for servicing aircraft lavatories, cleaning aircraft, restocking items, deicing and other duties as delegated.\n\nEssential Functions:\nMarshalls aircraft on the ramp including directing, assisting and parking all arriving, departing and towed aircrafts in accordance with safety policy and procedures.\nPerforms wing walker duties to protect the aircraft wing from equipment in the path of pushback and maintains visual contact with the pushback driver to alert the driver of any danger.\nLifts, loads/unloads, sorts and transfers passenger baggage, airmail, freight and company material in and out of aircraft bins, belt loader or baggage carts in a safe manner and within specific time constraints.\nMaintains safety and security of the ramp at all times and complies with safety procedures and station policies.\nReads and verifies the city and flight number for every bag to ensure correct loading of customer bags.\nCommunicates with Operations, Flight Crew personnel and other ground personnel concerning arrival/departure information in a professional manner.\nDrives/operates ramp equipment, including but not limited to bag tugs, belt loaders, aircraft tow tractors and water and lavatory servicing vehicles in a safe manner.\nServices aircraft as needed to include cleaning lavatories and cabin and restocking items.\nArrives to work on time and at assigned post to ensure prompt servicing of the aircraft and on time departures.\nMay work in the baggage make-up area and prioritize baggage load for delivery to the proper aircraft for loading.\nEnsures GSE equipment is in proper working order.\nOther duties as assigned.\n\nThis description is intended to provide guidelines for job expectations and the employee's ability to perform the position described. It is not intended to be construed as an exhaustive list of all functions, responsibilities, skills and abilities. Particular functions, tasks and requirements may vary or be added depending upon the location and operational requirements. The text on this site does not represent a contract of employment and the company reserves the right to change this job description and/or assign tasks for the employee to perform, as the Company may deem appropriate.\n\nDAL Global Services is an Equal Opportunity Employer Minorities/Females/Protected Vets/Disabled\n\n\nPrimary Location United States of America-California-San Diego\nStarting Hourly Rate 12.00"}, {"title": "Driver", "company": "Columbia University", "location": "New York, NY", "job url": "https://www.indeed.com/rc/clk?jk=a0139a58efe1a82f&from=vj&pos=top", "description": "$719 a weekDesired: Driver's LicenseReporting to the Manager for processing and distribution, the Driver-Mail Clerk will be responsible for the sorting, distribution and pick up of campus and USPS mail throughout the university in accordance with established procedures. All delivery or pick up will be accomplished on foot or vehicle as designated by the manager. Carriers will find sort routes for delivery or drop off prepared routes in specified locations. Candidates should be in reasonable physical condition. A degree of physical exertion in the delivery of mail bags, postal trays, boxed mail, catalogs, parcel packages or computer print out will be required. The Driver-Mail Clerk may be required to obtain signatures for the delivery of certified registered or valuable mail. The Driver-Mail Clerk is not limited to any specified routes and will be expected to back up other carriers during vacation or short staffing periods. Miscellaneous related duties as assigned by manager.\n\nMinimum Qualifications for Grade\nApplicant MUST meet these minimum qualifications to be considered an applicant\n\nHigh school diploma and/or the equivalent and ability to read and write English are required. Some physical exertion in the loading or delivery of parcels packages or boxed mail will be required.\n\nAdditional Position-Specific Minimum Qualifications\nApplicant MUST meet these minimum qualifications to be considered an applicant\n\nMust have valid NY State Drivers License. Must be able to work overtime and various shifts as needed.\n\nSpecial Instructions\n\nPreferred Qualifications\n\nDetailed knowledge of campus preferred. Candidate with initiative, strong sense of diplomacy and good judgment preferred. The preferred candidate will be dependable, flexible and possess a mechanical aptitude. Ability to work under pressure to meet deadlines strongly desired.\n\nEssential Functions\n\nAdditional Essential Functions (Limit to 3950 characters.)\n\nSpecial Indications\n\nThis position works with:\nHIPAA Compliance training required\n\nNo Response\n\nParticipation in Medical Surveillance required\n\nNo Response\n\nWhat type of posting? Is this a waiver request?\n\nStandard Posting\n\nRequisition Open Date\n\n11-12-2018\n\nRequisition Close Date\n\nQuick Link\n\njobs.columbia.edu/applicants/Central?quickFind=173091"}, {"title": "Courier Driver", "company": "Greenwalt Delivery Service", "location": "Carlsbad, CA 92008", "job url": "Not Available", "description": "$12 an hourEnsures customers' satisfaction by making pick-ups and deliveries in a proficient and timely manner. This position reports directly to the Site Manager, Site Supervisor or Assistant Site Manager, depending on site personnel configuration.Keeps log of items received and delivered.Obtains receipts or payment for articles delivered.Services vehicle driven, such as checking fluid levels and replenishing fuel.Performs pick-up and delivery of jobs by accurately following a map and/or written instructions.Presents professional appearance to clients by dressing in professional attire according to company standards.Responsible for vehicle safety by maintaining routine maintenance on all delivery vehicles (oil change, tire rotation, etc.) according to company specifications.Meets company attendance standards by reporting to work punctually and working all scheduled hours and any required overtime.Performs other duties as assigned.Monday to Friday 3pm to 11pm shiftCompany Cargo VanJob Type: Full-timeSalary: $12.00 /hour"}, {"title": "Amazon Delivery Driver", "company": "Furaat Inc", "location": "San Diego, CA 92108", "job url": "Not Available", "description": "$13.50 an hourDesired: Clean Driving RecordDriver's LicenseReliable, hard working, Go-getter Delivery Associates Wanted! START RATE: $13.50P/HFURAAT Transport is looking for AMAZING Delivery Associates to join our team! We service Rancho Bernardo. We are having an Open House in TWO locations and invite you to come in for an interview!Location: 3443 Camino Del Rio South, #207, San Diego, CA 92108Monday - Saturday: 12am - 6pmWhat to bring: 1. Your resume, SS card, and DL2. A friend that also wants to join our team! (and get a referral bonus$$$)Furaat Transport s seeking energetic, reliable, hardworking delivery drivers to join our delivery associate elite team!Our delivery associates help us fulfill Amazon orders by delivering packages to their customers.At Furaat Transport our focus is on training and keeping our drivers engaged as an important part of our company & culture through continuous feedback, recognition rewards, and bonuses just to mention a few.There are many more reasons to join FURAAT Transport but here are the TOP THREE!Growth Opportunities: For those employees that are go-getters and ambitious, they will have opportunities to move up the ladder through internal promotions with the accompanying salary increases (delivery associate to Dispatcher to Supervisor to Management) *  * Accessibility to Senior Management: We stringently practice open door policy - owners are always present to provide support and guidance to all of our employeesBenefits: All employees are offered an Alternative Workweek schedule (4/10 workweeks), paid sick time, vacation after one year of continuous employment, and more.Responsibilities:Load van accurately and safely for customer deliveriesDeliver products accurately and safely to customer locations in a timely mannerCollect on unpaid orders and shipmentsInspect and monitor delivery vehicleConduct self in a professional and ethical manner at all times. Treat external and internal customers and associates with courtesy and respectMaintain accurate inventory of packages and materialsPerform other responsibilities as directedQualifications:Must be at least 21 years of agePossess a valid driver license and a clean driving recordMust be able to work four 10-hour shifts per weekVerify competency in critical skill areas for the specific driving positionMust be organized with the ability to work well under pressure, including under changing priorities and in different locationsStrong ability to successfully meet set deadlinesMust be able to consistently handle very high-volume routes each shift, in a fast-paced environmentPhysical Requirements:While performing the duties of this job, the employee is regularly required to stand; walk; use hands and arms to finger, handle, feel, or carry; reach with hands and arms. The employee is occasionally required to sit; climb or balance or stoop; kneel, crouch, or crawl. The employee is regularly required to lift up to 10 lbs. and up to 25 lbs. The employee is frequently required to lift up to 50 lbs. Must be able to safely tolerate heat in the summer.Pre-Employment Requirements:All candidates who are offered employment must successfully pass a background check and pre-employment drug test and DMV verifications.Job Type: Full-time, four days a week WITH 3 days off$13.50/hour at Rancho BernardoJob Type: Full-timeSalary: $13.50 /hour"}, {"title": "Test Operator", "company": "Tesla", "location": "Fremont, CA", "job url": "https://www.indeed.com/rc/clk?jk=710702ad370a8177&from=vj&pos=top", "description": "We are looking for a highly motivated individual to accelerate our vehicle-level testing for autonomous vehicles. The Advanced Driver Assistance Systems (ADAS) Test Operator will help drive Teslas Autopilot by testing daily Autopilot firmware updates on a local, predetermined route, to allow tracking of improvements across firmware revisions. The role requires someone highly organized, objectively-focused when making judgements, and confident in their ability to manage their own daily routine.\nThis role could require the flexibility of traveling to domestic and international destinations as necessary, to test vehicles on public roads, test tracks and Proving Grounds.\nResponsibilities\nDrive a local pre-determined test route daily with the same vehicle to record data for, and provide subjective feedback on, the performance of daily Autopilot firmware updates.\nStart/Stop recording devices, and do minor equipment/software debugging when necessary.\nDo minor vehicle debugging and document issues with TIRs when necessary.\nAnalyze data collected during testing to sanity check it before handing to engineers, and make recommendations to the internal design teams based on subjective and objective findings.\nWrite daily End-of-Shift (EOS) email detailing observations and issues for engineers to follow up on.\nBe on-call for questions and requests from engineers on specific occurrences.\nCheck vehicle is in proper and safe working order every day, and if not, notify team for repair.\nRequirements\nClean driving record and safe driving habits.\nExcellent attention to detail and highly observational.\nExcellent written and spoken English.\nExcellent PC skills, particularly MS Office (Word, Outlook, Excel), navigating hard drives, making data transfers and checking data.\nGood navigational skills.\nFamiliarity with ADAS/Autopilot systems and their sensors is preferred.\nBasic knowledge of vehicle systems and how they work, such as brakes and power assisted steering, is preferred.\nMust be comfortable driving prototype vehicles with non-production firmware\nAbility to multi-task, prioritize and work in an extremely fast-paced environment.\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Amazon Deliver Driver", "company": "Courier Distribution Systems (CDS)", "location": "San Diego, CA", "job url": "Not Available", "description": "$14 an hourFIRST AND FOREMOST!! THIS JOB IS LOCATED AT 16550 Via Esprillo San Diego CA 92127. THE REASON FOR THE BOLD HEADLINE IS TO CATCH YOU ATTENTION THAT WE AS A COMPANY IS OUT-SOURCING TO SURROUNDING MAJOR CITIES AROUND OUR LOCATION OF WORK, IN HOPES TO GET MORE CANDIDATES FOR OUR MASSIVELY GROWING PEAK SEASON. PLEASE DO NOT APPLY IF THE REQUIREMENTS BELOW DO NOT MEET THE STANDARDS. THANK YOU!Valid drivers licenseClean Driving Record (No suspensions in the last three years, no more than 2 points)Ability to Pass a Background and Drug Screening (We go back seven years to date)Availability to Work WeekendsAbility to Read GPS mapHigh School Diploma or EquivalentMust be at least 23 years old to be Covered by our Auto InsuranceA Great Attitude when dealing with Coworkers and CustomersAbility to Drive a Full-Size Cargo vanLift upwards to 50lbsWalking 25,000 steps minimum a day. In and out of a van 150 to 250 times in a dayDescription: As a delivery driver for CDS, youll be delivering to residents and businesses around the greater San Diego area for one of the worlds most iconic brand. Each morning, we provide all the tools youll need for the day: a company van, a device to log your packages, a dispatcher to assist you as necessary throughout the day, and the boxes themselves!Schedule: This job is a four day on, and three days off a work week delivery job, each week, you will have a stable schedule to where your days are designed to be 10  hours long, including a 30-minute lunch break and two 15-minute paid breaks. However, because most of your day is spent driving and delivering, you are going to be your boss on the roadCompensation: For your compensation, we offer you $14.00hr, as well as overtime pay after 8 hours for $21.00hr! However, you are still required to work a 10  hour schedule for your scheduled days of work and will receive a mandatory overtime every single day. To add all this up, our average drivers make around $770.00 on the low to the high of $1100 in a week before taxes.BenefitsThe position includes paid time off and dental, health, and vision insurance eligibility after 60 days. If you want to sign up for them, they are not required.Room to Grow: CDS promote almost exclusively from within and has multiple administrative positions in your location that you can transition into if you choose to pursue such a goal.What We Will Ask of You The Most:Attendance: It is essential that you show up on time to fulfill your scheduled shifts consistently. We have a strict attendance policy and expect that you abide by it.Performance: You will receive paid training and continual support to grow as a delivery driver and make the most out of your time.Attitude: Youll need to bring a can-do optimistic outlook, and maintain a pleasant, professional demeanor with our clients and their customers.Job Type: Full-timeSalary: $14.00 /hour"}, {"title": "Driver Associate", "company": "Furaat Inc", "location": "San Diego, CA 92108", "job url": "Not Available", "description": "$13.50 an hourJob DescriptionReliable, hard working, Go-getter Delivery Associates Wanted! START RATE: $13.50/HrFURAAT Transport is looking for AMAZING Delivery Associates to join our team! We service Rancho Bernardo. We are having an Open House in TWO locations and invite you to come in for an interview!Location: 3443 Camino Del Rio South, #207, San Diego, CA 92108Monday - Saturday: 12am - 6pmWhat to bring: 1. Your resume, SS card, and DL2. A friend that also wants to join our team! (and get a referral bonus$$$)Furaat Transport s seeking energetic, reliable, hardworking delivery drivers to join our delivery associate elite team!Our delivery associates help us fulfill Amazon orders by delivering packages to their customers.At Furaat Transport our focus is on training and keeping our drivers engaged as an important part of our company & culture through continuous feedback, recognition rewards, and bonuses just to mention a few.There are many more reasons to join FURAAT Transport but here are the TOP THREE!Growth Opportunities: For those employees that are go-getters and ambitious, they will have opportunities to move up the ladder through internal promotions with the accompanying salary increases (delivery associate to Dispatcher to Supervisor to Management) *  * Accessibility to Senior Management: We stringently practice open door policy - owners are always present to provide support and guidance to all of our employeesBenefits: All employees are offered an Alternative Workweek schedule (4/10 workweeks), paid sick time, vacation after one year of continuous employment, and more.Responsibilities:Load van accurately and safely for customer deliveriesDeliver products accurately and safely to customer locations in a timely mannerCollect on unpaid orders and shipmentsInspect and monitor delivery vehicleConduct self in a professional and ethical manner at all times. Treat external and internal customers and associates with courtesy and respectMaintain accurate inventory of packages and materialsPerform other responsibilities as directedQualifications:Must be at least 21 years of agePossess a valid driver license and a clean driving recordMust be able to work four 10-hour shifts per weekVerify competency in critical skill areas for the specific driving positionMust be organized with the ability to work well under pressure, including under changing priorities and in different locationsStrong ability to successfully meet set deadlinesMust be able to consistently handle very high-volume routes each shift, in a fast-paced environmentPhysical Requirements:While performing the duties of this job, the employee is regularly required to stand; walk; use hands and arms to finger, handle, feel, or carry; reach with hands and arms. The employee is occasionally required to sit; climb or balance or stoop; kneel, crouch, or crawl. The employee is regularly required to lift up to 10 lbs. and up to 25 lbs. The employee is frequently required to lift up to 50 lbs. Must be able to safely tolerate heat in the summer.Pre-Employment Requirements:All candidates who are offered employment must successfully pass a background check and pre-employment drug test and DMV Verification.Job Type: Full-time, four days a week WITH 3 days off$13.50/hour at Rancho BernardoJob Type: Full-timeSalary: $13.50 /hourJob Type: Full-timeSalary: $13.50 /hourExperience:Driving: 2 years (Required)License:Driver's License (Required)CDL Class A or B (Preferred)"}, {"title": "Driver/Courier", "company": "Quest Diagnostics", "location": "Anaheim, CA", "job url": "https://www.indeed.com/rc/clk?jk=27e33f3278315971&from=vj&pos=top", "description": "Desired: Driving ExperienceDriver's LicenseCustomer ServiceSchedule: M-W-TH-F 3:00pm to 11:30pm, Saturdday 3:00pm - 1130pm\nSummary:\nThe Route Service Representative (RSR) is the face of Quest Diagnostics to the public, our customers and acts as an Ambassador for the company in everything he/she does. Everyday Excellence is a critical component in fulfilling this position requirement. This position performs day to day route operations by serving client needs with regard to properly tracking, sorting, storing and transporting patient specimens and other materials including but not limited to supplies and patient results.\n\n\nBasic Purpose:\nThe RSR is assigned up to a maximum of two (2) routes which may include:, Routine Route, STAT Route, Weekend Routes or Shuttle/Relay Route; Safely operates company vehicle to pick up, properly store and deliver specimens and other materials; and provides service to internal and external customers in an organized, efficient, and professional manner.\n\n\nDuties and Responsibilities:\n1. Responsible for compliance with all processes including and not limited to: timekeeping, attendance and punctuality, vehicle safety and cleanliness, safety and OSHA requirements, handheld /scanning device and usage, proper handling and storage of all samples from the client office to the drop off point, proper packing of specimens for shipment, end of day vehicle checks, dress code, code of conduct and all Company / Regional / Logistics policies and procedures.\n2. Responsible for the safe and timely transportation of specimens, supplies, reports, equipment and materials to the appropriate destination.\n3. Responsible for operating company vehicle safely as well as maintaining a valid drivers license and driving record within acceptable company guidelines.\n4. Ensure route is started with proper equipment tools. i.e., route scanner sync/paper logs, carry bag, properly prepared coolers for 3 separate thermal storage, dry ice, cell phone, keys, door hangers, observation reports, etc.\n5. Follow route as scheduled/sequenced while allowing for will-call stops and special pickups.\n6. Maintain specimen integrity at all times, including the utilization of specimen carry bag to transport specimens from client office/lock box to vehicle by temperature.\n7. Follow all scan/documentation requirements including but not limited to tissue/irreplaceable and frozen tracking processes.\n8. Place Door Hanger for will-call clients with no specimens out. Place Door Hanger for Daily clients who regularly provide specimens but none are available at scheduled pick up. The RSR is required to notify their Supervisor and/or Team Leader of service issue for a next morning follow up.\n9. Communicate with Dispatch before leaving an area to ensure will-calls have been cleared.\n10. Keep route information, sequencing and all client notes up to date.\n11. Attendance and punctuality in meetings and training sessions.\n12. Meet all training requirements in a timely manner as assigned.\n13. Properly care for and maintain company equipment including scanners, telephones, vehicles etc... Communicate any deficiencies with equipment.\n14. Document and provide appropriate client satisfaction information to Logistics Management.\n15. Maintain professionalism and a service orientation with clients using Everyday Excellence and the Five Guiding Principles.\n16. Demonstrate Everyday Excellence in the Quest Behaviors; Agility, Customer Focus, Transparency, United as One Team and Performance Oriented.\n17. Other duties as defined by Logistics Management.\n\nCompetencies for Success:\n\nEveryday Excellence\nBehaviors\nEthics and Values\nCustomer Focus\nPersonal and Interpersonal Skills\nI am customer focused\nIntegrity and Trust\nAct with a Sense of Urgency/ Importance\nApproachability\nI am service driven\nSincerity\nProblem Solving\nComposure\nI am a professional\nHonesty\nDecision Quality\nListening\nI care about quality.\nRespect\nPatience\nI am knowledgeable\nHumor\n\nDemonstrates the ability to quickly find common ground and solve problems for the good of all; can represent his/her own interests and yet be fair to other groups; can solve problems with peers with a minimum of noise; is seen as a team player and is cooperative; easily gains trust and support of peers; encourages collaboration. Demonstrate and model the Everyday Excellence behaviors.\n\nQualifications:\n\nEducation Requirement:\n\nHigh school diploma/GED strongly preferred, or commensurate work experience required.\n\nWork Experience:\n\n1 year of experience in a customer service, logistics, or delivery related job strongly preferred. General computer knowledge preferred. Experience with handheld scanner equipment preferred.\n\nLicensure Requirement:\n\nValid Drivers license with a minimum of 1 year driving experience and documentation of a Motor Vehicle Record with < three moving violation convictions within the previous 36-month period.\n\nOther:\n\nFocus on the Customer: Acts with the customer/patient in mind. Develops relationships with customers. Communicates openly and transparently: Uses diplomacy and tact with all interactions.\n\nMental/Physical:\n\nExtensive use of phone and hand held device (PC)\nProlonged standing/sitting/walking/driving\nFine dexterity with hands/steadiness\nAble to lift up to 25 pounds; may occasionally need to lift 40 pounds; carrying up to 15 pounds for several minutes at a time\nAbility to communicate effectively in English with clients, supervisors and peers\nVision-requires constant mental visual attention to details as well as ability to see well in limited light scenarios\nBalancing\nBending/kneeling\nPushing/pulling\nReaching/twisting"}, {"title": "Shuttle Driver", "company": "Frank Toyota", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=b339c9efcfb85d55&from=vj&pos=top", "description": "Frank Motors Group been calling San Diego home for over 100 years, one of the oldest continuously operated family businesses in our area. It's a story of hard work, perseverance and caring for the community. We recognize top talent and believe in promoting from within & advancement across the entire group. Almost 10% of our employees have been with us for over 20 years.\n\nThis position responsible for supporting delivery of parts, controlling inventory processes in the store & assisting with driving customers to and from dealership.\n\nWe Offer:\n\nCompetitive Compensation Packages\nMentorship and coaching\nExcellent Opportunities for Career Growth\nOngoing training\n401k\nFull insurance\n\nResponsibilities\n\n\nSafely deliver parts to customers as needed\nPick and stage parts for customer orders\nAssist with re-stocking & inventory control\nOversee workflow of vehicles within lot\nAssist customers to and from dealership\n\nQualifications\n\n\nBasic driving and navigation ability\nFriendly communication\nSafety knowledge and skills\nCommunicate effectively\nRead and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals\nPlease no phone calls - a representative from Frank Motors will reach out to you directly to discuss next steps.*\n\n"}, {"title": "Professional Full Time Driver", "company": "BJ Industries, Inc.", "location": "Oceanside, CA 92058", "job url": "https://www.indeed.com/rc/clk?jk=ecce0478535c7e26&from=vj&pos=top", "description": "$150 a dayDescription\n\nWork Mon - Fri. There may be an opportunity to work on Saturdays.\nArrive at terminal at an hour that guarantees daily success.\nOrganize and load vehicle. Prepare map if necessary.\nDeliver and pickup packages on designated route.\nAll pickups completed during pickup windows.\nCommunicate with management regarding truck maintenance, route volume.\nInteract with shippers and recipients in a professional, polite manner.\nMaintain a professional appearance. Keep vehicle interior clean.\nKeep safety and excellence at the forefront of everything.\nDriver Qualifications\n\nBe 21 years of age or older, have a clean driving record, pass a drug screen (this includes marijuana), background check (no misdemeanors or felonies), DOT physical, and have one year of qualified driving experience in the last 3 years (driving a 15ft truck or bigger).\nBe able to get along with others in a professional and courteous way.\nBe in good physical condition OR be willing to get in good shape! This is a physical job!! You must be able to lift up to 150 lbs.\nAble and willing to read a map.\nReliable. If you like to call in sick this is not the job for you.\nOrganized. Organizing your truck is a key for having a successful day on the road.\nSelf-motivator. If you are not, you will not be successful in this job. We do not micro-manage. You are expected to come in and get your work done without being coddled.\nProfessional Driver will earn at least $150.00/day\n\nWe look forward to hearing from you!"}, {"title": "Scout Car Driver", "company": "Solid Solutions 24/7 Inc.", "location": "La Mesa, CA 91942", "job url": "https://www.indeed.com/rc/clk?jk=3eb1fa5b1a8665e1&from=vj&pos=top", "description": "$24,000 - $40,000 a yearPart-time, CommissionWe are looking for a Scout Car Driver to join our team! Scout drivers are a key component to locating units for our repossession agents. This position is a great for anyone who enjoys driving and has a hunting mentality. It is also an ideal start for anyone with a desire to be a repossession agent.\n\nSolid Solutions 24/7 Inc.\nWhy Work Here?\n\nSolid Solutions 24/7 Inc. is one of the largest repossession companies in California. We operate and manage 6 locations throughout the entire state as we are rapidly and constantly expanding our territories. We pride ourselves in maintaining a professional reputation with our clients and staff to ensure satisfaction. We pride ourselves in providing our employees Kaiser Medical, 401k Retirement options, and a career path with job security. Our company utilizes state of the art technology to aid in successful recovery of units with ease and peace of mind.\nTraining:\n\nNew hires will receive PAID training with our team of highly experienced staff. Training will consist of camera car operations, computer software, general paperwork, and all applicable laws and regulations.\nResponsibilities:\nAdvise and follow-up with dispatch team and repossessors\nSafely drive a spotter vehicle utilizing our company provided vehicles and technology\nFollow company and state laws and procedures\nKeep records and status of updates in customer's account via various software platforms\nCompensation:\n$11.50/hr + $25 Commission per located AND recovered unit\nUNCAPPED Earning Potential\n\nMost Scout car drivers can expect to earn between $24k - $40k a year to start. However, earning potential depends on individual performance. Our best scout car drivers have earned in excess of $60k year.\nBenefits:\n\nKaiser Health Benefits (After 90 Days)\n401k Retirement plan option (After 90 Days)\nOngoing Training and Resources\n24 Hours of Annual Sick Leave\nFull-time & Part-time positions available\nExperience:\n\nScout Car Driver: 1 year preferred, but not required.\nLicense or Certification:\n\nCurrent Driver License/ Clean MVR (Required)\n\nQualifications:\nClean MVR (Motor Vehicle Record)\nCurrent Drivers license\nNeat and clean appearance\nMust be at least 23 years old (Corporate Insurance Requirement)\nAble to pass pre-employment and random drug testing\nIntermediate computer skills for inputting data into multiple software platforms\nAbility to stay calm under pressure and de-escalate situations\nBe self-motivated and have a strong eagerness to work\nMust be able to work all shifts including weekends.\nAbility to pass background check for purposes of California State Licensing requirements. (California Law does not allow Felonies)\nMust not have any MAJOR traffic violations within the last 3 years (DUI's/Outstanding tickets)\nPrevious experience in driving position is a plus but not required\nExcellent written and verbal communication skills\nAbility to prioritize and multitask\nAbility to build rapport with others"}, {"title": "Driver", "company": "Tomatoes Extraordinaire Inc", "location": "San Diego, CA 92110", "job url": "https://www.indeed.com/rc/clk?jk=ba0899531f90e476&from=vj&pos=top", "description": "Description:\nJob Summary:\nAt Specialty Produce, we offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization and to serve others in a manner that exceeds their expectations.\nThis position will directly interact with our customers by delivering product to their restaurants (timely and accurately), ensuring they are happy with their product and answer any questions they may have or help direct them to someone in our offices that can assist.\n\nThis job must be carried out in compliance with all Specialty Produce Business Conduct and Ethics Standards, policies, and procedures as well as all Federal, State, and Local laws.\n\nGeneral Accountabilities:\n\nPrepares vehicle for operation by inspecting general condition and reports concerns to fleet manager\nLoads truck and ensures that they have all items needed to complete job efficiently and accurately\nDelivers items to customers ensuring they are following company policies and procedures always.\nReviewing orders and adjusting orders (as needed)\nMaintains cleanliness of company delivery vehicles by following the procedure set forth by the organization\nFollows all driver safety laws to ensure you are keeping yourself and the company property safe\nMaintains a good repour with customers always\nAssists customers with any questions/ concerns with their orders\nLearns and keeps up to date on company product\nThe company reserves the right to add or change duties at any time.\n\nRequirements:\nJob Qualifications:\n\nHigh school diploma or equivalent\nExperience: 1-2 years of related experience (preferred)\nValid drivers license with clean driving record\nFlexible schedule (e.g. able to work overtime, weekends, holidays etc.)\nFamiliar with San Diego County (preferred)\nExperience using hand trucks (preferred)\n\nSkills:\n\nCoordination  Adjusting actions in relation to others' actions.\nFast Paced-Will need to be able to work quickly and effectively always.\nTime Management  Must be able to manage time effectively.\nActive Listening  Giving full attention to what other people are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times.\nSpeaking  Talking to others to convey information effectively in English\nJudgment and Decision Making  Considering the relative costs and benefits of potential actions to choose the most appropriate one.\nBasic computer and Basic tablet skills\nMathematical Skills/Ability-Basic math skills (e.g. counting, subtracting, multiplying, etc.)\nCustomer Service Skills- Can communicate information effectively with customers with little to no issues\n\nPhysical Demands:\n\nContinuously pushing, pulling 50lbs +\nContinuously Lifting up to 45lbs and team lift for anything above 45lbs.\nStanding 8 hrs. or more\nWalking 8 hrs. or more\nBending, Stooping, Kneeling 8 hrs. or more\nRepetitive hand/arm movements 8hrs. or more (e.g. pulling, pushing, lifting, driving etc.)\nMust be able to see, hear and talk to perform this job effectively and safely\nFrequent maneuvering in and out of vehicle 8 hrs. or more\n\n"}, {"title": "RAMP AGENT P/T", "company": "Delta Air Lines Global Services", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=128006f8b9727469&from=vj&pos=top", "description": "Part-timeRAMP AGENT P/T - DELTA $12.00\n(Job Number: 01DHW)\n\nPosition Summary :\n\nUnder the supervision of the lead agent and/or supervisor on duty, Ramp Agents are responsible for marshalling aircraft in and out of the gate, loading, unloading and sorting freight, mail and baggage in a safe manner while also achieving on-time departures and arrivals. Ramp Agents may also be responsible for servicing aircraft lavatories, cleaning aircraft, restocking items, deicing and other duties as delegated.\n\nEssential Functions:\nMarshalls aircraft on the ramp including directing, assisting and parking all arriving, departing and towed aircrafts in accordance with safety policy and procedures.\nPerforms wing walker duties to protect the aircraft wing from equipment in the path of pushback and maintains visual contact with the pushback driver to alert the driver of any danger.\nLifts, loads/unloads, sorts and transfers passenger baggage, airmail, freight and company material in and out of aircraft bins, belt loader or baggage carts in a safe manner and within specific time constraints.\nMaintains safety and security of the ramp at all times and complies with safety procedures and station policies.\nReads and verifies the city and flight number for every bag to ensure correct loading of customer bags.\nCommunicates with Operations, Flight Crew personnel and other ground personnel concerning arrival/departure information in a professional manner.\nDrives/operates ramp equipment, including but not limited to bag tugs, belt loaders, aircraft tow tractors and water and lavatory servicing vehicles in a safe manner.\nServices aircraft as needed to include cleaning lavatories and cabin and restocking items.\nArrives to work on time and at assigned post to ensure prompt servicing of the aircraft and on time departures.\nMay work in the baggage make-up area and prioritize baggage load for delivery to the proper aircraft for loading.\nEnsures GSE equipment is in proper working order.\nOther duties as assigned.\n\nThis description is intended to provide guidelines for job expectations and the employee's ability to perform the position described. It is not intended to be construed as an exhaustive list of all functions, responsibilities, skills and abilities. Particular functions, tasks and requirements may vary or be added depending upon the location and operational requirements. The text on this site does not represent a contract of employment and the company reserves the right to change this job description and/or assign tasks for the employee to perform, as the Company may deem appropriate.\n\nDAL Global Services is an Equal Opportunity Employer Minorities/Females/Protected Vets/Disabled\n\n\nPrimary Location United States of America-California-San Diego\nStarting Hourly Rate 12.00"}, {"title": "Personal Driver", "company": "ELK Investors", "location": "New York, NY 10017", "job url": "Not Available", "description": "$40,000 - $50,000 a yearDesired: Customer ServiceLong Island family is looking to hire a full-time driver. The driver should be proficient in his work and must discharge his obligations in a professional manner. He needs to be watchful and safety conscious, professional, expert driver with a proper license, punctual, neat, clean and organized. Previous experience and long term employment with previous employer. References required. Competitive compensation.Job Type: Full-timeSalary: $40,000.00 to $50,000.00 /yearExperience:customer service: 1 year (Preferred)"}, {"title": "Courier Delivery Driver (For Amazon Account)", "company": "Amazing Courier Express Services", "location": "San Diego, CA 92127", "job url": "Not Available", "description": "$14.30 - $16.00 an hourPart-timeJoin the Amazing Courier Express Services Team in a fast-paced environment delivering packages for Amazon. Deliveries are for local routes to residential and business locations. Both full-time and part-time positions pay hourly plus bonus. Drivers will drive our new Amazon branded luxury cargo vans.We are seeking people who are team players (our motto is No driver left behind!!). We need people who are reliable, quick, and ready to work EVERY DAY scheduled!!Idea candidate are:EnergeticCommitted and ready to get the job doneTeam playersSelf startersRequire little supervisionAre FlexibleLove to driveEnjoy interacting/interfacing with peopleSuccessful drivers put safety first and care deeply about customer expectations and satisfaction!!Details: All shifts start approximately at 7am (must be flexible)Full-time (4) 10 hour shiftsPart-time 20-25 hours a weekDriver will be driving our new Amazon branded cargo vansEach driver will be provided a fuel cardRequirements: Must be 21 years oldValid CA driver's license with good driving recordMust be able to pass a thorough background investigation, drug screen and driving record reviewBe willing to load and unload parcels within the route assigned (maximum of 50 lbs.)Professional appearance, you will be in contact with customersDetail-oriented, self-motivated and the ability to work independentlyPlus: Previous Customer Service a plusPrevious delivery experience a plus but not mandatoryPrevious athletic background a plus but not mandatoryPrevious management/leadership a plus but not mandatoryJob Types: Full-time, Part-timeJob Types: Full-time, Part-timeSalary: $14.30 to $16.00 /hourExperience:Customer Service: 1 year (Preferred)Delivery: 1 year (Preferred)License:California (Required)"}, {"title": "Parts Driver", "company": "Frank Toyota", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=19ea8eb020ec1718&from=vj&pos=top", "description": "Frank Motors Group been calling San Diego home for over 100 years, one of the oldest continuously operated family businesses in our area. It's a story of hard work, perseverance and caring for the community. We recognize top talent and believe in promoting from within & advancement across the entire group. Almost 10% of our employees have been with us for over 20 years!\n\nOur busy parts department is growing & we need driven individuals to join the team.\n\nWe Offer:\n\nCompetitive Compensation Packages\nMentorship and coaching\nExcellent Opportunities for Career Growth\nOngoing training\n401k\nFull insurance\n\nResponsibilities:\n\nSafely deliver auto parts to body shops and repair shops\nCarefully load parts truck with outgoing deliveries\nPick up returns from shops and document for credit\nCollect payments from shops\nMaintain positive relationships with the shops you deliver to\nKeep parts truck clean and free from damages\nPerform other various tasks as needed for the department\n\nQualifications:\n\nCandidate must have clean driving record and must be able to pass pre-employment drug screen\nPotential candidate must have strong work ethic\nMust be able to drive a manual transmission\nAuto parts knowledge and experience preferred but not required\nMust be able to communicate in English (Bi-Lingual a plus)\nMust follow directions, but also be able to work independently at times\n\n"}, {"title": "HLE Transporter (Driver)", "company": "Hertz", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=3f0f2d0f0e1e7da3&from=vj&pos=top", "description": "General Responsibilities\nHertz Local Edition is seeking professionals to drive our vehicles to various locations while providing our best in class customer service. As a Transporter you will pick up and drop off customers and deliver vehicles from the Hertz Local addition office to various locations.\n\nThe general responsibilities will include but are not limited to;\nTransports vehicles from Hertz Local Edition offices to various locations.\nWill pick-up and drop-off customers as required.\nMust interface with vendors such as body shops, dealerships, and insurance agents.\nMaintain courteous and professional behavior & appearance.\nFollow all company safety policies and procedures and protect company assets.\nAbility to work with minimal supervision while maintaining high energy.\nMandatory Requirements\nEducational Background:\nHigh School Diploma, GED or Equivalent Experience.\nSkills:\nValid driver's license\nMust be at least 20 years of age\nFlexibility in scheduling which may include night's weekends and holidays\n\nProfessional Experience:\nPrevious experience in a related field.\nPrevious customer service experience.\nSatisfactory driving record.\nEEO Statement\nHertz is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity or expression, marital status or domestic partnership status, disability, protected veteran status or military status, genetic information, or any other category protected under applicable law. Hertz is committed to taking affirmative steps to promote the employment and advancement of minorities, women, persons with disabilities and protected veterans."}, {"title": "Personal Driver/Executive Chuefer", "company": "Commonwealth Motors", "location": "Kuna, ID", "job url": "Not Available", "description": "$3,000 - $4,000 a monthPart-timeDesired: Driver's LicenseCustomer ServiceMicrosoft OfficeWe are a beautiful retirement community is seeking a full-time or part-time Driver with excellent customer service skills to join our team. If you thrive on providing outstanding customer service and superior care to active senior adults, we want to speak with you!Skills/ RequirementsTour guide experience as well as chauffeur experience a plus. Applicant must have proficiency in programs such as Microsoft Office, Email, etc. Professionalism, attention to detail, and customer service and organizational skills required to consistently exceed expectations for our residents.Baseline Qualifications:Drivers License1 years of verifiable Chauffeuring Experience.Must be able to communicate effectivelyWe offer competitive compensation, an excellent benefit package including.We are into Equal Opportunity Employer and values diversity within theworkplace.Job Types: Full-time, Part-timeSalary: $3,000.00 to $4,000.00 /month"}, {"title": "Driver Associate", "company": "Furaat Inc", "location": "San Diego, CA 92108", "job url": "Not Available", "description": "$13.50 an hourDriver Associate - AMAZONWe are currently hiring for Full-time AMAZON Delivery Associates in two of our Amazon Hub locations.If you enjoy working in a fast-paced working environment with potential advancement opportunities, our Driver Associate position may be the perfect fit for you.An IDEAL CANDIDATE must possess:Excellent COMMUNICATION Skills - Can communicate effectively with our dispatch team of any issues during shiftPOSITIVE attitude with a sense of urgency and willingness to help othersPHYSICAL ENDURANCE to withstand physical activity throughout the entire shiftFLEXIBLE schedule as we operate 7 days a weekSELF-MOTIVATED to grow and developCompensation and Benefits:Based on ExperienceStarting Salary $13.50/HrPotential Increase in Pay after 30 and 90 DaysAfter 90 Days may be eligible for Medical, Dental, and Vision InsuranceWORK SCHEDULE:Open Availability4 Days x 10 Hr Shifts (7:00AM - 6:00PM PST)3 X Days Off***One Saturday Shift Required***High School Diploma/GEDGood Driving RecordUndergo Drug Test and Background Check23 years of age or olderActive Lifestyle***Preferred*** Professional Driving ExperienceJob Type: Full-timeSalary: $13.50 /hourExperience:commercial driving: 1 year (Preferred)Driving: 2 years (Preferred)License:CDL Class A or B (Preferred)"}, {"title": "Amazon", "company": "Letter Ride LLC", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=f744d6906a92b825&from=vj&pos=top", "description": "We are currently hiring for Delivery Drivers in Rancho Bernardo, CA\nIf youre looking for a fast-paced working environment with potential advancement possibilities, then were looking forward to you joining our TEAM.\n\nIdeal candidates would have:\nGreat communication skills - Sense of urgency and willingness to help others\nAble to withstand consistent physical activity throughout the entire shift\nFlexible schedule: we operate 7 days a week\nStrong work ethic and dependability\nTeam Player with positive attitude\nBusiness driven  We want our employees to have a sense of pride and strive for personal as well as company growth. Our current management staff has been exclusively assembled from within.\nRequirements:\n23 years of age or older\nPass a background and drug test\nClean driving record\nAbility to lift a minimum of 50 lbs.\nOperate a large cargo van\nWork in various weather conditions.\nNo delivery experience required, but its definitely welcomed\nEssential duties and Responsibilities:\nLoad the van accurately and safely for deliveries.\nDeliver packages to customers residences or businesses\nAble to finish their own route within a 10hr shift\nRescue other drivers when needed.\nPerform all duties to department standard and/or as directed by leadership.\nMust adhere to regulatory, department and company policies.\nPerform all job duties in a safe and responsible manner.\nPerform other job related and compatible duties as assigned.\nCompany offers:\n4 days 10-hour shifts\nMedical, Dental and Vision benefits\n401k plan\nPaid sick leave\nDirect deposit\nFlexible Schedule\n\nThank you and we hope to hear from you soon!\n\nLetter Ride LLC."}, {"title": "Tow Truck Driver", "company": "Towing", "location": "Escondido, CA", "job url": "Not Available", "description": "$2,500 - $4,500 a monthNo experience is necessary, but preferred. Full time position available. Shifts include nights, weekends and/or holidays.Candidates must possess the following skills and be able to perform the following tasks:Valid California driver's license and clean DMV record.The ability to communicate with the public and law enforcement in a professional manner.Be on time and efficient.Be able to load/unload vehicles on/off towing equipment (ability to lift 50 lbs minimum).Be available to work weekends, evenings and holidays.Must be 21 years of age and olderWe are looking for someone who is self motivated, energetic and able to work without direct supervision.Pay is based on experience level. Paid Bi-Weekly.Job Type: Full-timeSalary: $2,500.00 to $4,500.00 /monthJob Type: Full-timeSalary: $2,500.00 to $4,500.00 /monthExperience:Towing: 1 year (Preferred)License:Driver License (Preferred)"}, {"title": "Driver", "company": "Tomatoes Extraordinaire Inc", "location": "San Diego, CA 92110", "job url": "https://www.indeed.com/rc/clk?jk=ba0899531f90e476&from=vj&pos=top", "description": "Description:\nJob Summary:\nAt Specialty Produce, we offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization and to serve others in a manner that exceeds their expectations.\nThis position will directly interact with our customers by delivering product to their restaurants (timely and accurately), ensuring they are happy with their product and answer any questions they may have or help direct them to someone in our offices that can assist.\n\nThis job must be carried out in compliance with all Specialty Produce Business Conduct and Ethics Standards, policies, and procedures as well as all Federal, State, and Local laws.\n\nGeneral Accountabilities:\n\nPrepares vehicle for operation by inspecting general condition and reports concerns to fleet manager\nLoads truck and ensures that they have all items needed to complete job efficiently and accurately\nDelivers items to customers ensuring they are following company policies and procedures always.\nReviewing orders and adjusting orders (as needed)\nMaintains cleanliness of company delivery vehicles by following the procedure set forth by the organization\nFollows all driver safety laws to ensure you are keeping yourself and the company property safe\nMaintains a good repour with customers always\nAssists customers with any questions/ concerns with their orders\nLearns and keeps up to date on company product\nThe company reserves the right to add or change duties at any time.\n\nRequirements:\nJob Qualifications:\n\nHigh school diploma or equivalent\nExperience: 1-2 years of related experience (preferred)\nValid drivers license with clean driving record\nFlexible schedule (e.g. able to work overtime, weekends, holidays etc.)\nFamiliar with San Diego County (preferred)\nExperience using hand trucks (preferred)\n\nSkills:\n\nCoordination  Adjusting actions in relation to others' actions.\nFast Paced-Will need to be able to work quickly and effectively always.\nTime Management  Must be able to manage time effectively.\nActive Listening  Giving full attention to what other people are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times.\nSpeaking  Talking to others to convey information effectively in English\nJudgment and Decision Making  Considering the relative costs and benefits of potential actions to choose the most appropriate one.\nBasic computer and Basic tablet skills\nMathematical Skills/Ability-Basic math skills (e.g. counting, subtracting, multiplying, etc.)\nCustomer Service Skills- Can communicate information effectively with customers with little to no issues\n\nPhysical Demands:\n\nContinuously pushing, pulling 50lbs +\nContinuously Lifting up to 45lbs and team lift for anything above 45lbs.\nStanding 8 hrs. or more\nWalking 8 hrs. or more\nBending, Stooping, Kneeling 8 hrs. or more\nRepetitive hand/arm movements 8hrs. or more (e.g. pulling, pushing, lifting, driving etc.)\nMust be able to see, hear and talk to perform this job effectively and safely\nFrequent maneuvering in and out of vehicle 8 hrs. or more\n\n"}, {"title": "Vans PT Sales Associate (Store #219 Mission Valley Mall San Diego, CA )", "company": "Vans", "location": "San Diego, CA 92108", "job url": "https://www.indeed.com/rc/clk?jk=958f5854be8856fa&from=vj&pos=top", "description": "Part-timeVans: Be a Part of the Original\nIt was never about waving the brand like a flag, it was always about the people  Paul Van Doren\nVans is the original action sports footwear company rooted in authenticity and creativity. Founded in 1966, Vans has thrived on a legacy of impacting our greater community through Vans four pillars: action sports, music, art and street culture. We are constantly inspired by the expressive creators within our company and community as they bring new and innovative perspectives to help shape and transform the future of our business.\nAt Vans our culture sets us apart and it influences everything we do. Everything we do supports creativity and we are driven by our five values. We are determined . We are connected to our consumers and to each other. We are inclusive . We are expressive and Fun . And most of all, we are a family.\nVans is a subsidiary of VF, the worlds largest apparel and footwear company comprised of over 30 brands. We are the leading drivers of retail as our global footwear, apparel and accessory brand is available in 170 countries worldwide. As we continue to expand, we take great measures in developing and growing our people.\nVans is founded on a culture of learning. We take great pride in our ability to facilitate learning opportunities to our field leaders and store employees through a blend of on-the-job training, workshops and self-paced online learning. Each employee is empowered to take ownership of their development, and encouraged to take advantage of the tools that make the most impact on their personal growth and the growth of the business.\nBy joining the Vans family, you will be immersed into an environment of incredibly supportive and collaborative people. We work very hard across a multitude of large initiatives to bring the Van Doren spirit to life. We live for what we do.\nSales Associate: Become the Newest Member of the Vans Family\nOff the Wall is a state of mind. Thinking differently and creating self-expression. As one of our passionate, fun and dedicated Sales Associates, you will bring Off the Wall to life. You will thrive in an authentic environment where we focus on elevating the customer experience by creating an industry leading atmosphere for our customers. As our Sales Associate, you will maintain the voice of our brand by engaging our customers in genuine conversation and selling our original and innovative product. You are an invaluable part of a team where individuality and authenticity are encouraged. If you have passion for Vans and are looking for a company dedicated to providing development opportunities to grow employees into the future business leader of tomorrow, the Vans family is for you. Vans. The Original since 1966.\nHow You Will Make a Difference:\n: Demonstrates a customer centric mindset by modeling selling behaviors with a passion for the brand, customer, and the product. Delivers results in their role that contribute to the stores success. Aware of and accountable to store and individual sales goals.\n\nBrand Experience/Customer Service : Exemplifies an optimistic and energetic presence through team collaboration while building strong relationships with customers to maximize customer loyalty. Provide solutions and inspiration to customers about the brand.\nWorking with the Team : Works collaboratively with the store team to achieve store objectives and sales results. Maintains a positive attitude and is flexible to the changing needs of the customer and the business.\n\nStore Standards : Ensures product is always available to the customer and represented in a compelling way that is consistent with visual guidelines. Ensures the store is consistently recovered and customer ready every day meeting brand standards on the sales floor and in the back stockroom areas.\n\n\nLoss Prevention, Safety, and Compliance : Adheres to policies and procedures, standards and practices, and company directives. Protects company assets. Complies with company safety, security, and shrink avoidance policies and programs. Reports any and all concerns to management.\n\nProfessional Conduct : Models behavior that respects the background, experience, and cultural differences of others, while upholding the integrity and values of the VF Corporation and Vans.\n\nSkills for Success:\nPrevious retail or service-oriented experience preferred but not required\nAbility to work with a team to exceed sales results\nAbility to meet business goals by meeting and exceeding sales goals\nRegularly interacts with the public in an often crowded and noisy interactive store environment\nEngaging verbal and nonverbal communication skills\nAbility to work in a fast-paced environment\nAble to meet performance expectations\nAbility to deliver a high level of customer service in a retail environment\nAbility to work a flexible schedule to meet the needs of the business; will require weekends, evenings, and holidays\n\nSpecial Physical and/or Mental Requirements:\nStanding required for entire work shift\nBend, lift, open, and move product up to 50 pounds as needed\n\nCore Competencies:\nCustomer Focus\nRecognizes and respects both types of customers, those that shop in our stores and those that work in our stores\nSets the expectation for Brand Right customer engagement - engaging customers in interactions that convey knowledge and passion for the brand, living and breathing Vans service philosophy, values, and spirit\nIs knowledgeable about Vans product and shares that knowledge with the customer\nActively engages with customers to understand their needs and provide a positive experience going above and beyond to meet the customers needs\nMakes the best impression in all situations\nIdentifies customer service opportunities and is dedicated to exceeding the expectations of all customers\nUses understanding of customer needs to ensure customer satisfaction and to prevent service issues from occurring; promotes customer service as a value\nAssures customer satisfaction and seeks to drive business through selling and customer engagement\nCommunicates in an engaging way with a respectful tone and manner\nPossesses a Brand Winning Attitude and approaches each challenge with positivity and communicates in an energetic, friendly, fun, precise, efficient, original, and genuine way\nListens actively and accurately in a variety of contexts and situations\nListens and asks questions to understand viewpoints of others\nApproachable exhibiting positive communication skills including non-verbal body language\nCommunicates issues and concerns in a timely manner\nOrganizes communication and ensures understanding\nMaintains audiences attention and adjusts to audience\nCommunicates authentically, with credibility and confidence\nDemonstrates a positive influence on others and is committed to the success of the brand\nContributing to Teams Success\nActively participates in a positive way with other members of the team to achieve success\nGenuinely cares about people and earns the respect and confidence of others\nListens to and fully involves others in team decisions and actions; values and uses individual differences and talents\nShares important or relevant information with the team being cooperative and constructive when working with a team\nAdheres to the team's expectations and guidelines; fulfills team responsibilities; demonstrates personal commitment to the team\nWork Standards\nSets standards for excellence. Is proud of who they are and the company they work for\nDemonstrates the traits, inclinations, and outlooks to engage with customers and drive sales\nEnsures high quality. Dedicates required time and energy to assignments or tasks to ensure that no aspect of the work is neglected; works to overcome obstacles to completing tasks or assignments\nHas high personal standards and strives to achieve personal best every day\nAccepts responsibility for outcomes (positive or negative) of one's work; admits mistakes and refocuses efforts when appropriate\nEncourages others to take responsibility: Provides encouragement and support to others in accepting responsibility; does not accept others' denial of responsibility without questioning\nViews challenges as opportunities and is open and receptive to change\nActively seeks information about new work situations; strives to understand the rationale and implications for changes in work responsibilities or environment\nTreats change and new situations as opportunities for learning or growth; identifies the benefits of change; speaks positively about the change to others\nQuickly modifies behavior to deal effectively with changes in the work environment; tries new approaches appropriate for new or changed situations; does not persist with ineffective behaviors.\nExercises flexibility and patience in difficult situations"}, {"title": "Sanitation Pumper Driver", "company": "National Construction Rentals", "location": "San Diego, CA", "job url": "Not Available", "description": "Job Summary - Drive sanitation service truck to various job sites, clean and empty portable restrooms and maintain them to National Construction Rentals, Inc. (NCR) standards. Represent the company in a friendly and professional manner. Report any problems and/or potential problems to Dispatcher in a timely manner. This job has no supervisory responsibilities.Essential Functions:Provide world class customer service and greet each customer with a professional, friendly and positive attitude.Obtain customers signature on contracts / Damage Waivers.Drive company vehicle to job sites to service portable restrooms and maintain them at NCR standards.Replenish all goods, such as restroom paper, seat liners, and paper towels, soap, water, hand sanitizer, if applicable.Perform work in a safe manner and participate in safety meetings.Perform daily inspections of vehicle and complete Vehicle Inspection Report and notify the dispatcher before leaving the yard.Maintain and operate company vehicle and equipment safely.Use GPS navigation system effectively.Immediately report any accidents or damage to supervisor.Perform other duties and/or tasks as assigned.Education and/or Experience:  High School diploma or General Education Development certificate (GED) preferred, or one to two years related experience or training.NATIONAL CONSTRUCTION RENTALS is an Equal Opportunity Employer. We offer a competitive hourly compensation and benefits package including Medical, Dental & Vision and 401k.Job Type: Full-timeEducation:High school or equivalent (Preferred)"}, {"title": "Delivery Route Driver", "company": "Unity Courier", "location": "San Diego, CA", "job url": "Not Available", "description": "$11.50 an hourPart-timeUnity Courier San Diego is urgently looking for a driver that has a vehicle with cargo space for a Full or part-time parcel delivery route that runs 10am-5pm M-F.Route delivery/courier experience heavily preferred.MUST have reliable gps or good-to-excellent general knowledge of San Diego County.Driver will be following a route that runs roughly 6.5 hrs M-F. The route is mostly the same every day with minor changes. Packages may be up to 50 lbs, but the majority are small boxes.After applying, please call 1-858-939-0182 after 10:00am. Ask for John.Starting at 11.50/hr plus mileage. Medical and Dental available.Job Type: Full-timeSalary: $11.50 /hourExperience:delivery/courier driver: 1 year (Preferred)License:Driver's License (Required)Work authorization:United States (Required)"}, {"title": "Parts Driver", "company": "Mossy Nissan of Escondido", "location": "Escondido, CA", "job url": "https://www.indeed.com/rc/clk?jk=ea8f86d9a8e839fb&from=vj&pos=top", "description": "This is a great opportunity to start your career in retail automotive and familiarize yourself with the parts and service side of our business.\n\nAt Mossy Auto Group our employees are our most valuable asset. Our mission statement is to create an environment of high integrity & mutual respect that nurtures openness, creativity, & innovation. Every employee at Mossy is absolutely critical to its success. As a family owned & operated business we consider each employee and extension of the Mossy family. We promise to deliver the same award winning service and value that our community has come to expect from our dealership through the years.\n\nBenefits\n\n*\nMedical, Dental & Vision\n\n*\nGroup Insurance Plans & Discounts\n\n*\n401K Retirement Savings Plan\n\n*\nPaid Vacation and Holidays\n\n*\nDisability Insurance\n\n*\nLAP (Life Assistance Program)\n\n*\nBasic Life, Dependent & Accident Insurance\n\n*\nGrowth Opportunities\n\n*\nPaid Training\n\n*\nEmployee Purchase Incentives\n\n*\nFamily Owned & Operated\n\n*\nLong Term Job Security\n\n*\nHealth & Wellness\n\n*\nFlexible Work Schedule\n\n*\nDiscounts on Products & Services\n\n*\nDirect Deposit/Pay Card\n\nResponsibilities\n\n*\nMaintain knowledge of parts inventory to efficiently locate parts\n\n*\nOrganize schedule of deliveries to ensure on-time pick up and delivery\n\n*\nMaintain cleanliness and operability of delivery truck after every shift\n\n*\nPerform Safe pick up and deliveries coupling with Mossy and client policies & requirements for loading and unloading\n\n*\nKeep parts department up-to-date on delivery schedule\n\n*\nAccurately record delivery/pick up transactions, accepting payment as applicable and deliver all such payments to cashier\n\n*\nSupport the companys efforts to train and cross train employees\n\nQualifications\n\n*\nHigh school diploma or equivalent\n\n*\nClean and valid drivers license\n\n*\nGood communication skills\n\n*\nPrompt and courteous\n\n*\nEnthusiastic personality\n\n*\nMechanical aptitude\n\n*\nWilling to submit to a pre-employment background check & drug screen\n\nWe are an equal opportunity employer & drug-free workplace. Offers of employment contingent upon successfully passing background screening (incl. criminal background check, review of motor vehicle records, verification of SSN & passing drug test at a certified testing facility)."}, {"title": "Delivery Driver", "company": "Courier Distribution Systems (CDS)", "location": "Mira Mesa, CA", "job url": "Not Available", "description": "$13 an hourJob DescriptionWe are a premier delivery service provider for one of the largest and most recognized e-commerce sites in the world. We provide excellent customer service and brand exposure for our client seven days a week.Our Delivery Associates are the face of not only our company, but our customer's as well. Therefore, only those that take pride in their work, appearance, and reputation need apply.DescriptionA Delivery Associate is responsible for the daily customer service on a given route which distributes a high volume of small packages (less than 50 lbs) in a relatively condensed cluster in a city or town. The successful candidate will have exemplary customer service skills, have superior time management skills and be obsessed with providing a level of performance that makes them stand out from the rest!Delivery Associates must commit to a 4-day schedule which will include one, if not both, weekend days on. Three days will be scheduled off in a row (for example Tuesday/Wednesday/Thursday). Routes are generally created with the expectation that they can be delivered within ten hours.QualificationsMust be able to meet our company insurance requirementsMust be over the age of 23 for insurance reasonsMust have a valid driver licenseMust be able to pass a 7-year background screening (no infractions of any kind)Must have a clean driving record (no more than 1 infraction in 3 years)Must be able to pass a 10-panel drug testMust possess EXCELLENT customer service skills (extremely patient and friendly with a desire to please/serve)Must be able to use a smartphoneMust be reliable (variations in schedules or tardiness are NOT permitted)Must work weekendsPrevious transportation and/or customer service experience preferredWe are an equal opportunity employer and affirmatively seeks diversity in its workforce. CDS recruits and advances qualifiedJob Type: Full-timeSalary: $13.00 /hourLicense:Driver's License (Preferred)Trucking freight handling:Load/unload by handTrucking payment:HourlyTrucking route:Local"}, {"title": "Tow Truck Driver", "company": "Towing", "location": "Escondido, CA", "job url": "Not Available", "description": "$2,500 - $4,500 a monthNo experience is necessary, but preferred. Full time position available. Shifts include nights, weekends and/or holidays.Candidates must possess the following skills and be able to perform the following tasks:Valid California driver's license and clean DMV record.The ability to communicate with the public and law enforcement in a professional manner.Be on time and efficient.Be able to load/unload vehicles on/off towing equipment (ability to lift 50 lbs minimum).Be available to work weekends, evenings and holidays.Must be 21 years of age and olderWe are looking for someone who is self motivated, energetic and able to work without direct supervision.Pay is based on experience level. Paid Bi-Weekly.Job Type: Full-timeSalary: $2,500.00 to $4,500.00 /monthJob Type: Full-timeSalary: $2,500.00 to $4,500.00 /monthExperience:Towing: 1 year (Preferred)License:Driver License (Preferred)"}, {"title": "Personal Driver", "company": "ELK Investors", "location": "New York, NY 10017", "job url": "Not Available", "description": "$40,000 - $50,000 a yearDesired: Customer ServiceLong Island family is looking to hire a full-time driver. The driver should be proficient in his work and must discharge his obligations in a professional manner. He needs to be watchful and safety conscious, professional, expert driver with a proper license, punctual, neat, clean and organized. Previous experience and long term employment with previous employer. References required. Competitive compensation.Job Type: Full-timeSalary: $40,000.00 to $50,000.00 /yearExperience:customer service: 1 year (Preferred)"}, {"title": "Delivery Driver", "company": "CDS Staffing", "location": "San Diego, CA", "job url": "Not Available", "description": "$13 an hourThe SkinnyThis is a four-day-per-week delivery job, working as an employee and making at least$13.00 hourly. It includes medical, dental, and vision insurance eligibility after 90 days.DescriptionAs a delivery driver for CDS Staffing, youll be delivering to residents and businesses around the San Diego area for one of the worlds most iconic brands. Each morning, we provide all the tools youll need for the day: a van, a device to log your packages, a dispatcher to assist you as necessary, and the packages themselves!Schedule: Each week, you will have a stable schedule of 5 consecutive work days and 2 days off. Days are designed to be 10  hours long, including a 30-minute lunch break and two 15-minute paid breaks. However, because most of your day is spent driving and delivering, you will have the opportunity to complete your day early and still get paid the same!Room to Grow: CDS Staffing hires almost exclusively from within and has multiple administrative positions in your location that you can transition into if you choose to pursue such a goal.What We Will Ask of You:Attendance: It is important that you show up on time to fulfill your scheduled shifts consistently.Performance: You will receive paid training and continual support to grow as a delivery driver and make the most out of your time.Attitude: Youll need to bring a can-do optimistic attitude, and maintain a pleasant, professional demeanor with our clients and their customers.QualificationsHigh school diploma or general equivalency diploma (GED)Must be at least 23 years oldMust be able to pass a background test and on-site drug screeningClean driving record - No more than 1 major moving violation and 2 minor violationsExcellent personal skills: ability to communicate effectively with clients, co-workers, and customersTech Savvy: experienced with GPS and other smartphone-related applicationsValid Driver's License, no CDL requiredPrevious transportation experience strongly preferred, not requiredMUST be reliable, and capable of working a Flexible Schedule (weekend availability is MANDATORY)Job Type: Full-timeSalary: $13.00 /hourExperience:delivery driver: 1 year (Preferred)Trucking payment:Hourly"}, {"title": "Courier Delivery Driver (For Amazon Account)", "company": "Amazing Courier Express Services", "location": "San Diego, CA 92127", "job url": "Not Available", "description": "$14.30 - $16.00 an hourPart-timeJoin the Amazing Courier Express Services Team in a fast-paced environment delivering packages for Amazon. Deliveries are for local routes to residential and business locations. Both full-time and part-time positions pay hourly plus bonus. Drivers will drive our new Amazon branded luxury cargo vans.We are seeking people who are team players (our motto is No driver left behind!!). We need people who are reliable, quick, and ready to work EVERY DAY scheduled!!Idea candidate are:EnergeticCommitted and ready to get the job doneTeam playersSelf startersRequire little supervisionAre FlexibleLove to driveEnjoy interacting/interfacing with peopleSuccessful drivers put safety first and care deeply about customer expectations and satisfaction!!Details: All shifts start approximately at 7am (must be flexible)Full-time (4) 10 hour shiftsPart-time 20-25 hours a weekDriver will be driving our new Amazon branded cargo vansEach driver will be provided a fuel cardRequirements: Must be 21 years oldValid CA driver's license with good driving recordMust be able to pass a thorough background investigation, drug screen and driving record reviewBe willing to load and unload parcels within the route assigned (maximum of 50 lbs.)Professional appearance, you will be in contact with customersDetail-oriented, self-motivated and the ability to work independentlyPlus: Previous Customer Service a plusPrevious delivery experience a plus but not mandatoryPrevious athletic background a plus but not mandatoryPrevious management/leadership a plus but not mandatoryJob Types: Full-time, Part-timeJob Types: Full-time, Part-timeSalary: $14.30 to $16.00 /hourExperience:Customer Service: 1 year (Preferred)Delivery: 1 year (Preferred)License:California (Required)"}, {"title": "Delivery Driver", "company": "F&amp;L EXPRESS CORP", "location": "San Diego, CA", "job url": "Not Available", "description": "Part-timehave both FT and PT positions available for Class C drivers.REQUIREMENTS:Valid Class C drivers license with no restrictionsAble to pass pre--employment background check going back 7 years and Drug testAvailable for flexible schedule, 7 days a weekFamiliar with North/East county San Diego CountyAble to work 10 hour shiftsMust have own vehicle car/vanSKILLS AND ATTRIBUTESExperienced with shipping and receiving proceduresExperience in a warehouse environmentStrong customer service skillsAbility to lift up to 50lbs unassistedRead, write and communicate in English as it relates to the jobRESPONSIBILITIESPick up of product from vendorTimely delivery of packagesUse a GPS and hand held scannerDeliver package with GREAT customer service to residence or businessPLEASE contact ME ATFARID 619 402 5762Email faridiksd@gmail. comJob Types: Full-time, Part-timeLicense:VALID DRIVERS LICENSE (Preferred)Driver's License (Required)"}, {"title": "DRIVER", "company": "BHC Alhambra Hospital", "location": "Rosemead, CA 91770", "job url": "https://www.indeed.com/rc/clk?jk=432f52b4bc839370&from=vj&pos=top", "description": "Desired: Driver's LicenseClean Driving RecordCDL BBHC Alhambra Hospital\nPatient Transportation Specialist Class \"B\" Required  Full Time\nUniversal Health Services, Inc. (UHS) knows what it takes to lead, inspire and succeed. One of the nations largest and most respected hospital companies, Universal Health Services, Inc. (UHS) owns and operates through its subsidiaries acute care hospitals, behavioral health facilities and ambulatory centers in the United States, Puerto Rico, the Virgin Islands and the United Kingdom.\nBHC Alhambra Hospital is a 103 bed facility established in 1924. BHC Alhambra Hospital is a private, fully accredited, full-service acute psychiatric hospital serving children, adolescents and adults. BHC Alhambra Hospital is dedicated to providing quality behavioral health, substance abuse, and eating disorder treatment options for the communities of the San Gabriel Valley, Los Angeles County, and surrounding areas. BHC Alhambra Hospital does not provide emergency services.\nThe mission of BHC Alhambra Hospital is to develop, implement and manage, in the most ethical and efficient manner, a network of superior behavioral health services with optimal client outcome.\nTo learn more visit: http://www.bhcalhambra.com/\nThe Patient Transportation Specialist provides transportation of patients to and from the facility providing friendly respectful interaction and role modeling of positive socialization to the patients while maintaining safety at all times. This position is responsible for providing excellence in customer service to all patients and referral sources and for representing the facility and its programs to the community.\nKey Responsibilities include:\nProvide encouragement and support to patients in order to help patients meet their outpatient treatment plan goals and objectives.\nProvide a positive experience for patients at all times\nProvide a transportation experience which treats all patients with respect and dignity at all times and is encouraging and supportive of the patient.\nGreet each patient(s) at the van door and opens the van door for each patient assisting the patient into and out of the van as indicated.\n\nJob Requirements\nRequirements:\nEducation: High school graduate, or equivalent.\nLicensure: Possesses and maintains a valid Class B drivers license.\nAdditional Requirements: Must be 21 years or older and have a good driving record as obtained from the Department of Public Safety. CPR certification and successful completion of NCI training within 90 days of employment. May be required to work occasional overtime and flexible hours. Desire and ability to interact positively with others including patients and referral sources and be a role model is required.\n\nThis opportunity provides the following:\nChallenging and Rewarding Work Environment\nGrowth and Development Opportunities within UHS and Its Subsidiaries\nCompetitive Compensation\nExcellent Medical, Dental, Vision and Prescription Drug Plan\n401k Plan with Company Match\nGenerous Paid Time Off\nUHS Stock Options Opportunity\n\n\nUHS is a registered trademark of UHS of Delaware, Inc., the management company for Universal Health Services, Inc. and a wholly-owned subsidiary of Universal Health Services, Inc. Universal Health Services, Inc. is a holding company and operates through its subsidiaries including its management company, UHS of Delaware, Inc."}, {"title": "My Sister&#39;s Attic-Encintas CA-Delivery Driver Positions!!!", "company": "MY SISTER&#39;S CLOSET", "location": "Encinitas, CA", "job url": "https://www.indeed.com/rc/clk?jk=90005a18ae925d93&from=vj&pos=top", "description": "$15 - $16 an hourCommissionMY SISTER'S ATTIC IS OPENING A NEW LOCATION IN ENCINITAS, CA & WE HAVE\nDELIVERY DRIVER POSITIONS AVAILABLE!!\nExperienced delivery drivers with some furniture moving experience\nDelivering furniture and home good pieces to loyal and new customers.\nPicking up consignment furniture/home good pieces from our valuable consignors.\nIf you have a clean driving record and great customer service skills\nApply Now!!!\nStarting Pay Rate: $15-$16 per hr.\nPay is based on level of experience.\nSkills / Requirements\nFurniture moving experience preferred.\nMust be able to consistently lift/carry/move 75-100 lbs. throughout the day, up and down stairs, in and out of truck.\nExperience loading, strapping and protecting merchandise before loading onto trucks.\nExperience off loading trucks with care of merchandise.\nExcellent customer service, great communication skills and enjoy working with people.\nClean driving record and valid drivers license.\nPrior experience driving delivery/box truck preferred.\nMust be able to work weekends Important Notes\nIf selected for interview please present clean MVR to hiring manager.\nEmployment DOT drug screen and pre-employment physical with medical certificate will be required if candidate is offered\nEco Chic Consignments, Inc. reserves the right to conduct drug and background checks of pre-hire candidates and employees.\nPay Comments: DOE - we offer competitive pay plus commissions and our full-time employees enjoy benefits including co-paid medical, 401(k) company match,\npaid vacation, and more!\nApplication Instructions\n\nClick on the link below to apply for this position.\nA new window will open and direct you to apply at our corporate careers page.\nPlease complete the application and don't forget to upload your resume.\nWe look forward to hearing from you!!!"}, {"title": "Driver Trainer", "company": "Amazon.com", "location": "Miami, FL", "job url": "https://www.indeed.com/rc/clk?jk=31073f39d37e3344&from=vj&pos=top", "description": "Job Description\nDriver Trainer\nAmazon Logistics (AMZL) delivers packages and smiles to Amazon customers every day. We're looking for motivated, customer-focused individuals who want to join our team training AMZL Drivers on package delivery and vehicle operation. As a Delivery Trainer, you will train Drivers on safe driving practices and high quality customer service when delivering packages to homes, retail locations, and other delivery locations. In this position you will play a key role in keeping our commitment to exceed customer expectations and make sure customer orders, large or small, are delivered on time at the right place.\n\nGeneral Responsibilities:\nPartner with Operations Managers, Dispatchers, and Area Managers to coordinate, facilitate, and measure training related activitiesTrack performance and provide identified retraining and process improvement opportunitiesSupport standard work and safety programsLead all learning and operational auditsFacilitate daily training classes for up to 20 people, including in station classes and ride alongs\nJob Requirements:\n21+ years of agePossess a valid drivers license in the state of residenceMust be able to travel to multiple sites within 50 miles of the home station and have reliable transportationAbility to operate and navigate a 10,000 pounds or less vanAbility to effectively operate a GPSAbility to give and receive feedback\n\nAmazon is an Affirmative Action-Equal Opportunity Employer  Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation\n\nBasic Qualifications\nBasic Qualifications:\nHigh School Diploma or equivalentExperience delivering training both to individuals and groups\nPreferred Qualifications\nPreferred Qualifications:\n2+ years of professional driving experienceBachelors Degree or 2+ years Amazon experienceWillingness to work different shifts and travel within a localized region to support other sites"}, {"title": "Vending Route Driver", "company": "Brec Vending", "location": "Corona, CA", "job url": "Not Available", "description": "$10.50 - $15.00 an hourCommissionEmployee needs to be responsible, ethical, bilingual is a plus.No experience necessary, will train.Job Types: Full-time, CommissionSalary: $10.50 to $15.00 /hourExperience:customer service: 1 year (Preferred)License:Class A (Preferred)Language:English (Required)Work authorization:United States (Required)"}, {"title": "Bellperson/Driver", "company": "Wyndham Hotels &amp; Resorts", "location": "San Diego, CA 92109", "job url": "https://www.indeed.com/rc/clk?jk=da3ed566494b5269&from=vj&pos=top", "description": "We are a full service San Diego waterfront hotel with 600 rooms and suites featuring furnished balconies with relaxing views of the sparkling Big Bay and panoramic skyline. Our 24,000 square feet of meeting space has recently been renovated and offers flexibility for distinctive conferences, reunions, weddings, and events. Our average tenure for 230 associates is 14 years of service that speaks to the dedication our associates have for the property, its people, and guest. Our hotel professionals stand ready to go the extra mile and deliver an exceptional experience. We are seeking for professionals who have the Count on Me! spirit and are looking to grow their career. Wyndham San Diego Bayside presents the ideal opportunity to take your career to the next level!\n\nJob Description\n\nWyndham Hotel is searching for a dual Bellperson/Driver to work at our beautiful Wyndham San Diego Bayside property in San Diego, CA. The Bellperson/Driver is responsible for driving the van to and from the airport according to scheduled van runs and/or as needed for guests and accommodating guests during their stay in an attentive, courteous and efficient manner. He/she is also responsible for assisting with luggage, and assisting with the check-in/check-out processes in an attentive, courteous and efficient manner.\n\n\nResponsibilities will include but not be limited to:\nThe Driver is responsible for driving the van to and from the airport according to scheduled van runs and/or as needed for guests and accommodating guests during their stay in an attentive, courteous and efficient manner. He/she is also responsible for assisting with luggage.\n Load and unload carts and vehicles and assist guests with tagging, storing and retrieving of luggage.\nDrive guests to and from airport and other assigned trips, while ensuring the safety of all passengers.\nEscort guests to rooms upon request.\nOpen vehicle and hotel doors and greet arriving and departing guests.\nDeliver messages to meeting rooms.\nMaintain list of local transportation guides, churches, sport arenas, etc.\nProvide information, maps, and directions as necessary.\nDeliver flowers, packages and messages to guestrooms.\nAssist with room changes.\nMaintain hotel van: gas, oil, cleanliness - interior and exterior; fill out daily van reports and report any malfunctions to management.\nOperate radios efficiently and professionally in communicating with hotel staff.\nNotify security of accidents and complete appropriate documentation.\nAnswer console to assist Guest Services Agents.\nShow guestrooms and suites as needed and emphasize the hotel's amenities.\nBellperson duties as assigned.\nQualifications:\n\nHigh School diploma or equivalent and/or experience in a hotel or a related field preferred.\nMust have a valid California Class B driver's license with Passenger Endorsement.\nExperience as a Driver for Hospitality industry a plus.\nCommercial driving record must be verifiable.\nClean driving history for the past 10 years.\nAn Equal Opportunity Employer\nMinorities/Women/Vets/Disabled\nDrug Free Workplace"}, {"title": "Professional Full Time Driver", "company": "BJ Industries, Inc.", "location": "Oceanside, CA 92058", "job url": "https://www.indeed.com/rc/clk?jk=ecce0478535c7e26&from=vj&pos=top", "description": "$150 a dayDesired: Clean Driving RecordDriving ExperienceDescription\n\nWork Mon - Fri. There may be an opportunity to work on Saturdays.\nArrive at terminal at an hour that guarantees daily success.\nOrganize and load vehicle. Prepare map if necessary.\nDeliver and pickup packages on designated route.\nAll pickups completed during pickup windows.\nCommunicate with management regarding truck maintenance, route volume.\nInteract with shippers and recipients in a professional, polite manner.\nMaintain a professional appearance. Keep vehicle interior clean.\nKeep safety and excellence at the forefront of everything.\nDriver Qualifications\n\nBe 21 years of age or older, have a clean driving record, pass a drug screen (this includes marijuana), background check (no misdemeanors or felonies), DOT physical, and have one year of qualified driving experience in the last 3 years (driving a 15ft truck or bigger).\nBe able to get along with others in a professional and courteous way.\nBe in good physical condition OR be willing to get in good shape! This is a physical job!! You must be able to lift up to 150 lbs.\nAble and willing to read a map.\nReliable. If you like to call in sick this is not the job for you.\nOrganized. Organizing your truck is a key for having a successful day on the road.\nSelf-motivator. If you are not, you will not be successful in this job. We do not micro-manage. You are expected to come in and get your work done without being coddled.\nProfessional Driver will earn at least $150.00/day\n\nWe look forward to hearing from you!"}, {"title": "Driver, Non-CDL", "company": "Fresenius Medical Care", "location": "Vista, CA 92084", "job url": "https://www.indeed.com/rc/clk?jk=6e8f467c49630a83&from=vj&pos=top", "description": "Desired: Customer ServicePURPOSE AND SCOPE:\nResponsible for driving a non-CDL van/truck to deliver to customers. Ensures accuracy of all paperwork related to the job. Responsible for safety of crewmembers, fellow employees, and the public while operating company vehicles and/or supervising/performing any company activity.\n\nPRINCIPAL DUTIES AND RESPONSIBILITIES:\nDelivers and picks up products from customers including but not limited to, home patients, clinics, and hospitals.\nCommunicate effectively with, but not limited to, co-workers, management, vendors, and customers (home patients).\nEnsures good customer relations by consistently delivering orders on time and behaving with integrity in a courteous and professional manner.\nTakes note of and possibly resolves customer complaints. Reports all issues and complaints to distribution center staff or customer service for remediation. Observes and reports any pertinent issues at customer sites.\nMay set up product and/or place product on shelves or racks at customer sites.\nPerforms all duties and functions safely and in accordance with company and OSHA standards and guidelines.\nWhen delivering, performs rotation and inventory checks of existing product when directed to do so.\nObtains customer signatures for pickups (RGAs) and deliveries.\nAdheres to all federal and state specific DOT regulations including, but not limited to GVW (Gross Vehicle weight).\nIdentifies and recommends options for route improvements to management as appropriate.\nVehicle related responsibilities include, but are not limited to:\nPerforming pre and post-trip inspections of assigned vehicle. Identify problems and address appropriately.\nMay perform routine maintenance on Non-CDL van/truck.\nUnloading and loading of freight as required according to specified procedures and regulations.\nMaintain a clean van/truck.\nParticipates in monthly/quarterly/annual training for Good Manufacturing Practices, Health & Safety, and Compliance (both corporate and DPD-specific).\nRemains updated with all annually revised regulatory standards.\nOperates material-handling equipment safely and efficiently according to established procedures as required.\nFulfills assigned tasks in warehouse and/or office when necessary.\nMay refer to senior staff for assistance with day-to-day problems that may arise.\nEscalates issues to supervisor for resolution, as deemed necessary.\nAssist with various projects as assigned by direct supervisor.\nOther duties as assigned.\n\nAdditional responsibilities may include focus on one or more departments or locations. See applicable addendum for department or location specific functions.\n\nPHYSICAL DEMANDS AND WORKING CONDITIONS:\n\nThe physical demands and work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nHeavy work with frequent lifting and carrying of objects 25 -75 pounds on a repetitive basis required. Some deliveries may require carrying product up multiple flights of stairs.\n\nRequires extended periods of sitting, standing, and walking. Operation of van/truck may average 6 to 11 hours per day.\n\nEDUCATION:\nHigh School Diploma, GED or equivalent work experience required.\n\nEXPERIENCE AND REQUIRED SKILLS:\n\n0  1 years of related experience.\n\nAbility to learn functionality and operate on-board computers, paperless DOT logs and/or electronic capture applications.\n\nMust possess and maintain a satisfactory driving record.\n\nAbility to operate material handling equipment.\n\nExperience with on-board computers, paperless DOT logs.\n\nStrong communication skills and a professional demeanor at all times.\n\nStrong customer service skills.\nEO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity"}, {"title": "Delivery Driver", "company": "CDS Staffing", "location": "San Diego, CA", "job url": "Not Available", "description": "$13 an hourThe SkinnyThis is a four-day-per-week delivery job, working as an employee and making at least$13.00 hourly. It includes medical, dental, and vision insurance eligibility after 90 days.DescriptionAs a delivery driver for CDS Staffing, youll be delivering to residents and businesses around the San Diego area for one of the worlds most iconic brands. Each morning, we provide all the tools youll need for the day: a van, a device to log your packages, a dispatcher to assist you as necessary, and the packages themselves!Schedule: Each week, you will have a stable schedule of 5 consecutive work days and 2 days off. Days are designed to be 10  hours long, including a 30-minute lunch break and two 15-minute paid breaks. However, because most of your day is spent driving and delivering, you will have the opportunity to complete your day early and still get paid the same!Room to Grow: CDS Staffing hires almost exclusively from within and has multiple administrative positions in your location that you can transition into if you choose to pursue such a goal.What We Will Ask of You:Attendance: It is important that you show up on time to fulfill your scheduled shifts consistently.Performance: You will receive paid training and continual support to grow as a delivery driver and make the most out of your time.Attitude: Youll need to bring a can-do optimistic attitude, and maintain a pleasant, professional demeanor with our clients and their customers.QualificationsHigh school diploma or general equivalency diploma (GED)Must be at least 23 years oldMust be able to pass a background test and on-site drug screeningClean driving record - No more than 1 major moving violation and 2 minor violationsExcellent personal skills: ability to communicate effectively with clients, co-workers, and customersTech Savvy: experienced with GPS and other smartphone-related applicationsValid Driver's License, no CDL requiredPrevious transportation experience strongly preferred, not requiredMUST be reliable, and capable of working a Flexible Schedule (weekend availability is MANDATORY)Job Type: Full-timeSalary: $13.00 /hourExperience:delivery driver: 1 year (Preferred)Trucking payment:Hourly"}, {"title": "Event Coordinator", "company": "Bath Planet of San Diego", "location": "San Diego, CA 92111", "job url": "Not Available", "description": "$17 - $19 an hourCommissionThe responsibilities for the Event Coordinator will be to search for local events including home and garden shows for our company to display the products offered. Also will be responsible for hiring and training event staff for each event and show for gathering leads and appointments from each event.Job Types: Full-time, CommissionSalary: $17.00 to $19.00 /hourLicense:drivers (Required)Language:english (Required)Work authorization:United States (Required)"}, {"title": "HiLo Driver", "company": "Restaurant Depot", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=6e824ac6e12049ac&from=vj&pos=top", "description": "Summary\nMove merchandise and throughout the warehouse from-receiving to a customers car door. Complete required paperwork necessary to support the function. Tag or mark orders as requested. Carefully move product from the staging or storage areas into the truck or trailer being loaded. Slot move product as necessary and complete the paperwork to support that function. Comply with all safety, security, regulatory, and company policies.\n\nTasks & Accountabilities\nResponsible for warehouse operational procedures including sorting, loading/unloading activities of product processing and documentation and provide information regarding holes.\nPrior to the product being stored, count all product, compare to the manifest, and check all inbound shipments for damage, infestation and production dates\nReport shortages, overages, damage, the appropriate manager\nCompare the quantify, quality, labeling and consignee address to the customer order to ensure all outgoing shipments are complete and correct\nSafely and efficiently operate machinery and equipment as required, and assist in the unloading or loading of product moving into or out of warehouse\nParticipate in the physical inventories as required\nMaintain clean, neat, and orderly work areas and operate in a manner that promotes safety\nAssist in maintaining the security of the warehouses\nOther duties as assigned\n\nRequired Skills & Qualifications\nExperience with the service, production, or support role having greater responsibility to perform all (or most) of the standard work within the function\nHigh school degree or GED equivalent\nOne year of experience in related area of responsibility\nExperience leveraging technology to perform daily tasks, including familiarity with MS Office applications web navigation & basic hardware functions\nStrong oral and written communication, problem solving and interpersonal skills; ability to quickly build rapport with both internal teammates and Smart Warehousing business units\nProven track record of taking initiative to accomplish tasks in creative ways with a sense of urgency and assertiveness\nThe HiLo Operator is responsible for operating a forklift to move, locate, relocate, stack, and count merchandise. The Operator is accountable for the safe and efficient operation of the vehicle and may also be required to perform Order Filler and Checker duties.\nOperate all equipment in a safe and efficient manner following prescribed work methods\n\nPhysical Demands\nConsistently throughout the day employees are required to sit, talk and hear and when necessary climb, crouch or crawl.\nOperate the equipment using hands to fingers, manually carry, move merchandise\nDrive or ride in a motor vehicle.\nLift and/or move up to 50 lbs\n\nAcknowledgement:\nI fully understand the responsibilities and qualifications required for this job. Furthermore, I find that I am capable of performing the required functions.\n\nBenefits: 100% Company Paid Medical/Dental Plan and Annuity Program.\n\nBrand: Restaurant Depot\nAddress: 7466 Carroll Rd San Diego, CA - 92121\nProperty Description: 530 - MIRAMAR\nProperty Number: 530"}, {"title": "Medical Equipment Service &amp; Delivery Driver, San Diego CA (FT)", "company": "Universal Hospital Services", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=7775864ec0012015&from=vj&pos=top", "description": "Desired: Basic Computer SkillsDriver's LicenseCustomer ServiceConflict ManagementJob Description:\n\nFull time position that includes weekends, flexible availability needed\n\nThe Customer Service Technician is responsible for delivery and equipment management tasks for a district office, including customer delivery and pick-up of medical equipment; processing, cleaning, inspecting and testing equipment; and inventory maintenance.\n\nKnowledge and Physical Requirements\n21 years of age or older, with high school diploma or equivalent.\nPrior work experience in hospital setting or customer service preferred.\nBasic computer skills.\nWilling to work flexible hours, including evenings, weekends and holidays, as well as emergency off-hours as required.\nValid drivers license and potential for DOT certification.\nAble to lift and/or push 75 pounds.\nAble to stand and walk for long periods of time.\n\nBehavioral Skills (How the jobholders must conduct themselves with other people.)\nPossesses quality orientation with a get it right the first time attitude.\nComplies with patient privacy laws in all matters.\nMaintains and projects confidence, enthusiasm and a professional image.\nFlexible, coachable.\nDemonstrates strong communication skills (listening, writing and speaking).\nDemonstrates team orientation and shows respect for others.\nProactive and self motivated.\nOrganized; prioritizes to meet deadlines.\nOperates with a proactive approach towards safety, health and quality in compliance with all company, governmental, and customer policies and regulations.\nMaintains a clean and safe work environment.\nCustomer-focused: willing to go above and beyond.\n\nPractical Skills (Tasks that the job holder must be able to do and demonstrate.)\nAble to dialogue with clinical staff on the topics of equipment features, functionality, etc.\nUnderstands and uses effective conflict resolution skills, e.g., identifies and resolves service concerns, discrepancies and disagreements.\nEnsures prompt and courteous service is delivered to all customers in person and in all communications.\nShares information with all team members to improve ability to service customers and define opportunities for the district team.\nCompletes all paperwork accurately and in a timely manner to ensure accurate documentation for billing and required regulatory compliance.\nStays up to date on the medical equipment in our fleet.\nInspects, cleans and tests medical equipment for functionality, following approved written procedures.\nSafely loads, secures and delivers medical equipment to customers.\nCompletes and maintains DOT certification, according to location-specific needs.\nEducates and engages customers at the time of delivery, detailing customers on the features and functionality of the equipment,\nRetrieves equipment from customer locations, safely transporting the equipment back to the office.\nShips and receives medical equipment and supplies.\nAssists with inventory management.\nResolves customer complaints, ensuring customer satisfaction.\nPerforms other assigned duties.\n\n\nWe believe every interaction has the power to change a life. Join UHS and help make a difference for health care providers and patients nationwide.\n\nFull time opportunities offer a base wage, bonus incentives, health/dental/vision plans, 401(k), life insurance, PTO, tuition reimbursement, excellent career pathing, and more. We are proud to be an EEO/AA Employer. Apply today!\n\n\n\nPrimary Job Location:\n\nSan Diego District\n\n\n\nAdditional Locations (if applicable):\n\n\n\n\nJob Title:\n\nCustomer Service Technician I\n\n\n\nCompany:\n\n\nUniversal Hospital Services\n\n\n\nLocation City:\n\n\nSan Diego\n\n\n\nLocation State:\n\nCalifornia\n\n\nv2"}, {"title": "Sign on Bonus *Non CDL* Independent Contractor/Delivery Driver (MF)", "company": "TopHAT Logistical Solutions", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=145b95f58329cdbe&from=vj&pos=top", "description": "We are looking for Contract Carriers for Home Delivery of Mattresses in San Diego, CA.\nPotential to Gross over $145,000/year\nUp to $1500 Sign-On BONUS\n\nLocal deliveries (no overnight travel), competitive revenue potential with route guarantees.\nJob Summary:\n\nThe qualified candidate for this position will make deliveries to residential customers with a focus on timeliness and customer service. The Delivery team will off-load materials at each stop, deliver and place products to the customers specifications.\n\nIf you are a motivated self-starter and are interested in learning more about becoming an independent contractor, TopHAT is for YOU!\n\nJob Duties and Requirements:\n\nOutstanding customer service and communication skillsMust be able to work independently and manage time appropriately to meet deadlinesValid Drivers LicenseChauffer License required (operating a vehicle between 16,0001 and 26,000 lbs)Must be able to lift at least 50 lbs or more.Must be able to pass background and drug test\nPrevious or current Owner/Operator status is a PLUS\n\nAccess a 26' Box Truck\n2 man team required.\n\nIf you have experience with in-home delivery of furniture or other goods and/or are mechanically inclined and focused on customer service, please forward your contact information by clicking on the following link: https://tophatls.recruiterbox.com/jobs/fk01qe6?cjb_hash=O_DJZf16&apply_now=true"}, {"title": "DRIVER", "company": "BHC Alhambra Hospital", "location": "Rosemead, CA 91770", "job url": "https://www.indeed.com/rc/clk?jk=432f52b4bc839370&from=vj&pos=top", "description": "BHC Alhambra Hospital\nPatient Transportation Specialist Class \"B\" Required  Full Time\nUniversal Health Services, Inc. (UHS) knows what it takes to lead, inspire and succeed. One of the nations largest and most respected hospital companies, Universal Health Services, Inc. (UHS) owns and operates through its subsidiaries acute care hospitals, behavioral health facilities and ambulatory centers in the United States, Puerto Rico, the Virgin Islands and the United Kingdom.\nBHC Alhambra Hospital is a 103 bed facility established in 1924. BHC Alhambra Hospital is a private, fully accredited, full-service acute psychiatric hospital serving children, adolescents and adults. BHC Alhambra Hospital is dedicated to providing quality behavioral health, substance abuse, and eating disorder treatment options for the communities of the San Gabriel Valley, Los Angeles County, and surrounding areas. BHC Alhambra Hospital does not provide emergency services.\nThe mission of BHC Alhambra Hospital is to develop, implement and manage, in the most ethical and efficient manner, a network of superior behavioral health services with optimal client outcome.\nTo learn more visit: http://www.bhcalhambra.com/\nThe Patient Transportation Specialist provides transportation of patients to and from the facility providing friendly respectful interaction and role modeling of positive socialization to the patients while maintaining safety at all times. This position is responsible for providing excellence in customer service to all patients and referral sources and for representing the facility and its programs to the community.\nKey Responsibilities include:\nProvide encouragement and support to patients in order to help patients meet their outpatient treatment plan goals and objectives.\nProvide a positive experience for patients at all times\nProvide a transportation experience which treats all patients with respect and dignity at all times and is encouraging and supportive of the patient.\nGreet each patient(s) at the van door and opens the van door for each patient assisting the patient into and out of the van as indicated.\n\nJob Requirements\nRequirements:\nEducation: High school graduate, or equivalent.\nLicensure: Possesses and maintains a valid Class B drivers license.\nAdditional Requirements: Must be 21 years or older and have a good driving record as obtained from the Department of Public Safety. CPR certification and successful completion of NCI training within 90 days of employment. May be required to work occasional overtime and flexible hours. Desire and ability to interact positively with others including patients and referral sources and be a role model is required.\n\nThis opportunity provides the following:\nChallenging and Rewarding Work Environment\nGrowth and Development Opportunities within UHS and Its Subsidiaries\nCompetitive Compensation\nExcellent Medical, Dental, Vision and Prescription Drug Plan\n401k Plan with Company Match\nGenerous Paid Time Off\nUHS Stock Options Opportunity\n\n\nUHS is a registered trademark of UHS of Delaware, Inc., the management company for Universal Health Services, Inc. and a wholly-owned subsidiary of Universal Health Services, Inc. Universal Health Services, Inc. is a holding company and operates through its subsidiaries including its management company, UHS of Delaware, Inc."}, {"title": "Parts Driver", "company": "Group 1 Automotive", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=5163462ccd49d2f3&from=vj&pos=top", "description": "Overview\nRancho CDJ RAM is part of fast growing Group 1 Automotive, a leader in automotive retail and we are looking to add qualified PARTS DRIVER/SHIPPER/RECEIVER to our team. Group 1 is a Fortune 500 company that offers a team environment, great benefits and ongoing training and support for its associates. If you are in alignment with our values of integrity, transparency, professionalism and teamwork- now might be the time for you to accelerate your career as part of the best company in automotive retail. Apply today or refer a qualified friend.\n\nIn addition to competitive pay, we offer our associates the following benefits:\nHealth, Dental, Vision, Life, and Disability insurance\n401(k) plan with company match\nPaid Time-Off\nEmployee Stock Purchase Plan\nEmployee Vehicle Purchase Program\nProfessional work environment, with job training and advancement opportunities\nResponsibilities\nPicks up and delivers parts and equipment to customers, satellite stores, wholesale accounts and vendors.\nCoordinate any last minute pick-up or deliveries.\nVerifies that invoice matches purchase order for each pick-up.\nChecks payments received with the invoices for each delivery.\nKeep an accurate log of daily deliveries and pick-ups. Request recipient's signature on each delivery entry.\nUnloads truck each night. Turns in all paperwork and undelivered parts.\nHandle basic maintenance of the truck including filling tank with gas, checking oil, keeping it clean and making sure required inspections are performed.\nHelps maintain the professional appearance of the parts department.\nChecks in all stock orders upon receipt.\nNotifies the parts manager of any parts that are received damaged or missing from any type of order.\nReceipts in all special order parts.\nMaintains a special order file and ensures that all customers are notified of the receipt of their parts.\nMaintains backorder file.\nQualifications\nTwo or more years related experience in an automotive parts department preferred.\nOne or more years of sales experience preferred.\nExcellent customer service skills.\nProfessional appearance and work ethic.\nAbility to work well in a process driven environment.\nHigh school diploma or equivalent.\nValid driver license in the state that you will work and a good driving record.\n*All applicants must pass pre-employment testing to include: background checks, MVR, and drug testing in order to qualify for employment*\nGroup 1 Automotive is an Equal Employment Opportunity employer.\n\n#LI-WS1"}, {"title": "Snow Plow Driver", "company": "TPSJ Inc.", "location": "Tahoe City, CA", "job url": "Not Available", "description": "$2,500 - $3,500 a monthPlow snow blower operator position open full time, prefer heavy equipment operation experience we Use Holder municipal tractors in multi hug municipal tractors with snowblower attachments clearing driveways position requires for more information please contact us.Job Type: Full-timeSalary: $2,500.00 to $3,500.00 /monthExperience:Snow Plowing: 1 year (Preferred)Location:Tahoe City, CA (Preferred)"}, {"title": "Ramp Agent", "company": "Delta Air Lines Global Services", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=1cd489fe509cd55e&from=vj&pos=top", "description": "Ramp Agent - Alaska - San Diego $12.00\n(Job Number: 01DFF)\n\nPosition Summary :\n\nUnder the supervision of the lead agent and/or supervisor on duty, Ramp Agents are responsible for marshalling aircraft in and out of the gate, loading, unloading and sorting freight, mail and baggage in a safe manner while also achieving on-time departures and arrivals. Ramp Agents may also be responsible for servicing aircraft lavatories, cleaning aircraft, restocking items, deicing and other duties as delegated.\n\nEssential Functions:\nMarshalls aircraft on the ramp including directing, assisting and parking all arriving, departing and towed aircrafts in accordance with safety policy and procedures.\nPerforms wing walker duties to protect the aircraft wing from equipment in the path of pushback and maintains visual contact with the pushback driver to alert the driver of any danger.\nLifts, loads/unloads, sorts and transfers passenger baggage, airmail, freight and company material in and out of aircraft bins, belt loader or baggage carts in a safe manner and within specific time constraints.\nMaintains safety and security of the ramp at all times and complies with safety procedures and station policies.\nReads and verifies the city and flight number for every bag to ensure correct loading of customer bags.\nCommunicates with Operations, Flight Crew personnel and other ground personnel concerning arrival/departure information in a professional manner.\nDrives/operates ramp equipment, including but not limited to bag tugs, belt loaders, aircraft tow tractors and water and lavatory servicing vehicles in a safe manner.\nServices aircraft as needed to include cleaning lavatories and cabin and restocking items.\nArrives to work on time and at assigned post to ensure prompt servicing of the aircraft and on time departures.\nMay work in the baggage make-up area and prioritize baggage load for delivery to the proper aircraft for loading.\nEnsures GSE equipment is in proper working order.\nOther duties as assigned.\n\nThis description is intended to provide guidelines for job expectations and the employee's ability to perform the position described. It is not intended to be construed as an exhaustive list of all functions, responsibilities, skills and abilities. Particular functions, tasks and requirements may vary or be added depending upon the location and operational requirements. The text on this site does not represent a contract of employment and the company reserves the right to change this job description and/or assign tasks for the employee to perform, as the Company may deem appropriate.\n\nDAL Global Services is an Equal Opportunity Employer Minorities/Females/Protected Vets/Disabled\n\n\nPrimary Location United States of America-California-San Diego\nStarting Hourly Rate 12.00"}, {"title": "Driver Technician", "company": "PSAV", "location": "San Diego, CA 92111", "job url": "https://www.indeed.com/rc/clk?jk=6ec9b15f33ac990e&from=vj&pos=top", "description": "PSAV is a top international provider of professional event technology services, and stands on a 75-year record of success and growth. We strive to deliver flawless execution with a hospitality approach, for all event technology services. Our mission is to turn ordinary meetings into extraordinary events.\n\nDrive (90%)\n\nAbility to drive and deliver audio visual equipment; also set up and operate.\n\nAsset Maintenance (5%)\n\nMaintain inventory and overall appearance of the warehouse.\nJob Scheduling (5%)\n\nAssist warehouse coordinator in job scheduling.\n\nRequired Skills\nJob Requirements\n\nHigh School Diploma or Equivalent\nValid Drivers License and clean driving record\nComputer Skills\nCustomer service skills\nBasic Audio Visual Experience\n\n\nJob Location\nSan Diego,California,US\n\nPosition Type\nFull-Time/Regular"}, {"title": "Grocery Stocker", "company": "Grocery Outlet Santee", "location": "Santee, CA", "job url": "Not Available", "description": "Part-timeWe at Grocery Outlet Santee are always looking for that one individual that will go above and beyond. If you have what it take to become a valuable asset to our company, apply today!POSITION: Grocery StockerJOB DESCRIPTIONAt Grocery Outlet Santee, we're all about saving the customers money. We aim to make sure our customers save 40-70% on everyday grocery needs. As a Grocery Stocker, your job will consist of a wide variety of responsibilities that range from receiving trucks to stocking. The full list is as follows...StockingQuality Control (FIFO)Inventory ControlKeeping a clean and safe workplace.REQUIREMENTSRequirements for this job will be as follows...Minimum 2 years of stocking experience.Minimum 1 year of merchandising experienceMust be able to lift over 50 lbs.Able to have morning availabilityShifts normally begin at 7 AMThis job is a PART-TIME Position and start at minimum wage. There is room to grow at our store.Job Type: Part-timeExperience:Stocking: 2 years (Required)Merchandising: 1 year (Preferred)Education:High school or equivalent (Required)License:Drivers (Required)Work authorization:United States (Required)Shifts:Morning (Required)"}, {"title": "Personal Driver", "company": "Altair Investment Company", "location": "Los Angeles, CA 90064", "job url": "Not Available", "description": "$13 - $15 an hourPart-timePersonal Driver needed, Clean Driving Record. Company Car provided to drive.Needs to be reliable and on time.2 days a month. Different Locations. Generally Santa Monica to Ontario, Anaheim and Torrance and back to Santa Monica. 8:30 am to 6:00 pm. First and Third Wed of the month.___________________________Company manages industrial real estate., More time and more responsibilities possible, depending on candidate's ability to operate independently and range of skills.___________________________Job Type: Part-timeSalary: $13.00 to $15.00 /hourExperience:driving: 5 years (Required)Education:Associate (Required)License:Driver's License (Required)Language:English (Required)Work authorization:United States (Required)"}, {"title": "Personal Driver", "company": "Martin Insurance Group", "location": "Township of Cranbury, NJ", "job url": "https://www.indeed.com/rc/clk?jk=ecd1fd579a6c6b8b&from=vj&pos=top", "description": "Martin Insurance Group is looking for a responsible person with a clean driving record to work as a personal driver. The qualified candidate would be driving the Executive's personal vehicle. The person must be available to work a flexible schedule. Advance notice is given for the majority of appointments; however, there could be some last minute appointments as well.\n\nResponsibilities would include: taking vehicles for service or to the car wash, driving the Executive, his family members, and anyone else he approves to the airport, professional and/or social functions as well as any other function that is needed. The individual must have a good knowledge of New York City and live local to South Brunswick/Cranbury area. Qualified candidates should send resumes to: resumes@martinins.com."}, {"title": "Sign on Bonus *Non CDL* Independent Contractor/Delivery Driver (MF)", "company": "TopHAT Logistical Solutions", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=145b95f58329cdbe&from=vj&pos=top", "description": "We are looking for Contract Carriers for Home Delivery of Mattresses in San Diego, CA.\nPotential to Gross over $145,000/year\nUp to $1500 Sign-On BONUS\n\nLocal deliveries (no overnight travel), competitive revenue potential with route guarantees.\nJob Summary:\n\nThe qualified candidate for this position will make deliveries to residential customers with a focus on timeliness and customer service. The Delivery team will off-load materials at each stop, deliver and place products to the customers specifications.\n\nIf you are a motivated self-starter and are interested in learning more about becoming an independent contractor, TopHAT is for YOU!\n\nJob Duties and Requirements:\n\nOutstanding customer service and communication skillsMust be able to work independently and manage time appropriately to meet deadlinesValid Drivers LicenseChauffer License required (operating a vehicle between 16,0001 and 26,000 lbs)Must be able to lift at least 50 lbs or more.Must be able to pass background and drug test\nPrevious or current Owner/Operator status is a PLUS\n\nAccess a 26' Box Truck\n2 man team required.\n\nIf you have experience with in-home delivery of furniture or other goods and/or are mechanically inclined and focused on customer service, please forward your contact information by clicking on the following link: https://tophatls.recruiterbox.com/jobs/fk01qe6?cjb_hash=O_DJZf16&apply_now=true"}, {"title": "Amazon Delivery Driver", "company": "Velocity Transport", "location": "San Diego, CA", "job url": "Not Available", "description": "$15 - $17 an hourPart-timeVelocity Transport LLC is currently hiring full time and part time delivery drivers. Working days consist of approximately 10 hours/day and must have a flexible schedule (operate 7 days a week)Ideal Candidate: Hard working individual ready to workMust meet companies expectations every working dayReliable and Energetic: Attendance is extremely importantTeam player: May be required to help your fellow team members in order to finish out the dayGreat communication skills: Must be able to communicate with management at all timesSafe driver: No previous driving experience required but is a plusMust be able to work a smartphone and gps systemQualifications Must be 21 years old with a valid drivers licenseClean driving recordMust be able to pass a background and drug testAble to lift up to 50lbs.Job Type: Full-timeSalary: $15.00 to $17.00 /hourExperience:delivery Driver: 1 year (Preferred)License:Driver's License (Required)Trucking freight handling:Load/unload by handTrucking payment:HourlyTrucking route:Local"}, {"title": "Driver", "company": "Keolis Transit America", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=9d44f75e3ff59412&from=vj&pos=top", "description": "$800 a weekPart-timeDRIVERS WANTED!\n\nRide Share Drivers: Are you tired of driving 60 hours a week and not making what you want? Our drivers make $800 a week.\n\nDrive a brand new vehicle and be part of a groundbreaking, first of its kind, on-demand shared ride alternative transportation solution here in Orange County!\n\nFull and Part Time positions available.\n$14 per hour to start.\nWe are actively seeking drivers for this Micro-Transit program that kicks off on 7/1/18.\nThis is NOT a bus route  it is on-demand curb to curb pick up and drop off at homes, malls, shopping, entertainment, employment and connectivity to other transit options.\nNo experience necessary  free training provided.\nNo special Drivers License required.\nService areas within 5 miles of Westminster Mall in Westminster, Bella Terra Mall in Huntington Beach and The Shops at Mission Viejo.\nIdeal for retirees and housewives or anyone who enjoys riding around with new friends and neighbors.\nTo learn more about this ground floor opportunity, dont delay, apply today!"}, {"title": "Driver/Sales", "company": "Vista Piant", "location": "San Diego, CA", "job url": "Not Available", "description": "$29,000 - $31,000 a year) hide this posting craigslist - Map data  OpenStreetMap270 N. El Camino Real(google map)compensation: $13 to $14 per houremployment type: full-timeVista Paint Corporation, a leading manufacturer, distributor, and retailer of high quality paints and sundries, is seeking a Driver/Sales for our Encinitas retail store.MUST BE 21 YEARS OF AGE OR OLDER. Minimum (5) years driving experience. 'C' license required. CLEAN DRIVING RECORD WITH NO POINTS.The Driver/Sales position works flexible hours and shifts scheduled and determined by business needs at the time. This means you must be available to work on Saturdays.The Driver/Sales will adhere to all driving safety laws and regulations. Drives company owned stake bed truck. Loads and unloads trucks for deliveries to customers' homes and contractor work sites. When not making deliveries, you will work in the store assisting customers, taking orders, answering phones. You MUST BE ABLE TO LIFT UP TO 75 POUNDS on a regular basis. Paint experience a plus.We consider applicants for all positions on the basis of qualifications and without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.Job Type: Full-timeSalary: $29,000.00 to $31,000.00 /yearExperience:driving: 5 years (Required)License:Driver's License (Required)"}, {"title": "Driver", "company": "Dodge Data &amp; Analytics", "location": "Calexico, CA 92231", "job url": "Not Available", "description": "Are you looking to put your superior driving skills to good use? Do you have an extensive track record of clean and safe operation, timely delivery, and dependability? If so, then this driver position could be perfect for you. Successful drivers communicate clearly to the customer, deliver product on time and safely, and perform these roles while properly managing their time.The ideal driver candidate will also handle a family in driving.Job ResponsibilitiesCoordinate paperwork for the truck manifest on each trip using the companys software system before leaving the facility.Transport deliveries safely to their destination locations on time. As part of this duty, verify shipping loads against the paperwork and obtain signatures for materials when they are delivered.Determine the most efficient route to destinations to ensure timely delivery.Maintain records of routes and times in accordance with state and federal law, as well as company policy.Inspect and maintain the truck and all related equipment, putting in repair requests as necessary to maintain safe operation.Operate warehouse equipment, including vehicles, in a way that facilitates the loading and unloading of the truck while observing all safety regulations and manufacturers safety instructions for that equipment.Take on material handling duties as necessary to complete the delivery of necessary materials to destination locations, including handling materials during loading and unloading.Relay customer feedback, including concerns, complaints, damaged deliveries, returns, and competitive knowledge whenever it is presented.Job Skills & QualificationsAt least one year of professional driving experienceAbility to pass the DOT medical exam and Commercial Motor Vehicle CertificationAbility to operate warehouse equipment, including pallet jacks, floor lifts, and forkliftsStrong oral and written communication skillsCustomer service skillsJob Type: Full-timeExperience:customer service: 1 year (Preferred)"}, {"title": "Vending Route Driver", "company": "Brec Vending", "location": "Corona, CA", "job url": "Not Available", "description": "$10.50 - $15.00 an hourCommissionEmployee needs to be responsible, ethical, bilingual is a plus.No experience necessary, will train.Job Types: Full-time, CommissionSalary: $10.50 to $15.00 /hourExperience:customer service: 1 year (Preferred)License:Class A (Preferred)Language:English (Required)Work authorization:United States (Required)"}, {"title": "Parts Delivery", "company": "O&#39;Reilly Auto Parts", "location": "Encinitas, CA 92024", "job url": "https://www.indeed.com/rc/clk?jk=1448ed64a62322b8&from=vj&pos=top", "description": "Part-timeDesired: Driver's LicenseCustomer ServiceOur Parts Delivery drivers provide excellent customer service through the safe and efficient delivery of parts and products to our professional customers using a company provided vehicle. Our drivers are a lso responsible for the cleanliness and standard maintenance of delivery vehicles as well as observing company safety procedures. You will ensure efficient deliveries by quality checking orders t hat ultimately gets our products in the hands of our customers.\nQualifications\n\nMust have a valid driver's license with an acceptable motor vehicle record (MVR) per department standards\nExcellent customer service skills\nAbility to thrive in a busy, fast-paced retail environment"}, {"title": "Driver Technician", "company": "PSAV", "location": "San Diego, CA 92111", "job url": "https://www.indeed.com/rc/clk?jk=6ec9b15f33ac990e&from=vj&pos=top", "description": "PSAV is a top international provider of professional event technology services, and stands on a 75-year record of success and growth. We strive to deliver flawless execution with a hospitality approach, for all event technology services. Our mission is to turn ordinary meetings into extraordinary events.\n\nDrive (90%)\n\nAbility to drive and deliver audio visual equipment; also set up and operate.\n\nAsset Maintenance (5%)\n\nMaintain inventory and overall appearance of the warehouse.\nJob Scheduling (5%)\n\nAssist warehouse coordinator in job scheduling.\n\nRequired Skills\nJob Requirements\n\nHigh School Diploma or Equivalent\nValid Drivers License and clean driving record\nComputer Skills\nCustomer service skills\nBasic Audio Visual Experience\n\n\nJob Location\nSan Diego,California,US\n\nPosition Type\nFull-Time/Regular"}, {"title": "Remote Desktop Support Specialist", "company": "Remote PC Support", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=ff240bdc4a2078e3&from=vj&pos=top", "description": "Desired: CompTIA A+MCPCompTIA Security+Remote Access SoftwareTroubleshootingMCSECustomer ServiceCompTIA Network+WindowsThe remote desktop support specialist is responsible for providing our customers with desktop support and administration of computing hardware and software.\n\nThis position requires a self paced and motivated individual that will work independently to support our customers on windows based operating systems including Windows Xp, Vista, Windows 7 and 8 desktops, WAN/LAN routing and desktop security on a case by case basis.\n\nPrimary Responsibilities:\nResponsible for the installation and configuration of:\nHardware drivers\nSoftware & Utilities\nProductivity Applications\nResponsible for software updates and upgrades\nManage and install all operating system patches and updates\nResponsible for assisting customers with the installation, configuration and troubleshooting of the following types of hardware:\nPrinters (Wired and wireless)\nScanners\nDigital cameras\nPDA and smartphones\nConduct and maintain an accurate inventory of user hardware and RF equipment via helpdesk\nResponsible for troubleshooting end user and network problems, and diagnosing the source of the problem to provide a resolution or next steps\nProvide documented follow-up to all open trouble tickets and escalate where required\nMaintain accurate system policies/procedures and perform responsibilities according to the processes developed by our corporate staff\nResponsible for submission of all service requests for new equipment, software, associate moves, adds or changes to our current infrastructure configuration\nBe proactive in recommending improvements in procedures that will increase the efficiency of the facility and staff members in regards to IT related technical issues and processes\n\nMinimum Requirements:\nMCSE, MCP, A+, Network+ Security+\nGood PC technical and troubleshooting skills\nFamiliar with networking hardware/concepts\nExtensive experience with Windows operating systems from Windows XP to current\nThorough understanding and solving printer issues\nWork well with all levels of the corporate IS department\nExcellent communication and customer service skills\nBe able to work independently\n\nMinimum Technical Requirements:\nMust have a reliable high-speed Internet connection (Minimum 1MB DSL or higher)\nMust have a windows based desktop or laptop with a minimum of Windows Xp and 2GB or RAM\nMust have a land-line or cell phone to communicate with RemotePcSupport.com helpdesk staff."}, {"title": "Delivery Driver", "company": "OrangeCrate", "location": "Ramona, CA", "job url": "Not Available", "description": "ContractOrangeCrate is looking to partner with self-employed delivery professionals for restaurant food deliveries. We are looking to partner with drivers in the Ramona, CA area. It's a great opportunity for anyone looking for flexibility in their work schedule, any day of the week. Work when you want, start earning when you deliver. Drivers earn a delivery fee and keep all the tips they make.If you really excel at this, have great customer service skills and love doing this, we have separate positions for crew leaders to coordinate teams of drivers in new territories we are establishing.Requirements:CarSmartphone19+ years of ageValid driver's licensePass background and DMV checkPrevious delivery experience not required, but we would love to hear from you if you've worked for other delivery services like Postmates, Instacart, Eat24, Amazon and Uber.Job Type: ContractLocation:Ramona, CA (Required)License:Driver's License (Required)"}, {"title": "Z\\xc5\\xabm Driver, San Diego", "company": "Zum", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=6a186f3cb2326c76&from=vj&pos=top", "description": "$32 an hourContractZm is the leader in children's transportation and care, having driven kids over 2 million miles and counting. Become a part of this emerging field now, building an online presence on Zm that will give you the inside track to work today and in the future.\n\nZm is looking exclusively for drivers with caregiving experience. Apply your coveted and highly appreciated skills to support parents and enrich children's lives. This is an ideal opportunity for teachers/substitute teachers, nannies/babysitters, parents/stay-at-home moms, eldercare professionals, graduate students, professionals with spare time (musicians, baristas, coaches, retailers, etc.). Put your valuable child care or parenting experience to work in a specialized area of today's fast-growing ride-sharing industry.\n\nWe also invite drivers who have worked through Uber, Lyft, DoorDash, Amazon, Google and other ridesharing companies to apply.\n\nThis is a contract position with the potential to earn $32 per hour plus $500 bonus.\n\nDrive kids to-and-from school & activities through Zm, while working around your schedule!\n\nYou'll get:\n\nGreat pay\nFlexible hours\nRegular schedule driving the same children\nSatisfaction of helping busy families\n\nRequired:\n\n21+ years old\nHave 3+ years of childcare or parenting experience\nOwn a 2006+ 4-door vehicle\nHave an excellent driving record\n\n"}, {"title": "Driver", "company": "Glidewell Dental", "location": "Irvine, CA", "job url": "https://www.indeed.com/rc/clk?jk=db61f4427e46741b&from=vj&pos=top", "description": "Desired: CDL BDriver's LicenseGlidewell Laboratories is the industry leader in dental technology due to our agility, speed, and cutting edge technology. We work in a fast-paced and highly sought-after employee-friendly work environment. Behind all of this success is an amazing group of people who are passionate about bringing innovation to the marketplace, while providing quality and affordability to better the lives of people all over the world. If you share in our passion for teamwork and a vision for excellence, let's talk about a rewarding career at Glidewell! In addition are the following generous employee benefits: Medical, Dental, Vision, 401K with company match, company-paid life insurance, additional onsite dental services, vacation, holiday, and sick time, employee gym (with fitness classes and meditation room), employee medical/wellness center (with massage therapy and acupuncture), two company subsidized cafes, Internet cafes, employee lounges with big screen TVs, game tables, fun company sponsored events, a diverse work environment with over forty nationalities represented, and much more!\n\nWe offer the following generous benefits:\nMedical\nDental\nVision\n401K with company match\nCompany-paid life insurance\nVacation, holiday, and sick time\nEmployee gym (with fitness classes and meditation room), employee medical/wellness center (with massage therapy and acupuncture), and two company subsidized cafes\nDuties:\nProvides general transportation assistance to employees, company guests, and others as directed.\nProvides transportation services for managers and office visitors as assigned.\nPerforms cleaning, maintenance of all vehicles\nPerforms parking lot checks to ensure all parked cars contain a visible parking permit\nWrites company-specific parking tickets\nRequirements:\nHolds a valid class B driver's license\nHolds a valid medical certification"}, {"title": "Driver (Ready Logistics)", "company": "Cox Automotive", "location": "Oceanside, CA", "job url": "https://www.indeed.com/rc/clk?jk=a91ba01a277fae5a&from=vj&pos=top", "description": "Part-timeDescription\n\nJob Scope\nOperate vehicles (driving, parking and staging) in support of sale day events and general auction operations. Includes movement of vehicles on auction property.\n\nKey Responsibilities\nOperate all vehicles in a safe manner and in compliance with all applicable company policy and procedures and traffic laws and regulations\nObserve rules of the road and demonstrate courtesy and defensive driving techniques\nDrive assigned vehicles through auction lanes on sale days\nDrive and park vehicles on auction property\nDrive vehicles to and from customer dealerships and other customer locations as assigned\nAlign and park vehicles in proper order as directed\nProvide assistance in movement of inoperable vehicles when directed\nProvide direct customer service to dealer reps, account representatives, rental agents, etc., as required\nComply with all jobs related safety and health procedures\nPerform other job related duties as assigned by supervisor\n\n\nQualifications\n\nEducation & Specialized Knowledge\nHigh School Diploma or equivalent preferred\nValid Driver's License\nAbility to drive vehicles with standard or automatic transmission\nExperience\nPrevious automotive auction experience preferred\n\n\nAbout Cox Automotive\nCox Automotive Inc. makes buying, selling and owning cars easier for everyone, while also enabling mobility services. The global companys 34,000-plus team members and family of brands, including Autotrader, Clutch Technologies, Dealer.com, Dealertrack, Kelley Blue Book, Manheim, NextGear Capital, VinSolutions, vAuto and Xtime, are passionate about helping millions of car shoppers, tens of thousands of auto dealer clients across five continents and many others throughout the automotive industry thrive for generations to come. Cox Automotive is a subsidiary of Cox Enterprises Inc., a privately-owned, Atlanta-based company with revenues exceeding $20 billion. www.coxautoinc.com\nCox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nStatement to ALL Third-Party Agencies and Similar Organizations: Cox accepts resumes only from agencies with which we formally engage their services. Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.\n\nOrganization: Cox Automotive\n\nPrimary Location: US-CA-Oceanside-4691 Calle Joven\n\nEmployee Status: Regular\n\nJob Level: Individual Contributor\n\nShift: Day Job\n\nTravel: No\n\nSchedule: Part-time\n\nUnposting Date: Ongoing"}, {"title": "Flower Shop Delivery Driver", "company": "Florabella", "location": "San Diego, CA 92109", "job url": "Not Available", "description": "$11.50 an hourPart-timePart time delivery driver needed for busy flower shop in Bay Park Area.Clean driving record and current driver's license required.Knowledge of San Diego a plus.$11.50 to start but will increase.Good communication, neat appearance and problem solving skills requested.Some heavy lifting required.Varied shifts available - please list your available days/times.Email or apply in person5555 Santa Fe st Ste ESan Diego, CA 92109Job Type: Part-timeSalary: $11.50 /hourLicense:Driver's License (Required)Trucking freight handling:Load/unload by handTrucking payment:HourlyTrucking route:Local"}, {"title": "Driver", "company": "HCR ManorCare Inc.", "location": "Palm Desert, CA 92260", "job url": "https://www.indeed.com/rc/clk?jk=63e1196e1273715d&from=vj&pos=top", "description": "Description\n\nHCR ManorCare provides a range of services, including skilled nursing care, assisted living, post-acute medical and rehabilitation care, hospice care, home health care and rehabilitation therapy. The Driver is responsible for transporting residents to and from designated locations safely. This position requires tact, sensitivity, and professionalism due to the constant interaction with residents and families to guarantee their satisfaction. As the Driver, you are a member of the Resident Programs Team. The Resident Programs Director is the coordinator of this team. Assisting in planning transportation schedule to meet needs of residents. Maintaining vehicle in good working condition. Maintaining a clean work environment at all time. Providing travel information Running errands as necessary In return for your expertise, you'll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.\n\nLocation\n\n489 - ManorCare Health Services - Palm Desert , California\n\nEducational Requirements\n\nHigh School Diploma or GED.\n\nPosition Requirements\n\nMinimum of two years experience in a customer service position. Valid state driver?s license (Class II) and clean DMV record."}, {"title": "Parts Driver", "company": "Cardinale Automotive Group", "location": "Corona, CA", "job url": "Not Available", "description": "Our well-established dealership in Corona, CA is hiring a Parts Delivery Driver.We offer a highly competitive pay structure, superior benefits package, and advancement opportunities.BenefitsMedical, Dental and Vision PlanRetired (401k) PlanCareer Paths and Paid TrainingFamily Owned and OperatedGreat Atmosphere and Team MembersJob Duties:Organize a schedule of daily deliveries to maximize efficiencyMaintain an accurate log of daily deliveries, pick-ups, payments and CODsCoordinate routine maintenance and cleaning of delivery vehicleOther duties as assignedJob Qualifications:Clean Driving RecordShipping and Receiving experience preferredExcellent communication skills both written and verbalA team player focused on providing exemplary serviceProfessional appearance and work ethicCurrent valid drivers license and satisfactory Motor Vehicle Report (MVR)Equal Employment Opportunities (EEO)Job Type: Full-timeExperience:Packaging: 1 year (Preferred)Clean Driving Record: 1 year (Required)License:Driver's License (Required)Work authorization:United States (Required)"}, {"title": "Delivery Driver", "company": "OrangeCrate", "location": "Ramona, CA", "job url": "Not Available", "description": "ContractOrangeCrate is looking to partner with self-employed delivery professionals for restaurant food deliveries. We are looking to partner with drivers in the Ramona, CA area. It's a great opportunity for anyone looking for flexibility in their work schedule, any day of the week. Work when you want, start earning when you deliver. Drivers earn a delivery fee and keep all the tips they make.If you really excel at this, have great customer service skills and love doing this, we have separate positions for crew leaders to coordinate teams of drivers in new territories we are establishing.Requirements:CarSmartphone19+ years of ageValid driver's licensePass background and DMV checkPrevious delivery experience not required, but we would love to hear from you if you've worked for other delivery services like Postmates, Instacart, Eat24, Amazon and Uber.Job Type: ContractLocation:Ramona, CA (Required)License:Driver's License (Required)"}, {"title": "Snow Plow Driver", "company": "TPSJ Inc.", "location": "Tahoe City, CA", "job url": "Not Available", "description": "$2,500 - $3,500 a monthPlow snow blower operator position open full time, prefer heavy equipment operation experience we Use Holder municipal tractors in multi hug municipal tractors with snowblower attachments clearing driveways position requires for more information please contact us.Job Type: Full-timeSalary: $2,500.00 to $3,500.00 /monthExperience:Snow Plowing: 1 year (Preferred)Location:Tahoe City, CA (Preferred)"}, {"title": "Driver", "company": "PARADISE VALLEY HOSPITAL", "location": "National City, CA 91950", "job url": "https://www.indeed.com/rc/clk?jk=238087a7ee80e6b3&from=vj&pos=top", "description": "Performs work in the operation of a vehicle to assure safe transportation of patients to and from various destinations and to assist patients on entry and exit from vehicles as necessary. Coordinates with other departments to provide maximum level of service to patients. Performs semi-skilled trades and duties of general maintenance as directed for operation of the vehicle.\n\n1. High School diploma or equivalent required.\n2. Current Class B driver's License with passenger endorsement when driving vehicles with more than 10 seats.\n3. No DUI or reckless driving violation in the past three (3) years and maintaining an average of less than 3 points at all times.\n4. Must be 21 years of age.\n5. Current BCLS (AHA) upon hire and maintain current, required."}, {"title": "Shuttle Driver", "company": "Sycuan Band of the Kumeyaay Nation", "location": "El Cajon, CA", "job url": "Not Available", "description": "Desired: Guest ServicesDriver's LicenseBilingualPassenger EndorsementCDL AImmediate Full Time Openings for Shuttle Drivers at Sycuan Casino!Hourly Compensation: DOE + Tips, Benefits, PTO and More!SHUTTLE DRIVER-TransportationJob Purpose: Transports guests and team members to and from assigned destinationsJob Duties and Responsibilities: (Note: Duties and responsibilities may be added, deleted, or changed at the sole discretion of Sycuan Management at any time)Provides transportation to casino, resort, and reservation team members and guests by picking up and dropping off passengers to assigned destinations. - 60%Provides guest service by greeting internal and external guests in a friendly and courteous manner, answering general inquiries, and assisting guests as needed. - 20%Maintains cleanliness and operation of shuttles by cleaning and sweeping vehicles as needed, recording operational defects and maintenance needs into log book, and submitting request for necessary repairs to the Transportation Service Specialist. - 20%Job Specifications: Education and Experience:Essential:California Class A or B Drivers License with 15+ Passenger EndorsementThe ability to obtain an Air Brakes endorsement and no weight restriction within six (6) months of transfer or hire dateDMV record in good standingDesirable:Guest service experienceHigh School Diploma or G.E.D.Skills and Knowledge:Essential:Ability to interact effectively with team members and guestsAbility to communicate effectively in the English LanguageAbility to sit for up to eight hours at a timeAbility to appear for work on timeAbility to maintain professionalism and composureAbility to understand and follow verbal directives and written directionsAbility to accept constructive criticismDesirable:Multi-lingualSupervisory/Managerial Accountability: Direct: NoneIndirect: NoneIf you enjoy being part of a community dedicated to creating a memorable guest experience, we invite you to explore career opportunities with Sycuan and join our winning teamJob Type: Full-timeLicense:Class A or B CA DL with 15+ Passenger Endorsement (Required)"}, {"title": "Amazon", "company": "Letter Ride LLC", "location": "Carlsbad, CA", "job url": "https://www.indeed.com/rc/clk?jk=d2e90a801045c82b&from=vj&pos=top", "description": "We are currently hiring for Delivery Drivers in Carlsbad, CA\n\nIf youre looking for a fast-paced working environment with potential advancement possibilities, then were looking forward to you joining our TEAM.\n\nIdeal candidates would have:\nGreat communication skills - Sense of urgency and willingness to help others\nAble to withstand consistent physical activity throughout the entire shift\nFlexible schedule: we operate 7 days a week\nStrong work ethic and dependability\nTeam Player with positive attitude\nBusiness driven  We want our employees to have a sense of pride and strive for personal as well as company growth. Our current management staff has been exclusively assembled from within.\nRequirements:\n23 years of age or older\nPass a background and drug test\nClean driving record\nAbility to lift a minimum of 50 lbs.\nOperate a large cargo van\nWork in various weather conditions.\nNo delivery experience required, but its definitely welcomed\nEssential duties and Responsibilities:\nLoad the van accurately and safely for deliveries.\nDeliver packages to customers residences or businesses\nAble to finish their own route within a 10hr shift\nRescue other drivers when needed.\nPerform all duties to department standard and/or as directed by leadership.\nMust adhere to regulatory, department and company policies.\nPerform all job duties in a safe and responsible manner.\nPerform other job related and compatible duties as assigned.\nCompany offers:\n4 days 10-hour shifts\nMedical, Dental and Vision benefits\n401k plan\nPaid sick leave\nDirect deposit\nFlexible Schedule\nThank you and we hope to hear from you soon!\n\nLetter Ride LLC."}, {"title": "Z\\xc5\\xabm Driver, San Diego", "company": "Zum", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=6a186f3cb2326c76&from=vj&pos=top", "description": "$32 an hourContractZm is the leader in children's transportation and care, having driven kids over 2 million miles and counting. Become a part of this emerging field now, building an online presence on Zm that will give you the inside track to work today and in the future.\n\nZm is looking exclusively for drivers with caregiving experience. Apply your coveted and highly appreciated skills to support parents and enrich children's lives. This is an ideal opportunity for teachers/substitute teachers, nannies/babysitters, parents/stay-at-home moms, eldercare professionals, graduate students, professionals with spare time (musicians, baristas, coaches, retailers, etc.). Put your valuable child care or parenting experience to work in a specialized area of today's fast-growing ride-sharing industry.\n\nWe also invite drivers who have worked through Uber, Lyft, DoorDash, Amazon, Google and other ridesharing companies to apply.\n\nThis is a contract position with the potential to earn $32 per hour plus $500 bonus.\n\nDrive kids to-and-from school & activities through Zm, while working around your schedule!\n\nYou'll get:\n\nGreat pay\nFlexible hours\nRegular schedule driving the same children\nSatisfaction of helping busy families\n\nRequired:\n\n21+ years old\nHave 3+ years of childcare or parenting experience\nOwn a 2006+ 4-door vehicle\nHave an excellent driving record\n\n"}, {"title": "LONG BEACH PORT DRIVER", "company": "CAROLINA TRUCKING", "location": "San Diego, CA", "job url": "Not Available", "description": "$900 - $1,100 a week#1 DRAYAGE COMPANY IN SAN DIEGOIS LOOKING FOR QUALIFIED CLASS A DRIVERS WITH VALID TWIC CARD (IF YOU DON'T HAVE IT WE CAN HELP YOU GET IT!)What do you need?- Valid Class A Licence- Valid TWIC Card (We can help you get it and reimburse you for the cost 3 to 4 weeks to receive it)- 2 years minimum driving experience- Long Beach Port Experience not needed but welcomedWhat do we offer?- Work 5 days a week- Medical Insurance Benefits- Driver Incentive Program- Great Working Atmosphere- Day and Night shifts available- Call now start working immediatelyTWIC CARD INFORMATIONhttps://www.tsa.gov/for-industry/twicCALL ALEX 619-370-0803------------------------------------------------------------------------------------------------------------------------------------------------------------COMPAIA #1 EN MOVIMIENTOS DE CONTENEDORES DE SAN DIEGOESTA BUSCANDO CHOFERES CLASE A CALIFICADOS CON TARJETA TWIC VALIDA (SI NO LA TIENES TE AYUDAMOS A CONSEGUIRLA!!)Que necesitas?- Licencia Clase A- TWIC Valida (Te ayudamos con el proceso y te regresamos el costo 3 a 4 semanas en completarse)- Minimo 2 aos de experiencia manejando- Experiencia para puerto de Long Beach no necesaria pero bienvenidaQue ofrecemos?- Trabaja 5 dias de la semana- Aseguranza Medica- Programa de incentivos- Gran ambiente de trabajo- Turnos de dia y noche disponibles- Llama hoy empieza a trabajar rapidamente!INFORMACION TARJETA TWIChttps://www.tsa.gov/for-industry/twicLLAMAR A ALEX 619-370-0803Job Type: Full-timeSalary: $900.00 to $1,100.00 /weekExperience:Driving: 2 years (Required)License:CDL Class A (Required)"}, {"title": "Patient Transporter/Tech Aide", "company": "Sharp and Childrens MRI Center, LLC", "location": "San Diego, CA 92123", "job url": "https://www.indeed.com/rc/clk?jk=bf1e44384ac94f30&from=vj&pos=top", "description": "Position Title: Patient Transporter/Tech Aide\nStatus: Non-Exempt\nReports to: Nursing Supervisor\nUnder the supervision of the Nursing Supervisor and Technologist Aide Lead works to ensure patient comfort and safety while transporting patients to and from the MRI Center; delivers MRI reports to patient?s charts, files MRI reports and films, maintains supplies and linens, assists front desk during the evening hours when appropriate or necessary, and performs other related duties as required. Under the supervision of the technologists, nurses, and medical director, provides general assistance to patients and technologists. Assists in scan room preparation, clearing, and cleaning, scanning pertinent patient information into Sharp PACs system (Synapse) or Children?s PACs system (Amicas), and burning images to CDs. Other related duties as required.\nEssential Job Functions\nPerforms all duties for the safe and prompt delivery of patients to and from the MRI Center.\nCalls respective patient nursing station at least 15 minutes prior to scheduled exam time to ensure readiness of patient and prompt delivery of patient to the MRI Center.\nCommunicates with front desk receptionist, nurse, and technologist regarding patient pick-up times.\nChecks for special instructions (oxygen requirements, mode of transportation, etc.) in order to ensure rapid delivery of patient with special attention to the individual patient?s case.\nConfirms method of transport and special needs.\nCopies all required materials from patient?s chart and distributes properly.\nEnsures patient is properly identified (check ID bands).\nScreens patients and visitors for any circumstances that would indicate a potential hazard to the patient or visitors in preparation of the MRI scan, i.e., verbally asks, at the very least, whether the patient or visitor(s) has a cardiac pacemaker, an intracranial aneurysm clip, or has ever had a metal injury to the eye.\nStays in constant communication with the technologists at the OPP in order to pick up exams as they are completed and give to transcriptionists.\nUnderstands and can assist in scheduling procedures, patient check-in, and receptionist duties when receptionists are unavailable or during the evening hours.\nStocks linens appropriately.\nCollects soiled linens on a regular basis and places in proper soiled linen bin.\nAssists and maintains order and cleanliness of dressing rooms and restrooms.\nCommunicates information as required maintaining good relationships with all employees\nKnows and understands all safety procedures in relation to: fire code, code blue, magnet safety, lifting and transferring technique, and materials/supplies within the MRI Center relative to patient and staff safety.\nAttends educational programs as needed.\nAssists in training of new employees as needed.\nConducts self in such a manner as to always represent the MRI Center in a positive light.\nDoes not gossip, participate in gossip, or promote gossip in any form. Any viable information that needs to be transmitted should be so transmitted to one?s supervisor.\nStays aware of the type of next exam and is able to set up the scan room for appropriate scans.\nClears and cleans the scan room after each exam.\nScans pertinent patient information into Synapse or Amicas.\nBurns CDs as required.\nDevelops film when necessary\nPerforms other related duties as required by the supervisor or as required.\n\nPhysical Demands/Work Environment\n\n1. Exposure to strong static magnetic field (1.5 Tesla or greater)acknowledgement of this environment is a condition of employment\n2. Work environment maybe stressfulacknowledgement of this fact is a condition of employment.\n3. Ability to perform moderate to heavy lifting and patient transfer, as well as assisting patients.\n4. Ability to use keys on a computer terminal keyboard.\n5. Ability to perform CPR.\n6. Must be able to remain calm and courteous during all contact with all patients and relatives and other staff.\n7. Must possess excellent organizational skills.\n8. Ability to work independently and within prescribed exam times.\n9. Frequently walks to other departments and hospital areas.\n10. Ability to bend, stoop, and reach to retrieve and stock supplies in cabinets.\n11. Must be able to read, write, and record information in detail.\n12. Must be able to meet safety standards for entering and working in the strong magnet field (no cardiac pacemakers, metallic particles in the eye(s), intracranial aneurysm clips, etc.)\n13. Must have ability to push or pull 100 to 200 pounds.\n14. Must have full range of motion.\n\nQualifications\n\n1. High school graduate or equivalent\n2. Patient transport experience preferred.\n3. Medical terminology preferred.\n4. Clerical ability preferred.\n5. Good telephone and public manners.\n6. Certification in CPR.\n7. Must complete all background checks, DMV and drug screenings and vaccinations required by Rady Children's Hospital and Sharp HealthCare.\n8. Must have a valid driver's license.\n9. Must complete a motor vehicle record check as required by SCMRI's vehicle safety program."}, {"title": "Delivery Driver", "company": "FinishMaster", "location": "Vista, CA", "job url": "https://www.indeed.com/rc/clk?jk=eac001f3c8bf543b&from=vj&pos=top", "description": "Overview\n\n\n\nAs a delivery driver for FinishMaster, you will be responsible for the accurate, efficient and professional delivery of product to our customers in the Vista, CA area.\nResponsibilities\nAbility to legally and physically drive delivery vehicle in order to deliver product to customer.\nPresent self in a professional, courteous and businesslike manner to customers.\nMake sure that charge invoices are signed and one copy of the invoice is left with the customer and know and follow Store invoice procedure.\nUse caution when driving and choosing where to park company vehicle before entering a shop. Avoid any areas that may cause congestion or interfere with the shop or their customers traffic flow.\nCheck all orders against invoices for accuracy.\nReport any maintenance/mechanical problems with company vehicle, to supervisor.\nTake precautionary safety measures for any leaking or damaged material immediately and notify store manager as soon as possible; and know and follow DOT requirements.\n\nThis list may not be inclusive of the total scope of job functions to be performed. Duties and responsibilities may be added, deleted or modified at any time\n\nAs a full-time FinishMaster employee you are eligible for a competitive benefits package including:\n\n Employee discounts & assistance\n program\n\n Medical, dental, and vision plans\n\n Life insurance & short-term disability\n\n Pet insurance\n\n Paid time off & holiday pay\n\n 401K Contributions and Investments\n\nQualifications\nEducation:\nHigh school diploma or equivalent with general education emphasis\nExperience:\nPrior delivery experience with successfully demonstrated interpersonal communication skills\nOther Requirements:\n\nThe qualifications listed above are intended to represent the minimum skills and experience levels associated with perofrming the duties and responsibilities in this job description. The qualifications should not be viewed as expressing absolute employment or promotional standards, but as general guidelines that should be considered along with other job-related selection or promotional criteria.\nValid Driver's License\nMotor Vehicle Record must meet minimum requirements per FinishMaster's Vehicle Fleet Safety Policy\nPhysical Requirements (This job may require the ability to perform any of the essential functions contained in this description. These may include, but are not limited to, the following requirements. Specific requirements for a job will be identified at the time of employment. Reasonable accommodations will be made for otherswise qualified applicants unable to fulfill one or more of these requirements):\nAbility to drive a delivery vehicle legally\nAbility to frequently lift, carry, otherwise move and position objects weighing up to 45 pounds when picking inventory for delivery, making delivery or stocking product\nAbility to bend, stoop and crouch on a regular basis to pick inventory for delivery, making delivery or stock product\nAbility to sit for long periods of time while driving to make deliveries\nWorking Conditions:\nWorks in store conditions\nDaily travel/driving to customers locations, as required\n\nFinishMaster, Inc. is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law."}, {"title": "Driver", "company": "Premier Pharmacy Services", "location": "Baldwin Park, CA 91706", "job url": "Not Available", "description": "We are looking for motivated individuals to join our team as delivery associates. Please review the details below and contact us by replying to this posting.Driver with good driving record needed.Must be able to work independently within specific time frame given.Pass background verification.Punctuality is a must.Part Time and Full Time positions available.Fast paced pharmacy always hiring friendly and energetic team members, looking for a challenge with the potential for growth.Serious applicants only!Job Type: Full-timeExperience:Driving: 2 years (Preferred)License:CDL Class C (Required)"}, {"title": "Driver", "company": "SD&#39;S PARK SHUTTLE &amp; FLY", "location": "San Diego, CA 92101", "job url": "https://www.indeed.com/rc/clk?jk=e69e907394be80ec&from=vj&pos=top", "description": "$11.50 - $12.00 an hourSan Diego's Park Shuttle & Fly in San Diego, CA is the only local and family owned Airport parking facility servicing the San Diego International Airport. We are looking to fill the position of Shuttle Driver to join our 19 person strong team. We are located on 3405 Pacific Highway. Our ideal candidate is self-driven, ambitious, and reliable. Positions open vary from graveyard shift to day shifts and evening shifts. Any and all shifts are available for both part time and/or full time. As driver you make hourly wage a cash tips!\n\nResponsibilities\n\n\nStrong customer service skills *Drive safely in various weather conditions *Load and unload customer luggage *Complete and maintain driver logs and reports\n\nQualifications\n\n\nSafe driving record *Valid Driver's License *Exceptional customer service skills *Ability to work well under little to no supervision\n\nWe are looking forward to reading your application. Please contact me for more information.\n\nSincerely,\n\nAl Cruz - (619) 843-0178\n\nAvailable shifts and compensation: Available shifts on Sundays. Compensation is $11.50 - $12.00/hour.\n\nAbout SD'S PARK SHUTTLE & FLY: We are a family-owned and operated airport parking lot conveniently located just across the street from the SAN Airport. We offer affordable airport parking and free airport shuttle services to and from the airport. Our mission is make your traveling stress free without having to worry about the safety of your car in our fully fenced parking facility. Learn more about us at www.sdparkshuttlefly.com."}, {"title": "Driver I- Full-Time", "company": "Gulf Coast Regional Blood Center", "location": "Los Angeles, CA", "job url": "https://www.indeed.com/rc/clk?jk=a43623befa7ac94c&from=vj&pos=top", "description": "Under supervision of Hospital Services Manager, the Driver I will transport blood from donor sites to Component Laboratory and also conduct the delivery of blood components to designated locations while maintaining proper record keeping.\nESSENTIAL DUTIES AND RESPONSIBILITIES include the following; other duties may be assigned. Management retains the discretion to add to or change the duties of the position at any time.\nDeliver blood components to and return from designated locations.\nPerform visual inspections and verify numbering/labeling/appearance of all units selected for delivery to ensure quality control standards are met.\nPlace returned units on designated observation shelves, notifying supervisor or laboratory personnel of any abnormalities.\nPerform the Stoplight computer check on each consignment delivered to ensure the product is within acceptable date ranges and all products from that consignment are in the delivery.\nProperly complete all required paperwork documents for consignment and return of blood components to designated locations.\nEnsure compliance with acceptability standards as set forth in the Vehicle Safety and Loss Control Policy, Standard Operating Procedures Manual and various other policies, procedures and protocol.\nSUPERVISORY RESPONSIBILITIES\nThis job has no supervisory responsibilities.\nEDUCATION AND EXPERIENCE\nHigh School Diploma or GED; No previous experience or training required.\nCERTIFICATES, LICENSES, REGISTRATIONS\n***Valid Texas Driver's License (TDL) plus acceptable driving record.**\nMust meet standards of The Blood Centers Vehicle Safety Program\nOTHER SKILLS AND ABILITIES\nExcellent internal and external customer service skills.\nHigh degree of attention to detail and paperwork functions.\nAbility to comply with FDA guidelines regarding Standard Operating Procedures and Quality Control policies when facilitating blood component distribution.\nMust be able to work under high stress at a fast pace.\nMust be flexible with working hours and days.\nComputer Literate: Must be familiar with using computers.\nPOSITION DRIVING STATUS\nRoutine Driver\nPHYSICAL DEMANDS\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly required to stand; walk; sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl; and talk or hear. The employee must regularly lift and/or move up to 50 pounds.\nEmployees are required to be familiar with and abide by the team lift requirements as specified in the Safety Program. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.\nWORK ENVIRONMENT\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly exposed to toxic or caustic chemicals, outside weather conditions, extreme cold, and blood and/or blood components, as well as any other biohazard materials. The noise level in the work environment is usually moderate.\nJob duties involve an inherent potential for mucous membrane or skin contact with blood with a risk of exposure to Hepatitis and HIV."}, {"title": "hungr delivery driver", "company": "Hungr", "location": "San Diego, CA", "job url": "Not Available", "description": "$12 - $20 an hourContracthhungr the nation's leading online and mobile food ordering company, is looking for delivery drivers to deliver food from popular local restaurants. It's quick and easy to EARN BIG!Why Partner with hungr?Earn money for each delivery mile + 100% of your tipsMake a guaranteed hourly minimum* (varies by market)Join the platform with the highest satisfaction among driversCreate your own schedule and deliver when you want!All you need to get started: Car (or a bike in select markets)Smartphone19+ years of ageValid driver's license & auto insuranceHow it worksAccept orders in the Rapid Drivers appPick up food at nearby restaurantsDeliver to hungry dinersNo previous delivery experience required!Delivery drivers must have a valid driver's license, 2 years of U.S. driving experience, a clean driving record and minimum auto insurance. Delivery partners will use their own iPhone or Android phone and their data and text plan. Previous delivery experience is not required, but we encourage drivers and bikers from other delivery or ridesharing services such as UberEATS, Sprig, Caviar, Munchery, Eat24, DoorDash, Google Express, AmazonFresh, Instacart, Lyft, Grubhub, Maple, Munchery, Amazon and Uber. Let's get you on the road. Apply today!Hourly minimum if requirements met.Job Type: ContractSalary: $12.00 to $20.00 /hourLicense:Driver's License (Required)Language:English (Required)Trucking freight handling:Some touch freightTrucking payment:Per tripTrucking route:Local"}, {"title": "Driver/Chauffeur Needed Day &amp; Night Shift", "company": "Cfcase Solutions Inc", "location": "Salt Lake City, UT", "job url": "Not Available", "description": "$1,200 - $2,500 a weekPart-timeResponsibilities:- Chauffeur corporate clients to meetings and events- Must be a professional and safety minded driver- Provide excellent customer service in every interactionQualifications:- Must be at least 21 years of age- Must have at least one year of professional driving experience- Acceptable Motor Vehicle Record- Enjoy people and excel at customer service- Professional appearance and positive attitude- Able to communicate proficiently in English- Able to work independently, yet able to take direction- Valid Drivers License.Job Types: Full-time, Part-timeSalary: $1,200.00 to $2,500.00 /weekExperience:Driving: 1 year (Preferred)License:Driver's License (Preferred)"}, {"title": "LOCAL DRIVER SD", "company": "CAROLINA TRUCKING", "location": "San Diego, CA", "job url": "Not Available", "description": "$900 - $1,100 a week#1 DRAYAGE COMPANY IN SAN DIEGOIS LOOKING FOR QUALIFIED CLASS A DRIVERS WITH VALID TWIC CARD (IF YOU DON'T HAVE IT WE CAN HELP YOU GET IT!)What do you need?- Valid Class A Licence- Valid TWIC Card (We can help you get it and reimburse you for the cost 3 to 4 weeks to receive it)- 2 years minimum driving experience- Long Beach Port Experience not needed but welcomedWhat do we offer?- Work 5 days a week- Medical Insurance Benefits- Driver Incentive Program- Great Working Atmosphere- Day and Night shifts available- Call now start working immediatelyTWIC CARD INFORMATIONhttps://www.tsa.gov/for-industry/twicCALL ALEX 619-370-0803------------------------------------------------------------------------------------------------------------------------------------------------------------COMPAIA #1 EN MOVIMIENTOS DE CONTENEDORES DE SAN DIEGOESTA BUSCANDO CHOFERES CLASE A CALIFICADOS CON TARJETA TWIC VALIDA (SI NO LA TIENES TE AYUDAMOS A CONSEGUIRLA!!)Que necesitas?- Licencia Clase A- TWIC Valida (Te ayudamos con el proceso y te regresamos el costo 3 a 4 semanas en completarse)- Minimo 2 aos de experiencia manejando- Experiencia para puerto de Long Beach no necesaria pero bienvenidaQue ofrecemos?- Trabaja 5 dias de la semana- Aseguranza Medica- Programa de incentivos- Gran ambiente de trabajo- Turnos de dia y noche disponibles- Llama hoy empieza a trabajar rapidamente!INFORMACION TARJETA TWIChttps://www.tsa.gov/for-industry/twicLLAMAR A ALEX 619-370-0803Job Type: Full-timeSalary: $900.00 to $1,100.00 /weekExperience:Driving: 2 years (Required)License:Class A CDL (Required)"}, {"title": "Port Driver SD", "company": "Carolina Trucking Inc.", "location": "San Diego, CA", "job url": "Not Available", "description": "$900 - $1,100 a week#1 DRAYAGE COMPANY IN SAN DIEGOIS LOOKING FOR QUALIFIED CLASS A DRIVERS WITH VALID TWIC CARD (IF YOU DON'T HAVE IT WE CAN HELP YOU GET IT!)What do you need?- Valid Class A Licence- Valid TWIC Card (We can help you get it and reimburse you for the cost 3 to 4 weeks to receive it)- 2 years minimum driving experience- Long Beach Port Experience not needed but welcomedWhat do we offer?- Work 5 days a week- Medical Insurance Benefits- Driver Incentive Program- Great Working Atmosphere- Day and Night shifts available- Call now start working immediatelyTWIC CARD INFORMATIONhttps://www.tsa.gov/for-industry/twicCALL ALEX 619-370-0803------------------------------------------------------------------------------------------------------------------------------------------------------------COMPAIA #1 EN MOVIMIENTOS DE CONTENEDORES DE SAN DIEGOESTA BUSCANDO CHOFERES CLASE A CALIFICADOS CON TARJETA TWIC VALIDA (SI NO LA TIENES TE AYUDAMOS A CONSEGUIRLA!!)Que necesitas?- Licencia Clase A- TWIC Valida (Te ayudamos con el proceso y te regresamos el costo 3 a 4 semanas en completarse)- Minimo 2 aos de experiencia manejando- Experiencia para puerto de Long Beach no necesaria pero bienvenidaQue ofrecemos?- Trabaja 5 dias de la semana- Aseguranza Medica- Programa de incentivos- Gran ambiente de trabajo- Turnos de dia y noche disponibles- Llama hoy empieza a trabajar rapidamente!INFORMACION TARJETA TWIChttps://www.tsa.gov/for-industry/twicLLAMAR A ALEX 619-370-0803Job Type: Full-timeSalary: $900.00 to $1,100.00 /weekExperience:commercial driving: 2 years (Required)"}, {"title": "Driver", "company": "HCR ManorCare Inc.", "location": "Palm Desert, CA 92260", "job url": "https://www.indeed.com/rc/clk?jk=63e1196e1273715d&from=vj&pos=top", "description": "Description\n\nHCR ManorCare provides a range of services, including skilled nursing care, assisted living, post-acute medical and rehabilitation care, hospice care, home health care and rehabilitation therapy. The Driver is responsible for transporting residents to and from designated locations safely. This position requires tact, sensitivity, and professionalism due to the constant interaction with residents and families to guarantee their satisfaction. As the Driver, you are a member of the Resident Programs Team. The Resident Programs Director is the coordinator of this team. Assisting in planning transportation schedule to meet needs of residents. Maintaining vehicle in good working condition. Maintaining a clean work environment at all time. Providing travel information Running errands as necessary In return for your expertise, you'll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.\n\nLocation\n\n489 - ManorCare Health Services - Palm Desert , California\n\nEducational Requirements\n\nHigh School Diploma or GED.\n\nPosition Requirements\n\nMinimum of two years experience in a customer service position. Valid state driver?s license (Class II) and clean DMV record."}, {"title": "Wholesale Driver", "company": "Walter&#39;s Auto Group", "location": "Riverside, CA", "job url": "https://www.indeed.com/rc/clk?jk=8b3c5000a81934d0&from=vj&pos=top", "description": "Walter's Auto Group has been a staple in the Riverside area for over 50 years.\n\nCandidate with automotive dealership experience are encouraged to apply. However, we're open to non-experienced candidates as well. Candidates that have worked in retail, hospitality or the service industry are encouraged to apply.\n\nWe aren't like most dealerships; we have a close-knit, open communication team environment. You will have leadership's support and transparency when it comes to your career growth here. Endless income potential with un-capped commission opportunities.\n\nWhat We Offer:\n\nPaid Training\nClear promotion track + growth from within\nFlexible scheduling if you need it\n401k\nMedical, Dental, Vision\n\nThis position requires the skill, ability, and willingness to:\n\n\nFlexible to be on-call, ability to work some weekends and alternative shifts\nExperience in a fast-paced, ambiguous environment and be highly adaptable and willing to take the initiative on key projects and programs\nAble to lift 50 lbs.\nGet hands dirty when needed; minor car maintenance, changing tires, cleaning cars, delivering cars, adjusting parking signage, inspecting garages and parking spots etc.\nSolve problems creatively, think outside-the-box, and make quick decisions using sound judgment\nGather, analyze, and understand data to make recommendations to optimize vehicle usage\n\nFleet Responsibilities:\nInclude but are not limited to the following:\n\nAssist in the management of a large wholesale of vehicles\nField inquiries regarding the vehicles and assist our members/drivers where possible\nAssist with inventory management and supply chain activities in preparation for delivering vehicles to markets or business partners; ensure vehicles are properly outfitted and ready before they are released for use\nPerform light maintenance and field related tasks as required, e.g. shuttling vehicles, jumping dead batteries, changing tires and adding vehicle branding\nManage the upkeep, maintenance, repair and cleanliness of vehicles though use of administrative systems\nAssist in oversight of vendor performance to maximize vehicle condition, uptime and minimize costs\nAnalyze wholesale damage reports to ensure damage is properly billed and coded\nInteract with parking vendors and locations team to ensure proper distribution of vehicles\nPerforms audits on vehicle condition, vendor performance, and garage conditions\n\nQualifications:\n\nValid Drivers License and clean driving record\nHigh school diploma required\nExperience in fast-paced, rapidly evolving environment\nComfortable with technology and new systems in vehicles\nFlexible, ability to multi-task\nCustomer oriented, customer service background\nWell organized\n\n"}, {"title": "Driver (Ready Logistics)", "company": "Cox Automotive", "location": "Oceanside, CA", "job url": "https://www.indeed.com/rc/clk?jk=a91ba01a277fae5a&from=vj&pos=top", "description": "Part-timeDesired: Driver's LicenseDescription\n\nJob Scope\nOperate vehicles (driving, parking and staging) in support of sale day events and general auction operations. Includes movement of vehicles on auction property.\n\nKey Responsibilities\nOperate all vehicles in a safe manner and in compliance with all applicable company policy and procedures and traffic laws and regulations\nObserve rules of the road and demonstrate courtesy and defensive driving techniques\nDrive assigned vehicles through auction lanes on sale days\nDrive and park vehicles on auction property\nDrive vehicles to and from customer dealerships and other customer locations as assigned\nAlign and park vehicles in proper order as directed\nProvide assistance in movement of inoperable vehicles when directed\nProvide direct customer service to dealer reps, account representatives, rental agents, etc., as required\nComply with all jobs related safety and health procedures\nPerform other job related duties as assigned by supervisor\n\n\nQualifications\n\nEducation & Specialized Knowledge\nHigh School Diploma or equivalent preferred\nValid Driver's License\nAbility to drive vehicles with standard or automatic transmission\nExperience\nPrevious automotive auction experience preferred\n\n\nAbout Cox Automotive\nCox Automotive Inc. makes buying, selling and owning cars easier for everyone, while also enabling mobility services. The global companys 34,000-plus team members and family of brands, including Autotrader, Clutch Technologies, Dealer.com, Dealertrack, Kelley Blue Book, Manheim, NextGear Capital, VinSolutions, vAuto and Xtime, are passionate about helping millions of car shoppers, tens of thousands of auto dealer clients across five continents and many others throughout the automotive industry thrive for generations to come. Cox Automotive is a subsidiary of Cox Enterprises Inc., a privately-owned, Atlanta-based company with revenues exceeding $20 billion. www.coxautoinc.com\nCox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nStatement to ALL Third-Party Agencies and Similar Organizations: Cox accepts resumes only from agencies with which we formally engage their services. Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.\n\nOrganization: Cox Automotive\n\nPrimary Location: US-CA-Oceanside-4691 Calle Joven\n\nEmployee Status: Regular\n\nJob Level: Individual Contributor\n\nShift: Day Job\n\nTravel: No\n\nSchedule: Part-time\n\nUnposting Date: Ongoing"}, {"title": "Driver (Ready Logistics)", "company": "Cox Automotive", "location": "Oceanside, CA", "job url": "https://www.indeed.com/rc/clk?jk=a91ba01a277fae5a&from=vj&pos=top", "description": "Part-timeDesired: Driver's LicenseDescription\n\nJob Scope\nOperate vehicles (driving, parking and staging) in support of sale day events and general auction operations. Includes movement of vehicles on auction property.\n\nKey Responsibilities\nOperate all vehicles in a safe manner and in compliance with all applicable company policy and procedures and traffic laws and regulations\nObserve rules of the road and demonstrate courtesy and defensive driving techniques\nDrive assigned vehicles through auction lanes on sale days\nDrive and park vehicles on auction property\nDrive vehicles to and from customer dealerships and other customer locations as assigned\nAlign and park vehicles in proper order as directed\nProvide assistance in movement of inoperable vehicles when directed\nProvide direct customer service to dealer reps, account representatives, rental agents, etc., as required\nComply with all jobs related safety and health procedures\nPerform other job related duties as assigned by supervisor\n\n\nQualifications\n\nEducation & Specialized Knowledge\nHigh School Diploma or equivalent preferred\nValid Driver's License\nAbility to drive vehicles with standard or automatic transmission\nExperience\nPrevious automotive auction experience preferred\n\n\nAbout Cox Automotive\nCox Automotive Inc. makes buying, selling and owning cars easier for everyone, while also enabling mobility services. The global companys 34,000-plus team members and family of brands, including Autotrader, Clutch Technologies, Dealer.com, Dealertrack, Kelley Blue Book, Manheim, NextGear Capital, VinSolutions, vAuto and Xtime, are passionate about helping millions of car shoppers, tens of thousands of auto dealer clients across five continents and many others throughout the automotive industry thrive for generations to come. Cox Automotive is a subsidiary of Cox Enterprises Inc., a privately-owned, Atlanta-based company with revenues exceeding $20 billion. www.coxautoinc.com\nCox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nStatement to ALL Third-Party Agencies and Similar Organizations: Cox accepts resumes only from agencies with which we formally engage their services. Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.\n\nOrganization: Cox Automotive\n\nPrimary Location: US-CA-Oceanside-4691 Calle Joven\n\nEmployee Status: Regular\n\nJob Level: Individual Contributor\n\nShift: Day Job\n\nTravel: No\n\nSchedule: Part-time\n\nUnposting Date: Ongoing"}, {"title": "Driver", "company": "Los Angeles Community Hospital at Bellflower", "location": "Bellflower, CA", "job url": "https://www.indeed.com/rc/clk?jk=f1d2696c026d98a6&from=vj&pos=top", "description": "Driver\n\nWe are hospitals and affiliated medical groups, working closely together for the benefit of every person who comes to us for care. We build comprehensive networks of quality healthcare services that are designed to offer our patients highly coordinated, personalized care and help them live healthier lives. Through collaboration, we strive to provide all of our patients and medical group members with the quality, affordable healthcare they need and deserve.\n\nThe Driver is responsible for picking up patients and safely driving them to and from appointments in the Los Angeles area via company non-emergency medical transportation vehicle.\n\nJob Responsibilities/Duties\n\nUnder the general direction of the Department Director, the Driver provides patient transportation as may be required.\nDemonstrates knowledge and skills to provide care and services, based on physical psychosocial, education, safety, and related criteria, appropriate to the patient population served.\nAbility to interpret map with a good sense of direction.\nThe Driver reports to the Director of Transportation.\n\n\n\nQualifications\n\nMinimum Education: High School diploma or equivalent.\nMinimum Experience: Job-related experience a plus.\n\nReq. Certification/Licensure: Must have a Current Unrestricted CA drivers license. CPI Certification required. American Heart Association (BLS) preferred.\n\nEmployee Value Proposition\n\nProspect Medical Holdings, Inc., is guided by a diverse and highly experienced leadership core. This group maintains the vision that has made Prospect a needed difference-maker in the lives of so many patients today, and many executives contribute to our continued efforts. As a member of our highly effective team of professionals you will receive:\n\nCompany 401K\nMedical, dental, vision insurance\nPaid time-off\nLife insurance\n\n\n\nHow to Apply\n\nTo apply for this role, or search our other openings, please visit http://pmh.com/careers/ and click on a location to begin your journey to a new career with us!\n\nWe are an Equal Opportunity/ Affirmative Action Employer and do not discriminate against applicants due to veteran status, disability, race, gender, gender identity, sexual orientation or other protected characteristics. If you need special accommodation for the application process, please contact Human Resources.\n\nEEO is the Law: http://www1.eeoc. gov/employers/upload/eeoc_self_print_poster. pdf\n\nKeywords: Driver, Transportation, Patient Transportation, Patient Transporter, Driver License, Hospital Transportation, Car Driver.\n11056"}, {"title": "Ramp Agent", "company": "Delta Air Lines Global Services", "location": "Santa Ana, CA", "job url": "https://www.indeed.com/rc/clk?jk=4106dcde325b2566&from=vj&pos=top", "description": "Ramp Agent\n(Job Number: 01DJL)\n\nPosition Summary :\n\nUnder the supervision of the lead agent and/or supervisor on duty, Ramp Agents are responsible for marshalling aircraft in and out of the gate, loading, unloading and sorting freight, mail and baggage in a safe manner while also achieving on-time departures and arrivals. Ramp Agents may also be responsible for servicing aircraft lavatories, cleaning aircraft, restocking items, deicing and other duties as delegated.\n\nEssential Functions:\nMarshalls aircraft on the ramp including directing, assisting and parking all arriving, departing and towed aircrafts in accordance with safety policy and procedures.\nPerforms wing walker duties to protect the aircraft wing from equipment in the path of pushback and maintains visual contact with the pushback driver to alert the driver of any danger.\nLifts, loads/unloads, sorts and transfers passenger baggage, airmail, freight and company material in and out of aircraft bins, belt loader or baggage carts in a safe manner and within specific time constraints.\nMaintains safety and security of the ramp at all times and complies with safety procedures and station policies.\nReads and verifies the city and flight number for every bag to ensure correct loading of customer bags.\nCommunicates with Operations, Flight Crew personnel and other ground personnel concerning arrival/departure information in a professional manner.\nDrives/operates ramp equipment, including but not limited to bag tugs, belt loaders, aircraft tow tractors and water and lavatory servicing vehicles in a safe manner.\nServices aircraft as needed to include cleaning lavatories and cabin and restocking items.\nArrives to work on time and at assigned post to ensure prompt servicing of the aircraft and on time departures.\nMay work in the baggage make-up area and prioritize baggage load for delivery to the proper aircraft for loading.\nEnsures GSE equipment is in proper working order.\nOther duties as assigned.\nRequirements:\nMust possess a valid Drivers License for operating ground support equipment.\n\nThis description is intended to provide guidelines for job expectations and the employee's ability to perform the position described. It is not intended to be construed as an exhaustive list of all functions, responsibilities, skills and abilities. Particular functions, tasks and requirements may vary or be added depending upon the location and operational requirements. The text on this site does not represent a contract of employment and the company reserves the right to change this job description and/or assign tasks for the employee to perform, as the Company may deem appropriate.\n\nDAL Global Services is an Equal Opportunity Employer Minorities/Females/Protected Vets/Disabled\n\n\nPrimary Location United States of America-California-Santa Ana\nStarting Hourly Rate 13.00"}, {"title": "Route Trainee", "company": "UniFirst", "location": "San Diego, CA 92102", "job url": "https://www.indeed.com/rc/clk?jk=055b4f27e15d8357&from=vj&pos=top", "description": "UniFirst is seeking a driven customer focused Route Trainee to join the UniFirst family. As a Route Trainee, you will support the Service Department by helping Route Service Representatives with loading and unloading trucks, delivering and picking up customer products, maintaining vehicle safety, and covering assigned routes when needed. When covering routes, this individual will drive a company vehicle to and from customer stops along an assigned route. Routes are serviced daytime hours Monday through Friday because in the UniFirst culture, we believe nights and weekends should be reserved for personal and family time.\n\nThis position is ideal for individuals who prefer their work day to always be a little different and want to get their foot in the door to establish a career in Route Service. This individual may have the opportunity to move into a commissioned Route Service Representative position upon satisfactory performance reviews and appropriate tenure.\n\nWhats in it for you?\n\nTraining:\nOur Team Partners get quality skills training designed to enhance their performance and assist them with their career potential and advancement.\n\nCareer Mobility:\nSome companies like to promote from within, we love to! Nearly all our Senior Executives started at UniFirst in our Service Department.\n\nCulture:\nOur family culture is what makes UniFirst an organization that stands out from the rest. Did we mention no nights or weekends?\n\nDiversity:\nAt UniFirst, you'll find an environment packed with different cultures, personalities, and backgrounds because we believe it takes many kinds of people to make us successful.\n\nWhat youll be doing:\nService customers in a professional manner using effective communication skills and resolving customer issues\nEnsure accurate invoice inventories\nPerform inventory audits\nMaintain route vehicle reports, safety inspections and general appearance\nAttend daily account collections with Route Service Manager and assist with Account Receivable collections\n\nQualifications\nWhat were looking for:\n\nHigh school diploma or GED, some college is a plus\n21 years of age\nValid drivers license\nReliable transportation\nMust meet pre-employment DOT physical requirements\nPhysically capable of lifting up to 50 pounds\nCommunication and language skills\nBasic computer proficiency\nPrior customer service, route sales, delivery and/or entrepreneurial experience preferred\n\n\nBenefits & Perks\n401K with Company Match, Profit Sharing, Health Insurance, Employee Assistance Program, Life Insurance, Paid Time Off, Direct Payroll Deposit, Tuition Reimbursement, 30% Employee Discount, Employee Referral Bonuses.\n\nAbout UniFirst\nThe fabric of UniFirst is woven from its very unique family culture where our Team Partners enjoy a small company feel while taking advantage of the resources and stability that come with being a 1.5-billion-dollar organization.\nUniFirst is an international leader in the $18 billion-dollar garment services industry. We currently employ over 13,000 team partners who serve 300,000 business customer locations throughout the U.S., Canada, and Europe. We were included in the top 10 of Selling Power magazines Best Companies to Sell For list and recognized on Forbes magazines Platinum 400  Best Big Companies list. As an 80-year old company focused on annual growth, theres never been a better time to join our team.\n\nTheres a lot to love about UniFirst, where you come first.\n\nUniFirst is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, color, gender, national origin, ancestry, religion, physical or mental disability, age, veteran status, sexual orientation, gender identity or expression, marital status, pregnancy, citizenship, or any other factor protected by anti-discrimination laws"}, {"title": "Driver / Shipping and Receiving Clerk", "company": "SIMCO", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=34e5fb6529779333&from=vj&pos=top", "description": "Shipping and Receiving Position Overview\nReceive and ship equipment, parts, and supplies, ensuring all transactions are accurately documented. Also ensures shipments to customers or subcontracted vendors or transferred to other SIMCO locations are properly packaged to ensure safe transportation and arrival at the designated destination.\nResponsibilities and Duties\nOrganize and separate equipment for will call, cash on delivery, and shipment.\nUpdate the computer system with appropriate status of will call, cod, and shipped equipment.\nProcess appropriate documentation to the accounting, purchasing, and customer service departments.\nProperly package all equipment, requiring shipment, for transportation to customers/vendors to ensure it arrives undamaged.\nReject damaged goods or materials and correspondence with shipper to adjust damages or shortages.\nParticipate in the assembling and shipping of outgoing merchandise or material.\nPrint daily reports of outgoing shipments made on the FedEx and UPS systems.\nReceive in all materials (parts), subcontracted equipment, and customer equipment according to procedures, and distribute to the appropriate areas/employees.\nInitiate non-conformance documentation for damaged/incorrect materials (parts)/certification from vendor/subcontractor.\nMaintain well-organized files and records of transfers, UPS, FedEx, and airway bills shipped daily.\nUpdate the computer with the freight charges and airway bill numbers for customer shipments.\nStock all supplies and parts in designated places.\nMaintain accurate inventory of stockroom parts.\nMaintain safety standards and regulations by keeping the work area clean.\n\n\nQualifications\nMust be able to operate a personal computer, keyboard, and pointing device.\nKnowledgeable in the use of Windows, Word, Excel, Outlook, and Internet Browsers.\nKnowledgeable of incoming and final inspection practices.\nKnowledgeable of standard material handling and packaging practices.\nSkilled in use of foam in place packaging equipment.\nExperience working in shipping and receiving department.\nKnowledge of freight companies.\nKnowledge of the UPS, FedEx, Airborne Express shipping equipment (i.e. power ship and use of internet based shipping systems).\nFamiliar with FedEx, Airborne Express, and UPS online tracking systems.\nAbility to relate information clearly and concisely in English both orally and in writing.\n\n\nDriver Position Overview\nOn a daily basis, perform pick up and delivery of electrical and other equipment to and from the company facility.\nResponsibilities and Duties\nDrive company vehicles to conduct pick up and delivery of our customers equipment.\nAdequately load/pack the vehicles to ensure safe transportation and handling of all equipment.\nReview daily pick up and delivery paperwork to determine where the pick up and deliveries are to occur.\nReview and establish routes for pick up and deliveries.\nMaintain vehicles used by review of maintenance records and/or dates for vehicle maintenance for oil changes, tire rotations, etc.\nCommunicate conversationally and in writing with coherent sentence structure to/with employees.\nRegularly interact with customers, and with Customer Service Representatives; interaction normally involves exchange of factual information.\nProfessionally represent SIMCO Electronics and act as a liaison between customers and SIMCO Electronics.\n\n\nQualifications\nHigh School Diploma or GED.\nValid Drivers License.\nClean and satisfactory driving record.\nOne plus year of experience as a Driver.\nReasonable knowledge of the area/location routes, streets, highways, etc. and a good sense of direction.\nAbility to read and interpret maps, or Internet map sites such as Yahoo maps, Map quest, etc.\n\n\nPhysical Demands\nThe employee will be required to lift up to 50 lbs unaided. Occasional standing and bending are required.\nWorking Environment\nWork primarily consists of driving and performing pick up and deliveries. There will be time spent in a laboratory or manufacturing environment at a SIMCO location and or customer sites. Travel is required. Drivers may drive from one SIMCO laboratory to another, which could take about 4 or more hours a day.\nWhat We Offer\nFull-time, non-exempt position\nExcellent benefits package Employer paid medical, dental, vision, disability, life insurance, retirement plan, employee funded pre-tax health, child care spending accounts and tuition reimbursement\nPaid time off with vacation, sick and holiday leave\n\n\nSIMCO provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, SIMCO complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, and transfer, leaves of absence, compensation and training.\nAbout Us\nSIMCO Electronics is the leading provider of calibration and software services for test and measurement instruments used in technology organizations. To learn more about SIMCO Electronics visit our home page: https://www.simco.com/\nTo all recruitment agencies: SIMCO Electronics does not accept agency resumes. Please do not forward resumes to our jobs alias, SIMCO Electronics employees or any other company location. SIMCO Electronics is not responsible for any fees related to unsolicited resumes."}, {"title": "Driver", "company": "Premier Pharmacy Services", "location": "Baldwin Park, CA 91706", "job url": "Not Available", "description": "Desired: Clean Driving RecordDriving ExperienceCDL CWe are looking for motivated individuals to join our team as delivery associates. Please review the details below and contact us by replying to this posting.Driver with good driving record needed.Must be able to work independently within specific time frame given.Pass background verification.Punctuality is a must.Part Time and Full Time positions available.Fast paced pharmacy always hiring friendly and energetic team members, looking for a challenge with the potential for growth.Serious applicants only!Job Type: Full-timeExperience:Driving: 2 years (Preferred)License:CDL Class C (Required)"}, {"title": "LONG BEACH PORT DRIVER", "company": "CAROLINA TRUCKING", "location": "San Diego, CA", "job url": "Not Available", "description": "$900 - $1,100 a weekDesired: Driving ExperienceTWIC CardCDL A#1 DRAYAGE COMPANY IN SAN DIEGOIS LOOKING FOR QUALIFIED CLASS A DRIVERS WITH VALID TWIC CARD (IF YOU DON'T HAVE IT WE CAN HELP YOU GET IT!)What do you need?- Valid Class A Licence- Valid TWIC Card (We can help you get it and reimburse you for the cost 3 to 4 weeks to receive it)- 2 years minimum driving experience- Long Beach Port Experience not needed but welcomedWhat do we offer?- Work 5 days a week- Medical Insurance Benefits- Driver Incentive Program- Great Working Atmosphere- Day and Night shifts available- Call now start working immediatelyTWIC CARD INFORMATIONhttps://www.tsa.gov/for-industry/twicCALL ALEX 619-370-0803------------------------------------------------------------------------------------------------------------------------------------------------------------COMPAIA #1 EN MOVIMIENTOS DE CONTENEDORES DE SAN DIEGOESTA BUSCANDO CHOFERES CLASE A CALIFICADOS CON TARJETA TWIC VALIDA (SI NO LA TIENES TE AYUDAMOS A CONSEGUIRLA!!)Que necesitas?- Licencia Clase A- TWIC Valida (Te ayudamos con el proceso y te regresamos el costo 3 a 4 semanas en completarse)- Minimo 2 aos de experiencia manejando- Experiencia para puerto de Long Beach no necesaria pero bienvenidaQue ofrecemos?- Trabaja 5 dias de la semana- Aseguranza Medica- Programa de incentivos- Gran ambiente de trabajo- Turnos de dia y noche disponibles- Llama hoy empieza a trabajar rapidamente!INFORMACION TARJETA TWIChttps://www.tsa.gov/for-industry/twicLLAMAR A ALEX 619-370-0803Job Type: Full-timeSalary: $900.00 to $1,100.00 /weekExperience:Driving: 2 years (Required)License:CDL Class A (Required)"}, {"title": "hungr delivery driver", "company": "Hungr", "location": "San Diego, CA", "job url": "Not Available", "description": "$12 - $20 an hourContracthhungr the nation's leading online and mobile food ordering company, is looking for delivery drivers to deliver food from popular local restaurants. It's quick and easy to EARN BIG!Why Partner with hungr?Earn money for each delivery mile + 100% of your tipsMake a guaranteed hourly minimum* (varies by market)Join the platform with the highest satisfaction among driversCreate your own schedule and deliver when you want!All you need to get started: Car (or a bike in select markets)Smartphone19+ years of ageValid driver's license & auto insuranceHow it worksAccept orders in the Rapid Drivers appPick up food at nearby restaurantsDeliver to hungry dinersNo previous delivery experience required!Delivery drivers must have a valid driver's license, 2 years of U.S. driving experience, a clean driving record and minimum auto insurance. Delivery partners will use their own iPhone or Android phone and their data and text plan. Previous delivery experience is not required, but we encourage drivers and bikers from other delivery or ridesharing services such as UberEATS, Sprig, Caviar, Munchery, Eat24, DoorDash, Google Express, AmazonFresh, Instacart, Lyft, Grubhub, Maple, Munchery, Amazon and Uber. Let's get you on the road. Apply today!Hourly minimum if requirements met.Job Type: ContractSalary: $12.00 to $20.00 /hourLicense:Driver's License (Required)Language:English (Required)Trucking freight handling:Some touch freightTrucking payment:Per tripTrucking route:Local"}, {"title": "DRIVER", "company": "Ace Parking Management, Inc.", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=d40435326a57a13f&from=vj&pos=top", "description": "Part-timeJob Details\nDescription\nWhat you will be doing:\n\nProvide daily transportation of passengers and guests to and from designated areas.\nPerform pre and post inspection activities to ensure proper operating conditions. Adhere to all safety standards and guidelines, including Department of Transportation (DOT) guidelines.\nAssist passengers and luggage on and off the shuttle bus.\nPerform routine cleaning and bus maintenance activities, including refueling.\nWhat we are looking for:\n\nAn outgoing and enthusiastic personality\nA willingness to do whatever it takes to earn a Thank You.\nAn ability to work flexible shifts/hours, including days, evenings, weekends, and holidays\nAbility to lift at least 50 lbs.\nWhat you will receive in return:\n\n Flexible scheduling\nPossible Tips, depending on route.\nCompany provided benefits to eligible team members, such as paid vacation, sick, holidays as well as various insurance plans customized to meet your personal needs, including a 401k plan.\nBuilding of long-lasting friendships/relationships\nJob training and career development"}, {"title": "Valet Driver", "company": "Viejas", "location": "Alpine, CA", "job url": "https://www.indeed.com/rc/clk?jk=fab0cf1ce71abc33&from=vj&pos=top", "description": "Part-timeValet Driver\n\nViejas Casino and Resort is San Diegos newest 4-Diamond property. Excitement is in the air and we want you to be a part of it. Get behind the wheel and help drive us towards success! Are you ready? Viejas Casino wants positive and energetic people to join our Valet team. We are offering part time Valet positions. Our Valet is the first and last chance we get to show our guests world-class 4-Diamond service and it is a priority that we deliver.\n\nWe are looking for Drivers to not only park cars, but play a vital role on our team by greeting and thanking guests and welcoming guests back next time. In addition to providing safe and prompt valet service, Valet Drivers will also be responsible for providing information regarding any guest inquiries about amenities or promotions.\n\nViejas is a 24/7 operation, and we need Valet Drivers around the clock, so flexibility in schedules is a must. A Valid CA driver license, driving experience and a clean driving record are needed as well. Candidates must be able to drive manual transmissions. Valet Drivers will be on their feet all shift and will be required to run or jog to get cars for guests so this position is very physically demanding.\n\nWe offer great perks that feature competitive salary, rewards and incentives for top-notch performers, paid time off, 401(k), career advancement, tuition reimbursement, a wellness program and a variety of fun Team Member events.\n\nHeres a great opportunity to join one of the largest, and still growing, organizations in San Diego. Consider joining us by applying at: www.viejas.com/careers. Its not a gamble when you bet on Viejas, become a winner!\nRequired Skills\n\nRequired Experience"}, {"title": "Route Driver", "company": "Canteen Vending Services", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=869494021044afd1&from=vj&pos=top", "description": "$13 an hourDo you have Retail, Warehouse, Stocking, or Physical experience and looking for a GREAT Job?\nApply today and interview this week!\n$13/ hour plus overtime.\nFull Time with great benefits\nPaid Training\nThe Canteen Office Coffee Route drives a company box truck vehicle over an established route to deliver product and render services at client locations. This position stocks and maintains pantry kitchens while maintaining a strong focus on providing an exceptional customer experience.\nWork Schedule: Monday - Friday, 4:00am - 2:00pm ** PAID OVERTIME\nLoading products and delivering to client locations.\nProvide client and customer satisfaction in every aspect of job performance.\nRequirements\nMust have a Valid Driver's License for 3 years\nMust be able to lift 50lbs\nBenefits\nComprehensive training\nAdvancement opportunities\nWorking in a fast paced environment\nWorking independently\nProviding excellent customer service to established customers\nBuilding relationships"}, {"title": "OBS TRAINEE", "company": "Amtrak", "location": "New York, NY 10001", "job url": "https://www.indeed.com/rc/clk?jk=74c73f56771e3047&from=vj&pos=top", "description": "Your success is a train ride away.\n\nAmtrak connects businesses and communities across the country and we move Americas workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees.\n\nAre you ready to join our team?\n\nSUMMARY OF DUTIES:\nThis position will report to the NEC Operations OBS manager, sign in at the front desk in the NY crew base and proceed directly to the enroute cleaners supply room.\n\nESSENTIAL FUNCTIONS:\nResponsible for stocking his/her cleaning kit before making his/her assignment\nResponsible for monitoring the coaches and restrooms to ensure they are in compliance with all Amtrak and FDA standards\nMust make the standardized announcement for cleaners on every assigned train before going through the coaches to pick up trash and refresh restrooms\nMust wipe down all surfaces in every restroom and use the prescribed toilet brush to refresh the toilets\nIf necessary, the air freshener dispenser must be refreshed (in 30 day intervals) while cleaning the bathrooms\nAll items in the restroom should be restocked (topped off) in every on-board restroom\nAll mark off's and known lateness must be communicated to the crew base and CMC in a timely manner\nAll timesheets must be signed and verified by the conductor working each specific assigned train\nCleaners must strictly comply with Amtrak's uniform and grooming standards\nMust be able to make prescribed public address announcements on-board the trains in a clear and understandable manner\n\nCOMMUNICATION AND INTERPERSONAL SKILLS:\nMust have excellent oral and written communication skills\n\nSUPERVISORY RESPONSIBILITIES:\nNo\n\nCandidates who apply to this posting may be contacted now or at a later date when a position becomes available.\nRequisition ID:38742\nPosting Location(s):New York\nJob Family/Function:Transportation\nRelocation Offered:No\nTravel Requirements:Up to 100%\n\nAmtrak employees power our progress through their performance.\n\nWe want your work at Amtrak to be more than a job  we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals.\n\nWe proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities.\n\nAll positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. We appreciate your cooperation in keeping Amtrak safe and drug-free.\nIn accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions.\nNote that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.\nAmtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status.\n\nPOSTING NOTES: Transportation || On Board and Station Services"}, {"title": "Resale Store Driver/Cashier", "company": "Hospice of Havasu", "location": "Lake Havasu City, AZ", "job url": "https://www.indeed.com/rc/clk?jk=2f3f34195d44e61d&from=vj&pos=top", "description": "Desired: Basic Computer SkillsDriver's LicenseReady for a life-changing career? Ready to work with a great team that is able to help so many people in our communities. Look no further than a career with Hospice of Havasu:, this is an organization where your great care and compassion will make a difference every day.\n\nWe offer excellent benefits for full time employment including medical with an HSA, dental, vision, term life insurance, voluntary life insurance, 401(K), tuition reimbursement, vacation, PTO, and award-winning Wellness program.\n\nHospice of Havasu is serving more patients and families each day, and we are now adding to our all of our teams. If this is what you are looking for, come join our caring team!:\n\nThis position is Full Time:.\n\nGENERAL JOB SUMMARY:\nThis position is responsible for assisting in the day-to-day operations of Hospice of Havauss donation based resale store. The job does include making trips to pick up new and used merchandise from the community. It is important in this position to maintain positive relationships with donors, volunteers and store customers. Excellent customer services skills are a must. The Resale Store Assistant recognizes how the Resale Store benefits patients and families of Hospice of Havasu. This positon has no supervisory responsibility.\nESSENTIAL FUNCTIONS :\nGreet and assist customers in a courteous and friendly manner.\nAttend the stores front desk and work the cash-register for customer purchases as assigned.\nAssist with making transportation arrangements for picking up and delivering merchandise as assigned.\nProvide a supportive and sensitive approach to those making merchandise donations.\nHandle the movement of goods in a safe and secure manner.\nSort through donated goods removing items that are unsuitable for purchase as assigned.\nAssist with inventory control and the management of donations.\nAssist with stocking supplies where indicated.\nPut equipment and supplies away after use.\nAssist with developing creative strategies for displaying merchandise by promoting, rotating, and arranging items in organized manner.\nMust be able to drive and operate any Hospice of Havasu vehicle safely as to not harm yourself, fellow employees, customers, customer property, and the general public.\nLoad, transport, and deliver furniture and various other donated items from customers or businesses in a timely, friendly and courteous manner.\nAssist with creating and maintaining a safe, clutter-free and hazard-free store environment.\nAssist with cleaning common areas, restrooms, outdoor walkways and receiving areas as assigned.\nDust, sweep, clean and relocate store items as assigned.\nAssist with maintaining an attractive front store and organized back store environment.\nCollaborate and communicate effectively as part of the team to establish and maintain cooperative working relationships.\nAttend all in-service trainings as scheduled.\nPractice safety in the workplace.\nReport any unsafe conditions to the supervisor in a timely manner.\nKeep Resale Store Manager fully informed.\nFluency in the English language.\nAbility to position self to move about, ascend, descend or traverse, transport, operate, activate, use, prepare, inspect or detect, perceive, identify, recognize, observe, inspect and assess are required. Ability to convey, communicate, speak clearly and exchange information, converse with, discern, and express oneself.\nJOB REQUIREMENTS AND QUALIFICATIONS:\nEducation::\nHigh School Diploma or GED Certificate\nTraining Requirements: (Credentials, licenses or certificates):\nExperience::\nOne year retail sales experience preferred.\nCurrent, valid drivers license\nA maximum of two or fewer minor moving violations, or a combination of one at fault accident and minor moving violations in the past three years and no major violations in the past three years (see Policy #127 for a list of major violations)\nAbility to lift, move, push and pull up to 50 pounds repeatedly, prolonged sitting\nKnowledge Requirements:\nHospice philosophy of care preferred.\nKnowledge and support of agencys safety and OSHA policies.\nDemonstrated understanding and compliance with agency policies, continuing education, work schedules and required HR documents.\nCustomer service principles.\nSkills and Ability::\nStructure and content of English language including the meaning and spelling of words, alphabetization, rules of composition and grammar.\nCalculate general math computations.\nAbility to run a cash system-POS register.\nAbility to make change with cash.\nComputer literate in basic software packages.\nRead and interpret directions on labeling.\nProblem solving skills.\n Utilize proper body mechanics and safe working techniques.\nDemonstrated Behavioral Competencies::\nMaintain professional boundaries with customers, patients, families, community, staff and volunteers.\nWork with diverse social and economic situations without imposing own values.\nManage stress in a healthy way.\nSensitivity to others.\nSensitivity to confidential matters.\nAcceptance of diversity.\nMaintain cultural competency and humility.\nPositive, professional attitude and appearance.\nEthical and honest.\nSelf-management with minimal supervision."}, {"title": "Patient Transport Driver Bella Sera", "company": "Ridgecrest Regional Hospital", "location": "Ridgecrest, CA 93555", "job url": "https://www.indeed.com/rc/clk?jk=2b0d0182828ac358&from=vj&pos=top", "description": "Desired: Driver's LicenseJOB SUMMARY:\nTransports patients and residents via RRH transport vehicle to and from medical appointments, group\nactivities, and from patients homes as necessary. Will be responsible to ensure that the patients are safely\ntransported in a timely manner, that the daily vehicle report is properly completed, that proper safety\nprocedures such as safety belts, car seats, wheel chairs, etc. are used, and the vehicle is fueled on a regular\nbasis.\n\nQUALIFICATIONS:\n1. Valid California driver's license\n2. Ability to read and understand the English language\n3. Communicate and work well with others\n4. Equivalent job related experience preferred"}, {"title": "Truck Driver", "company": "Costco Wholesale", "location": "Mira Loma, CA", "job url": "https://www.indeed.com/rc/clk?jk=03d37d37751faf54&from=vj&pos=top", "description": "Drives tractor/trailer combination, or comparable, to deliver goods from depot to warehouses and depots. Hauls empty trailers, trailers with pallets, and vendor loads back to depot. Drives hydraulic 5th wheel tractor in depot yard to move trailers. Maintains driving and equipment records.\nMust have at least 3 years tractor-trailer combination or comparable driving experience and provide driver abstract."}, {"title": "Kango Driver/Sitter", "company": "Kango", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=f780f9cec5b14360&from=vj&pos=top", "description": "$35 an hourGive rides to great kids going places!\nKango is more than just a way to earn extra cash by transporting a passenger from Point A to Point B. It's an opportunity to connect, and to care for kids whose lives are busier than ever.\n\nWe find the families in your area that need help\nWhether that be for rides, childcare or both.\n\nWe bring the jobs to you\nWe post jobs for you as soon as families request them.\n\nWe process payments for you automatically\nAfter the job is done, well charge the customer and transfer money directly to you.\nDrive and make $35 an hour on a flexible schedule\nGet a $25 activation bonus for your first job, $20 minimum for all subsequent jobs.\nEnjoy the flexibility to plan your schedule ahead of time - as a driver, a sitter or both.\nEarn extra tips from satisfied parents.\nCall or message parents directly from the app when you need to.\nGet support from the Kango HQ team whenever you need it."}, {"title": "Delivery Driver", "company": "MORSCO", "location": "Santee, CA", "job url": "https://www.indeed.com/rc/clk?jk=b22b93cbd8ecf2c8&from=vj&pos=top", "description": "Responsibilities Include:\n Making deliveries in a timely manner\n Maintaining necessary documentation for shipping/receiving\n Comply with all safety rules and policies\n Loading delivery trucks\n Assisting branch personnel with unloading material\n Must be able to work the assigned schedule and comply with the Company's timekeeping policy\n Other duties as assigned\n\nRequired Skills and Experience:\n High School education or equivalent is required\n Must have a minimum of six months experience as a delivery driver\n Ability to follow verbal and written instructions\n Must have good organizational skills and communication skills\n Must be able to remain alert at all times for safety hazards while handling and transporting heavy materials\n Must have good upper body strength in order to stock shelves and operate equipment\n Must have a clean driving record and ability to pass background check\n\nPhysical Demands:\nAbility to sit, walk and crawl occasionally\nAbility to stand, squat, kneel and dexterity to bend/twist neck and waist, frequently\nAbility to use hands repetitively and power/simple grasp constantly\nAbility for fine manipulation of hands as well as pushing, pulling and reaching above and below shoulder level constantly\nPhysical ability to lift, pull and push products up to 50 pounds frequently\nPhysical ability to lift, pull and push products that weigh in excess of 100+ pounds occasionally\nAbility to carry items up to 6 feet occasionally\n\nTime Type\nFull time\n\nAt MORSCO , our commitment to excellent customer service is just part of our story. Were also dedicated to supporting our most valuable asset, our associates! One of the ways we do this is by offering a variety of high-quality benefits for our associates and their families.\n\nAll full-time associates are eligible for the following benefits:\nMedical and Dental Insurance\nFlexible Spending Accounts\nCompany-paid Life Insurance\nShort Term Disability\n401(k) Plan\nPaid Time Off (PTO) - plus paid holidays\n\nVoluntary benefits:\nAdditional Life Insurance\nLong Term Disability\nCancer/Accident/Heart/Stroke Insurance\nVision Insurance"}, {"title": "Professional Chauffeur Driver", "company": "Matte Black Luxury", "location": "South Pasadena, CA 91030", "job url": "Not Available", "description": "Part-timeProfessional chauffeur driver with over 5 years experience. Driver will be driving a luxury executive Mercedes sprinter van with the capacity of up to 7 passengers. Must understand technology, excellent customer service skills, great communicator, excellent problem solving skills and be able to work in a fast paced environment. Work well with little direction. Understand Waze/google maps. Able to anticipate client needs. Must have a valid drivers license and a clean record.Job Type: Part-timeExperience:Professional driving: 5 years (Preferred)Customer Service: 2 years (Required)Clean Driving Record: 5 years (Required)License:Driver's License (Required)"}]