[{"title": "Hardware Technology Administrative Assistant", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=7b65a0308a287bae&from=vj&pos=top", "description": "Desired: Microsoft WordMicrosoft PowerpointMicrosoft OfficeSummary\nPosted: Nov 16, 2018\n\nRole Number: 200013825\nDo you love helping people and acting as a trusted resource to others? Do you enjoy building deep expertise as well as navigating new and different tasks every day? As an Administrative Assistant in Hardware Technology, youll serve as the center hub of our department, coordinating between Apples employees and the outside world. Youll help keep people organized and focused across multiple dynamic environments. Your work will present ever-changing opportunities, from assisting senior executives to greeting and guiding Apple employees and visitors to coordinating a groups day-to-day needs. More importantly, youll become a trusted source of support whom other Apple people know they can count on. Join Apple, and together, we can turn every single day into a chance to make something in our workplace better than it was yesterday. Be at the center of the action on new silicon product development for Apple's groundbreaking products! Apple's Hardware Technology team is looking for an inventive and dedicated Administrative Assistant to support a rapidly growing and dynamic engineering and management team at Apple. You will be highly organized, independently motivated, resourceful individual able to handle multiple tasks and excel in a high-energy environment.\nKey Qualifications\nKey Qualifications\nTypically requires 3-5 years working in a high-tech environment.\nExperience supporting multiple senior level management and teams.\nQualified candidates must have the ability maintain consistent attention to detail, be able to prioritize and independently manage their time in a fast paced atmosphere where there are often impromptu requests.\nCandidates should possess strong written and verbal communication skills; have the ability to exercise tact, discretion and the initiative to efficiently meet the demands of all groups within the team.\nWe are looking for a team player, with a friendly can-do attitude!\nProficient use of the Macintosh OS.\nCompetency with all basic Microsoft Office Applications (Word, Excel, PowerPoint).\nAbility to work well independently.\nDescription\nDescription\n Calendar management.  High volume purchasing for the group.  Equipment inventory, office supply ordering and facilities coordination.  Working closely with finance and other related teams to assure smoothly operating systems under tight time constraints to secure goods and contract services.  Management and implementation of efficient administrative processes.  Meal service during project crunch time.  New hire coordination.\nEducation & Experience\nEducation & Experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "Hardware Technology Administrative Assistant", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=7b65a0308a287bae&from=vj&pos=top", "description": "Desired: Microsoft WordMicrosoft PowerpointMicrosoft OfficeSummary\nPosted: Nov 16, 2018\n\nRole Number: 200013825\nDo you love helping people and acting as a trusted resource to others? Do you enjoy building deep expertise as well as navigating new and different tasks every day? As an Administrative Assistant in Hardware Technology, youll serve as the center hub of our department, coordinating between Apples employees and the outside world. Youll help keep people organized and focused across multiple dynamic environments. Your work will present ever-changing opportunities, from assisting senior executives to greeting and guiding Apple employees and visitors to coordinating a groups day-to-day needs. More importantly, youll become a trusted source of support whom other Apple people know they can count on. Join Apple, and together, we can turn every single day into a chance to make something in our workplace better than it was yesterday. Be at the center of the action on new silicon product development for Apple's groundbreaking products! Apple's Hardware Technology team is looking for an inventive and dedicated Administrative Assistant to support a rapidly growing and dynamic engineering and management team at Apple. You will be highly organized, independently motivated, resourceful individual able to handle multiple tasks and excel in a high-energy environment.\nKey Qualifications\nKey Qualifications\nTypically requires 3-5 years working in a high-tech environment.\nExperience supporting multiple senior level management and teams.\nQualified candidates must have the ability maintain consistent attention to detail, be able to prioritize and independently manage their time in a fast paced atmosphere where there are often impromptu requests.\nCandidates should possess strong written and verbal communication skills; have the ability to exercise tact, discretion and the initiative to efficiently meet the demands of all groups within the team.\nWe are looking for a team player, with a friendly can-do attitude!\nProficient use of the Macintosh OS.\nCompetency with all basic Microsoft Office Applications (Word, Excel, PowerPoint).\nAbility to work well independently.\nDescription\nDescription\n Calendar management.  High volume purchasing for the group.  Equipment inventory, office supply ordering and facilities coordination.  Working closely with finance and other related teams to assure smoothly operating systems under tight time constraints to secure goods and contract services.  Management and implementation of efficient administrative processes.  Meal service during project crunch time.  New hire coordination.\nEducation & Experience\nEducation & Experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "Cashier", "company": "Builders FirstSource", "location": "San Diego, CA 92111", "job url": "https://www.indeed.com/rc/clk?jk=56a3922249344b75&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Hardware Engineer, Microfabrication, Verily Life Sciences", "company": "Verily Life Sciences", "location": "South San Francisco, CA", "job url": "https://www.indeed.com/rc/clk?jk=e218c8104fd1c9ed&from=vj&pos=top", "description": "Apply to this job on the Verily Life Sciences career site at Verily Careers.\nAbout the job\n\nFor more information about this role please see the Verily Life Sciences career site above.\nLocation\n\n\n\nSouth San Francisco, CA, USA\n\nAt Google, we dont just accept differencewe celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes."}, {"title": "Cashier HouseMart Ace Hardware &amp; Crafts", "company": "HouseMart Ace Hardware &amp; Crafts", "location": "Kamuela, HI", "job url": "https://www.indeed.com/rc/clk?jk=02c86aa25aff6de0&from=vj&pos=top", "description": "Part-timeHouseMart Ace Hardware & Crafts in Kamuela, HI is seeking a Part-time Cashier. We are a drug-free workplace and an equal opportunity employer.\n\nHouseMart is proud to be family owned and operated for more than 65 years. Our vision is to become the best operating chain of independent craft and hardware stores in the country. Our success is directly attributed to our employees and we are looking for our next generation of winning team members.\nThe ideal candidate will be the face of our brand, able to process transactions in an accurate, efficient and courteous manner, while maximizing sales, assisting customers and will work in accordance with the Companys established policies and procedures.\n\nEssential Functions\nEnsure high levels of customer satisfaction through excellent customer service\nAccurately and efficiently handle all transactions with customers: including cash, credit, check and gift card\nIssue receipts, refunds, change or tickets\nMake sale referrals, up-sell products and introduce future items\nMaintain a clean and organized checkout station\nProcess POS (point of sale) purchases\nVerifies cash drawer at the beginning of the shift and accurately balances their own cash drawer\nRemain knowledgeable on products offered and discuss available options\nProperly uses and secures two-way radios and headsets as assigned\nComply with inventory control procedures\nJob Qualifications\nOrganizes work to complete assignments, maintains accuracy, pays attention to detail and demonstrates customer service standards\nStrong mathematical skills\nAbility to effectively communicate written and verbally\nAbility to perform under pressure\nAvailability to work flexible hours\nPart-time Benefits\n20% Employee Discount\nProfit Sharing Program\n401(k) with employer match"}, {"title": "Office Administrator (Entry Level)", "company": "D H Metch", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=e427aa05b00f36da&from=vj&pos=top", "description": "$41,000 a yearWe are looking to hire a full-time, in-house Office Administrator with a strong ability to work independently, organize ideas and tasks, and coordinate multiple projects and schedules simultaneously.\nPrimary responsibilities include:Answering phone calls and emailsAssisting Chief Revenue Officer with to-do list, calendar, and regular tasksOrganizing and updating billing and accounts informationAssisting all personnel with technological and other issuesKeeping inventory, ordering, and restocking office supplies, snacks, and hardwareManaging office- and personnel-related issues as they ariseMaintaining office cleanliness and readiness for personnelPlanning regular office excursions and activitiesAssisting with miscellaneous duties that may arise\nAdditional preferred attributes include:Proficiency with phones/email/printers/technologyProficiency with Microsoft Office/Excel proficiencyAbility to implement feedback immediatelyStrong ability to manage multiple assignments effectively and independentlyExcellent communications skills, both written and oral\nWe offer a competitive salary, benefits, and an awesome atmosphere. This opportunity is for someone looking to work both independently and as part of a team that is experiencing lots of growth and success!\nOnly submit your cover letter due to large numbers of calls, The HR department will get back to you"}, {"title": "Cashier (Griffin)", "company": "ACE", "location": "San Diego, CA 92130", "job url": "https://www.indeed.com/rc/clk?jk=617ce0b018becd45&from=vj&pos=top", "description": "About Griffin ACE Hardware:\nWe are a third-generation family-owned and operated business that was started in Orange County in 1953. We currently own and operate 3 ACE Hardware Stores; one in the original locaiton in Santa Ana (Orange County) and two in San Diego county (Carmel Valley/Del Mar and 4S Ranch/Rancho Bernardo).\n\nGeneral Summary\nThe Cashier is responsible for register transactions involving the sale and/or return of merchandise.\n\nEssential Duties & Responsibilities\nInclude the following. Other duties may be assigned.\n\nCustomer Service\n\nProject a positive representation of Griffin ACE Hardware.\nGreet customers entering and throughout the store. Thank customers by name, when possible, when they are leaving the store.\nProject a friendly, outgoing demeanor; work well with customers as well as associates.\nClear customer checkout lines quickly and efficiently.\nAnswer and monitor all calls and pages promptly, courteously and effectively.\nCommunicate any problem or issue that requires management assistance.\nContinually build product knowledge base and possess the ability to assist customers with store layout and product location.\nAssist in pricing, stocking, marking and bagging of merchandise.\n\nRegister Operations\n\nFollow all cash register transaction procedures.\nResponsible for balancing of register drawer.\nAdhere to any Store Support Center program or promotion that may require implementation at the cash registers.\nParticipate in store and Cashier meetings.\n\nFront End Appearance and Upkeep\n\nKeep the front end, including checkout areas and entrance doors neat and clean at all times. Face and dust front end.\nAssist with keeping impulse counters stocked and faced, rotate fresh merchandise in as seasons change.\nEnsure fresh ads are stocked in shopping carts at all times.\nEnsure forms and supplies are stocked at all times.\nCall for cart pickups when necessary.\nInform management when merchandise returns need to be put away.\nPerform all other duties as assigned.\n\nExperience\nCashier experience preferred. Customer service experience preferred.\n\nPhysical Demands\nStanding, walking, lifting (up to 25lbs) and climbing."}, {"title": "Hardware, Product Design Internship/Co-op", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=9fcf6b04f7a67a50&from=vj&pos=top", "description": "InternshipSummary\nPosted: Nov 12, 2018\n\nRole Number: 200011124\nApple is currently seeking enthusiastic ME majors who can start work in January or Summer, 2019. The interns will provide support to design, engineering, prototyping and validation activities for all hardware product lines.\nKey Qualifications\nKey Qualifications\nAbility to work in team-based environment.\nSelf-motivating.\nStrong analytical/problem solving skills and ability to use statistical tools and techniques.\nKnowledge of finite element analysis theory and general mechanical engineering analysis.\nFlexibility and comfort working in a quickly changing environment.\nDesired Experience in any of the following:\nPrior experience in product design (preferably consumer electronics).\nExperience with component modules (LCD assemblies, batteries, camera modules, etc.) and their interconnect (FPC design and ACF bonding).\nAbility in plastic and metal part design.\n3-D CAD skills\nExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.\nHandheld, portable and/or hardware experience.\nIntegration of wireless antenna (GSM, GPS, Wifi) into mechanical enclosures.\nDesign of audio subsystems (microphone, speaker, receiver).\nUnigraphics or Pro-engineer fluency.\nDescription\nDescription\nAs a member of a multi-functional design team at Apple, you will help to create the next generation of the world's finest hardware devices. You will conceive, design, and bring into production products that will re-define user experience. You will work closely with many different multi-functional teams including Industrial Design, Packaging, Safety, Hardware Engineering, EMC, and Marketing.\nEducation & Experience\nEducation & Experience\nWorking toward BS, MS or PhD in Mechanical Engineering, Materials Science or similar degree.\nAdditional Requirements\nAdditional Requirements\nGood written and verbal communication Ability to juggle multiple requests/tests"}, {"title": "Sales Associate Hardware", "company": "Crown Ace Hardware", "location": "San Diego, CA 92106", "job url": "https://www.indeed.com/rc/clk?jk=309aeba818619203&from=vj&pos=top", "description": "Part-timeDo you like to go to work and love what you do?\nCrown Ace Hardware is that kind of place! We are focused on providing world class service to our customers and our employees. We thrive in a fun and challenging environment. Together with Ace we are proud to have won the JD Powers Award for Customer Service 10 years running. Thats how we do it! Our Vision is to be The most helpful hardware stores on the planet by providing an Amazing Customer Experience every time.\nIf this looks like a company you would love to be a part of apply now!\nJob Description  Sales Associate\nA personality and approach that strongly represents our Core Values along with an enthusiastic, positive, supportive sales focused attitude.\nPuts \"Customers First, Tasks Second.\"\nKnowledge of Power Equipment and tools\nExecute the daily operational goals and priorities assigned by store management.\nContinually work on increasing knowledge of the products we sell and their uses\nMerchandising skills and abilities.\nParticipate in the processing of new shipments\nEducation/Training:\nHigh School diploma or GED equivalent.\nExperience:\n\nTrade skills accompanied by a personality that will support our Core Values and mission is a plus but will train.\nSkills/Knowledge:\nAbility and willingness to work flexible hours including evenings, weekends and holidays to meet the needs of the business.\nKnowledge of retail computer systems a plus.\nA commitment to service excellence and customer satisfaction.\nExcellent communication skills, exceptional organizational ability, high attention to detail, and ability to multi-task.\nRate of Pay: Dependent upon education and experience."}, {"title": "Hardware Device Prototyper, Research and Machine Intelligence", "company": "Google", "location": "Mountain View, CA", "job url": "https://www.indeed.com/rc/clk?jk=c8730f4f785cc465&from=vj&pos=top", "description": "Qualifications\nMinimum qualifications:\n\nB.Sc. degree in Mechanical Engineering, related field or equivalent practical experience.\nExperience integrating component modules (sensors, input controls, audio, camera, battery, PCBs).\nExperience with 2D/3D fabrication for rapid prototyping (laser cutting, 3D printing, milling).\nExperience using design tools: 3D CAD (SolidWorks, Rhino or equivalent).\n\nPreferred qualifications:\n\nM.Sc. degree in Mechanical Engineering.\n5 years of related work experience.\nExperience in designing for manufacturing, including plastics molding, stamping, forming, casting, metal injection molding (MIM) and final assembly.\nHands-on experience with shop tools and prototyping.\nProven ability to collaborate with designers, researchers, and engineers to develop new solutions.\nAbout the job\n\nOur computational challenges are so big and unique we can't just buy our hardware, we've got to make it ourselves. Our Platforms Team designs and builds the hardware, software and networking technologies that power all of Google's services. As a Mechanical Engineer you design and evaluate our data center systems, identifying product requirements and contributing to research and project planning. From the chip to chiller, you are responsible for designing and optimizing an architecture that will scale with Google's continued growth.\nPhysiological sensing from the head region is currently an active challenging research problem with high technological impact. Our new project focuses on the creation of sensors to capture health states, brain-computer interface (BCI) signals, and silent speech. We are are looking to embed sensors in novel wearables such as glasses, earbuds, headphones and other consumer devices.\n\nOur team is exploring this research topic so that Google can innovate in this promising area and create a new range of devices and interface methods.\n\nAs a mechanical engineer, you have hardware prototyping skills, and can contribute to prototype development and the design of new architectures. You will have a critical role in synthesizing prototypes and concepts into functional hardware at different levels. You are able to rapidly innovate and make progress in bringing the most innovative product concepts to life to help us push the boundaries across emerging technologies and products.\nYou work both independently and collaboratively in your projects, and will interface with members across the organization. You will use your experience to drive medium to large-sized tasks and projects while exercising considerable independent judgment and discretion.\nThere is always more information out there, and the Research and Machine Intelligence team has a never-ending quest to find it and make it accessible. We're constantly refining our signature search engine to provide better results, and developing offerings like Google Instant, Google Voice Search and Google Image Search to make it faster and more engaging. We're providing users around the world with great search results every day, but at Google, great just isn't good enough. We're just getting started.\nResponsibilities\n\nDeliver innovative, engaging prototypes using the latest hardware technologies.\nAdvise, collaborate with, and synthesize feedback from researchers and engineers, and members from across the organization.\nFulfill several project requests simultaneously while meeting deadlines.\nLocation\n\n\n\nMountain View, CA, USA\n\nAt Google, we dont just accept differencewe celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes."}, {"title": "Autopilot Hardware Performance Internship/Co-Op (Summer 2019)", "company": "Tesla", "location": "Palo Alto, CA", "job url": "https://www.indeed.com/rc/clk?jk=313b427855c00780&from=vj&pos=top", "description": "Temporary, InternshipYou will help to ensure great quality of Teslas Autopilot hardware and software for current and next generation vehicle programs and working towards Teslas vision of fully autonomous vehicles. You will be contributing to the implementation of the hardware system that processes inputs from a variety of vehicle sensors, evaluates possible vehicle strategies/trajectories, and automate safe control of the vehicle.\n\nRequired Skills\nProficiency in computer architecture.\nProficiency in at least one programming language such as C, C++, Python.\nExperience with architectural simulators is a plus.\nExperience with writing performance tests and analyzing results.\nExperience with debugging performance bottlenecks and issues.\nProfessional and positive communication skills.\nMust be self-managed and committed to working in a fast-paced environment.\n\nQualifications\nCurrently working towards a BS, MS, or advanced degree in a relevant engineering program such as Computer Engineering, Electrical Engineering or Computer Science.\nYou must be self-managed and committed to working in a fast-paced environment.\nHands-on experience is a must.\nProfessional and positive communication skills.\nPrevious internship and/or project experience is a plus.\n\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Cashier HouseMart Ace Hardware", "company": "HouseMart Ace Hardware", "location": "Hilo, HI", "job url": "https://www.indeed.com/rc/clk?jk=70d5d847f2528986&from=vj&pos=top", "description": "HouseMart Ace Hardware in Hilo, HI is seeking a Full-time Cashier. We are a drug-free workplace and an equal opportunity employer.\n\nHouseMart is proud to be family owned and operated for more than 65 years. Our vision is to become the best operating chain of independent craft and hardware stores in the country. Our success is directly attributed to our employees and we are looking for our next generation of winning team members.\n\nThe ideal candidate will be the face of our brand, able to process transactions in an accurate, efficient and courteous manner, while maximizing sales, assisting customers and will work in accordance with the Companys established policies and procedures.\n\nEssential Functions\n\nEnsure high levels of customer satisfaction through excellent customer service\nAccurately and efficiently handle all transactions with customers: including cash, credit, check and gift card\nIssue receipts, refunds, change or tickets\nMake sale referrals, up-sell products and introduce future items\nMaintain a clean and organized checkout station\nProcess POS (point of sale) purchases\nVerifies cash drawer at the beginning of the shift and accurately balances their own cash drawer\nRemain knowledgeable on products offered and discuss available options\nProperly uses and secures two-way radios and headsets as assigned\nComply with inventory control procedures\n\nJob Qualifications\n\nOrganizes work to complete assignments, maintains accuracy, pays attention to detail and demonstrates customer service standards\nStrong mathematical skills\nAbility to effectively communicate written and verbally\nAbility to perform under pressure\nAvailability to work flexible hours\n\nFull-time Benefits\n\nHealth plan coverage (medical, vision, dental)\n20% Employee Discount\n401(k) with employer match\nProfit Sharing Program\n100% Company Paid Life Insurance\nVacation, Sick Leave, Floating Holidays"}, {"title": "Hardware/Mechanical and Electrical Engineering Intern, Winter 2019", "company": "Google", "location": "Mountain View, CA", "job url": "https://www.indeed.com/rc/clk?jk=13082063a565a899&from=vj&pos=top", "description": "InternshipTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the Apply button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n1. In the Resume Section: attach an updated CV or resume.\n2. In the Education Section: attach a current or recent unofficial or official transcript in English.\nUnder Degree Status, select Now attending to upload a transcript.\n\nNote: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Chicago, IL, USA\nQualifications\nMinimum qualifications:\n\nCurrently enrolled in a Bachelor's degree program in Electrical Engineering, Mechanical Engineering or related technical field.\nExperience in one or more of the following areas: Hardware System Integration, Signal and Power Integrity, RF System Validation, Wi-Fi, Bluetooth, Wireless Communications, Product Design.\nAuthorization to work in the United States.\n\nPreferred qualifications:\n\nCurrently pursuing a Master's or PhD in Electrical Engineering, Mechanical Engineering or related field.\nPrevious tech internships or demonstrated work experience (i.e. research assistant, teaching assistant, personal projects outside the classroom, etc.) in Hardware, Electrical Engineering, or Mechanical Engineering.\nReturning to a degree program after completion of the internship.\nAbout the job\n\nPlease join us for a six month internship beginning in January 2019 and ending in July 2019.\nGoogle is and always will be an engineering company. We focus on being a collaborative, global organization consisting of engineers who are ready to tackle some of technology's greatest challenges and make an impact on millions, if not billions, of users. As a Hardware/Mechanical and Electrical Engineering Intern, you will work on our core Consumer Hardware products. Depending on your background and experience, you will be working in one of the following areas:\nElectrical Hardware Engineer\nAs an Electrical Hardware Engineer, you will design, develop and deploy next generation consumer hardware. You have a hardware board design background and knowledge of system architecture for mobile products. You will define board layout constraints and requirements, oversee physical engineering design layout, and work cross-functionally on system integration. You will also work cross functionally with mechanical design, operation, and product to deliver systems to production.\nMechanical Engineer\nAs a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a Mechanical Engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture.\nHardware Test Engineering\nGoogle's custom-designed machines make up one of the largest computing infrastructures in the world. The Hardware Testing Engineering team ensures that this cutting-edge equipment is reliable. As a Hardware Test Engineer, you design test equipment for prototypes of our machinery and develop the protocols used to scale these tests for the entire global team. Working closely with design engineers, you give input on designs to improve our hardware until you're sure it meets Google's standards of quality and reliability.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user's interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people's lives better through technology.\nResponsibilities\n\nPerform specific responsibilities which vary by project area.\nLocation\n\n\n\nMountain View, CA, USA\n\nAt Google, we dont just accept differencewe celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes."}, {"title": "Hardware Engineering Internship", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=a2da31cb6c15abf1&from=vj&pos=top", "description": "InternshipSummary\nPosted: Nov 12, 2018\n\nRole Number: 200011109\nExperience Apple. Theres the typical job. Punch in, make widgets, punch out, repeat. Then theres a career at Apple. Where youre inspired to defy routine. To explore the far reaches of the possible. To travel unchartered paths. And to be a part of something far bigger than yourself. Because around here, changing the world just comes with the job description. Apple is currently seeking enthusiastic EE major interns who can start work anytime between January 2019 to September 2019. The interns will support electrical & system design and integration of the iPod, iPhone, iPad, Watch and Mac computers. The applicants will assist in engineering processes that support the design, integration, implementation, testing, and qualification of various electrical sub-systems.\nKey Qualifications\nKey Qualifications\nFamiliar with computer system architecture, digital logic design and verification, and digital and analog circuit analysis, Analog IC\nInterest in chip design; microarchitecture of on-chip interconnection networks\nAntenna, cellular, wireless, OTA, RF Engineering, high-speed signals; wireless communication theory, RF circuit design\nCPU & GPU Architecture\nC, C++, Python, Perl, SQL, assembly, Mac OS X, PH, Obj-C\nVHDL, Verilog RTL, Digital Logic Design\nMeasurement equipment: spectrum analyzers, network analyzers, oscilloscope\nAbility to interpret schematics and have exposure to physical design and debugging of circuits via FPGA or PCBs.\nExcellent verbal and written social skills.\nPrior internships or work experience preferred.\nDescription\nDescription\nSome responsibilities in Hardware Engineering may include: - Engineering Program Management: Identifying, evaluating and driving engineering/quality improvements/new supplier qualifications) - Touch/Displays Engineering: Optics, Flat Panel/HW, Touch Mechanical Design. Design & Execute experiments validating new materials (optical, mechanical); Optimize design for performance and reliability - Wireless Technologies: Antenna Design, RF System Level Validation, Automated Software/Tool Dev, Optimization of RF Automated Systems, RF Sys Analysis - ASIC / VLSI: RTL Design & Implementation, Verification, Integration, Validation, Emulation, Power/Tech & Circuits, CAD, STA, Physical Design, Low Power Design, Signal Integrity, Analog/Mixed Signal, LDV/HDV, DFT - Embedded/Systems Development: Electrical System Design and Integration, System-Level Testing Support, Schematic Capture, Bug Resolution - Audio/Acoustics/Optical Production Testing and Mechanical Test Design - Human Interface Devices: Firmware Eng, Low-Level Microcontroller Code Dev, Prototyping concepts, design verification (FPGA), Streamline Electrical Design - Firmware Development: Writing/Debugging Low level firmware, drivers, protocols and other firmware code, developing embedded firmware solutions\nEducation & Experience\nEducation & Experience\nPursuing a BS, MS, or Ph.D. in EE/CE/ECE.\nAdditional Requirements\nAdditional Requirements\nGood written and verbal communication Ability to juggle multiple requests/tests\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. If you'd like more information about your EEO rights as an applicant, please click here. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, {"title": "Warehouse", "company": "RENO Hardware and Supply, Inc.", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=35ef24a29e4991ab&from=vj&pos=top", "description": "The warehouse employee pulls customer orders for will call and delivery, and receives and stores merchandise within the warehouse, yard and showroom. Assists customers with loading and unloading of merchandise. Stages orders and loads delivery trucks for shipment. Keeps warehouse, yard, showroom and offices clean and organized. Inspects equipment and keeps maintenance logs. Assists in maintaining the proper levels of merchandise and supplies.\nThe qualified candidate must have an excellent attendance and on time record. Excellent customer service skills are required. The candidate must know how to operate a forklift. While performing the duties of this position, lifting of up to 50 pounds will be required. Is responsible for following all safety procedures and rules.\nFor more information or to apply for this position please contact:\nMisty Wootten\nPO Box 91177\nLong Beach, CA 90809\n562-427-7250\nE-mail: HR@renohardware.com"}, {"title": "Retail Sales Associate", "company": "Crown Ace Hardware", "location": "Encinitas, CA 92024", "job url": "https://www.indeed.com/rc/clk?jk=b36d26cc02ba5676&from=vj&pos=top", "description": "Part-timeDo you like to go to work and love what you do?\nCrown Ace Hardware is that kind of place! We are focused on providing world class service to our customers and our employees. We thrive in a fun and challenging environment. Together with Ace we are proud to have won the JD Powers Award for Customer Service 10 years running. Thats how we do it! Our Vision is to be The most helpful hardware stores on the planet by providing an Amazing Customer Experience every time.\nWe provide opportunity through our \"Future Leaders\" program to grow with Crown Ace Hardware. We love to promote from within so if you are looking for a part time job for extra money or you are looking for a career, come check us out!!!\nIf this looks like a company you would love to be a part of apply now!\nJob Description  Sales associate\nA personality and approach that strongly represents our Core Values along with an enthusiastic, positive, supportive sales focused attitude.\nPuts \"Customers First, Tasks Second.\"\nMaintain awareness of all promotions and advertisements and provide this information to customers.\nExecute the daily operational goals and priorities assigned by store management.\nContinually work on increasing knowledge of the products we sell and their uses\nMerchandising skills and abilities.\nParticipate in the processing of new shipments and help the team to keep the receiving and back room areas clean and organized.\nPersonally responsible for pursuing in-store training.\nEducation/Training:\nHigh School diploma or GED equivalent or currently in school.\nExperience:\n\nTrade skills accompanied by a personality that will support our Core Values and mission is a plus but will train.\nSkills/Knowledge:\nAbility and willingness to work flexible hours including evenings, weekends and holidays to meet the needs of the business.\n\nKnowledge of retail computer systems a plus."}, {"title": "Hardware Stocker", "company": "Ashby Lumber", "location": "Berkeley, CA 94710", "job url": "https://www.indeed.com/rc/clk?jk=e093ae062d6f1208&from=vj&pos=top", "description": "Desired: Microsoft OfficeJob Description:\nAshby Lumber has proudly served the entire Bay Area for over 50 years. We supply contractors and homeowners with everything needed for residential and commercial remodeling, rebuilding, and renovation such as lumber, tools and hardware, doors, windows, paint, faucets, sinks, and toilets. We are currently hiring a Hardware Stocker for our Berkeley location. Interested in becoming a part of our team? Apply today!\nOBJECTIVE:\nThe Hardware Stocker is responsible for the timely offloading, checking in, and stocking of incoming freight belonging to the main store. In addition, the Hardware Stocker is responsible for maintaining all areas belonging to receiving including the Receiving Shed, work stations, parking lot, back stock storage areas, and the general appearance of the store. Qualities essential to this position are punctuality, strong attendance, teamwork, communication, attention to detail, and a commitment to finish tasks as quickly as possible.\nDAILY RESPONSIBILITIES:\nOff load, check in, and stock all store-stocked hardware product, e.g. Sure Drive, National, Ace, Orgill, Senco, BMD, Natco, etc.\nLoad prepared returns on delivery trucks.\nPull special orders and give to Special Order Shed.\nPull back stock to fill empty or low bins & hooks.\nMonitor parking lot/driveways and remove all products and tripping hazards promptly, e.g. empty pallets, trash, low laying products, and shopping carts.\nEmpty trash and recycle bins.\nCheck for discrepancies on POs and report to supervisor.\nUse forklift as necessary to move material.\nProvide friendly customer service as needed by directing customers to product or Floor Sales.\nWEEKLY RESPONSIBILITIES:\nEnsure that all back stock areas are clean and neatly organized including the Receiving Shed.\nDUTIES TO BE DONE AS NEEDED:\nAssist Buyers with price changes and spot counts.\nAssist in the loading/off loading of product for customers.\nAssist the Hardware Puller in transfers and hardware pulls.\nAssist in the preparation and operation of company events like BBQs and Expos.\nRequired Experience:\nSKILLS/QUALIFICATIONS:\nExcellent verbal and written communication skills.\nPossess exceptional interpersonal communication skills\nPossession of strong organizational skills\nAbility to work independently on assigned tasks and accept direction on given assignments\nAble to work in a cooperative manner as part of a team\nMaintain effective working relationships with co-workers, supervisors and the general public\nMaintain regular consistent and professional attendance, punctuality, personal appearance, and adherence to relevant health/safety and company policies and procedures\nPossession of a high school diploma or equivalent (GED)\n6 months to 1 year of relevant experience and/or training, or equivalent combination of education and experience.\nOperate a variety of standard office machines: computer and computer software, including Microsoft Office, phone, fax, shredding, and copy machines\nPHYSICAL REQUIREMENTS:\nSit/stand for 8 hours per day\nUse hands and fingers to manipulate keys on a keyboard\nVision abilities required by this job include close vision\nThe noise level in the work environment is usually quiet to moderate\nOccasional exposure to moving mechanical parts and vehicles\nMust be able to lift/carry 50 lbs. occasionally; must be able to push/pull 50 lbs.\nHorizontal reaching with arms and hands is required; occasionally must climb or balance\nAll mobility motions are required (standing, walking, sitting, stooping, kneeling, crouching, crawling, and climbing)\nRange of motion and physical activity occurring randomly throughout work day\nKeyword: Hardware, Warehouse, Stocker\nFrom: Ashby Lumber"}, {"title": "Customer Service Representative", "company": "Progressive", "location": "Raleigh, NC", "job url": "https://www.indeed.com/rc/clk?jk=dfcbe269f44fc73a&from=vj&pos=top", "description": "$15 - $19 an hourCustomer Service Representative - Work From Home\n\nJob Number: 153607\n\n\nCustomer Service Representative  Work From Home  Raleigh, NC (REQUIRED: must live within 60 miles of Raleigh, NC)\nJoin our team as a Customer Service Rep, and youll have the opportunity to build your career with the benefit of working remotely from your home. For our customer service team, its all about helping others. Were looking for people with a passion for building relationships and a knack for problem-solving to join our team and care for our customers.\n\nWell provide you with office equipment and training virtually so that you can feel confident youre providing the best possible customer service while still in a work from home environment. Whether answering questions about billing, explaining policy coverage or assuring available products are offered, youll be the voice of Progressive to our customers. Youll have the support of a virtual, collaborative team, which includes ongoing coaching and development.\n\nPay Rate:$15.00 -$19.00 per hour, plus:\nAdditional 10-15% shift differential pay when you work evenings or weekends\nTop performance awards and contests with cash payouts\n2018 Training Start Dates & Schedule:\nStart Dates: December 3rd or December 17th\nTraining Hours: Monday  Friday, 10:00am  6:45pm (EST)\nWork Schedule Options: Choose from 3 schedule options with start times between 8:00 a.m.  12:00 p.m. local time, including one weekend day\nDuties & Responsibilities:\nBuild trust by understanding the unique needs of our customers, and resolving those needs effectively and efficiently\nHelp customers with insurance needs like adding/deleting vehicles and drivers from policies, or processing renewals, cancellations, reinstatements, and payments\nQualifications:\nMust live within 60 miles of Raleigh, NC\nOne or more years of college education or relevant work experience\nWork or educational experience must include:\nCustomer service, sales and/or influencing others\nFast paced and changing environment\nMultitasking and time management skills\nEffectively communicating verbally and in writing\nComputer skills\nBenefits & Perks:\n\nProgressive offers the confidence and stability that comes with working for a growing, always evolving organization. Progressive employees also benefit from:\nAnnual gainshare bonus of up to 16% of your salary; Progressive rewards each of us with an annual bonus based on company performance\n401k which includes dollar-for-dollar company match of up to 6%\nPaid training, tuition assistance and career development\nDiverse, welcoming culture with Employee Resource Groups\nDedication to work/life balance including beginning to earn paid time off after your first two weeks\nWellness program with discounts & rewards and the standard benefits (medical, dental, vision)\n\nWork From Home Office Details:\nRemote office internet connection should be via DSL or Cable Modem with minimum speed of 1mbps down and 0.5mbps up\nYour computer or router should be physically connected to the modem by a cable. No wireless connection\nAll Progressive hardware you receive needs to be connected to a surge protector\n\nApply today!\n\nEqual Opportunity Employer\n\nJob: Contact Center\n\nPrimary Location: United States-North Carolina-Raleigh\n\nSchedule: Full-time\n\nEmployee Status: Regular"}, {"title": "Central TA Specialist (Remote)", "company": "Lowe&#39;s Inc.", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=8f3cf1fa48bec9b8&from=vj&pos=top", "description": "The Central Talent Acquisition Specialist supports the Central Talent Acquisition Managers to perform end-to-end support and talent acquisition activities related to low/high volume hourly roles, as well as low/high volume salaried roles requisitions forLowe's. Typically the Central Talent Acquisition Specialist is aligned to specific geographical scope, however may flex to other areas during high volume times to support seasonal needs. The Central Talent Acquisition Specialist would also support basic applicant sourcing for assigned roles, end to end workflow execution, delivering qualified candidates to hiring leaders and successfully closing out the hiring process for each assigned requisition. Lastly, this role will engage with candidates for a variety of roles and will ensure a quality experience is represented.\n\nResponsibilities:ENTS\nSupport Central Talent Acquisition Manager, hiring managers and Field Talent Acquisition Partners with low/high volume hourly roles, as well as low/high volume salaried roles requisitions for applicable geographical scope.\nResponsible for posting, sourcing, screening, scheduling, pre-screening, slating, supporting onboarding and\npreparing offers for low/high volume hourly roles, as well as low/high volume salaried roles requisitions and assigned requisitions as applicable.\nEffectively utilize human resource technology, resource material, websites, and software to effectively administer the recruiting processes.\nProvides exceptional candidate care for applicants throughout the process for assigned requisitions\nProvides regular status updates to COE on candidate progress throughout the process\nWorks regularly with TA technology including the applicant tracking system, job boards, and candidate relationship management tool.\nMinimum Qualifications:\nHigh school diploma or equivalent\n1-3 years talent acquisition experience required; preferably for a large retail company\nExperience in a shared service center environment preferred\nTHIS ROLE WILL BE REMOTE IN THE PACIFIC STANDARD TIME ZONE\nAbout Lowes\nLowes Companies, Inc. (NYSE: LOW) is a FORTUNE  50 home improvement company serving more than 17 million customers a week in the United States, Canada and Mexico. With fiscal year 2016 sales of $65.0 billion, Lowes and its related businesses operate or service 2,365 home improvement and hardware stores and employ over 290,000 people. Founded in 1946 and based in Mooresville, N.C., Lowes supports the communities it serves through programs that focus on K-12 public education and community improvement projects. For more information, visit Lowes.com."}, {"title": "Material Handler I Yard", "company": "Builders FirstSource", "location": "San Diego, CA 92110", "job url": "https://www.indeed.com/rc/clk?jk=2d1bc5ae6ee84142&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, handles and maintains the flow of materials and products on the premises according to established guidelines.\n\n\nPhysically handles materials used to construct components and finished products to ensure movement of such items is optimized; lifts, carries, stacks items as needed.\nOperates motorized and non-motorized material handling equipment, some of which may require specialized training.\n\nRequirements: High school diploma or General Education Degree (GED). This is a entry level position where the incumbent will receive on-the-job training.\n\nBajo supervisin directa, manipular y mantener el flujo de materiales y productos en las instalaciones segn los lineamientos establecidos. * Manipular fsicamente los materiales usados para construir componentes y productos terminados para garantizar el ptimo movimiento de dichos elementos; levantar, transportar y apilar elementos segn sea necesario. * Operar equipos de manipulacin de materiales motorizados y no motorizados, algunos de los cuales pueden requerir conocimiento especializado. Requisitos: ttulo secundario o ttulo de educacin general (GED, por sus siglas en ingls). Este es un puesto de nivel inicial donde el contratado recibir capacitacin laboral.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Cashier", "company": "Builders FirstSource", "location": "San Diego, CA 92110", "job url": "https://www.indeed.com/rc/clk?jk=b55458f69b628200&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Warehouse Specialist", "company": "ACE Hardware", "location": "Sacramento, CA", "job url": "https://www.indeed.com/rc/clk?jk=096149462df34d70&from=vj&pos=top", "description": "$16.72 an hourWarehouse Specialist\nAce is a place for you to have a long term career you can be truly proud of, competitive pay, unheard of financial incentive opportunities, and comprehensive benefits for you and your family. Ace Hardware Distribution Centers are where team players collaborate to support amazing retailers be the most helpful hardware stores on the planet.\nOur incredible growth is creating exciting opportunities for Warehouse Specialists in our Sacramento, CA Distribution Center. Come serve a purpose and take pride in enabling independent stores owners to compete and grow as they execute our ultimate goal; being Helpful within their communities.\nWe have a number of Warehouse Specialist positions such as order fillers, stockers, receivers and loaders.\n\nThe Benefits to You are Outstanding!\nHiring Bonus: We offer a $500 retention bonus.\nCompensation: Our average hourly wage rate is $16.72 with our amazing incentive program, paid weekly.\nHealth Insurance: Support yourself and your family with Ace subsidized medical coverage and benefits along with dental, vision, prescription drug coverage, and flexible spending accounts.\nPaid Time Off: Generous paid time off program.\n401K: Company match plus additional company contributions.\nMerchandise Discounts: Purchase products from the warehouse at a generous discounted rate.\nTuition Reimbursement: Continue your education with a tuition reimbursement program.\n\nOur Amazing Warehouse Specialist Team:\nParticipates in a safe work environment ;\nDemonstrates quality work performance ;\nSupports our Stores / Owners by meeting productivity goals ;\nHelps each other by maintaining good attendance ;\nExpands their warehouse knowledge by cross training in other departments; and\nDemonstrates our Ace Values of Winning, Excellence, Love, Integrity, Gratitude, Humility, Teamwork .\n\nHere are a few necessities to get you started.\nYou have a desire to work at Ace Hardware  The helpful place;\nWell need a little of your time so we can learn more about you;\nYou must be 18 years or older; and\nYou have an idea of the schedule that would fit you best\n\n\n\n\nWe want to hear from you!\n\nWhen most people think of career opportunities with Ace Hardware, they often think of the helpful cashiers and sales associates at their local store. However, have you also considered the people behind the scenes who select, promote, ship and process the invoices for more than 75,000 products? Maybe you haven't, but we'd like you to. Because together we help our customers take care of their homes. Come find out why a career with the Ace Hardware Corporation is one of America's best kept secrets.\n\nEqual Opportunity Employer\n\nAce Hardware Corporation and its subsidiaries are committed to a policy of promoting equal employment opportunities. The company recognizes the importance of diversity and leveraging the skills and talents of all people to the mutual advantage of each individual and the organization. The company is committed to the prevention of employment discrimination related to race, religion, color, sex (including sexual harassment), gender identity, national origin, age, marital status, disability and military discharge, or any other action covered by federal or state laws."}, {"title": "Materials Stocker", "company": "Mountain Hardware and Sports", "location": "Truckee, CA 96161", "job url": "Not Available", "description": "Be part of a growing Employee Owned Company!Mountain Hardware and Sports is now hiring for the following full-time position:Materials StockerDuties include, but are not limited to:Required Experience:Strong customer serviceUnload, uncrate and assemble merchandise and sales floor displaysMark items with identifying codes, such as price, stock, or inventory control codesEnsure labels are clear and visibleStock shelves with incoming products accurately and efficientlyReplace damaged or missing productsAssist customers on sales floorAssist with maintaining cleanliness of the store including merchandising, mopping, dusting, vacuuming, etc.Provide general support as needed, including cashieringRequired Skills:Excellent customer serviceOutgoing and friendlyAbility to lift up to 75 lbs.Ability to work at heights, climbing ladders and 2-story back stock spaceAbility and comfort walking on uneven surfacesRequires continuous physical activity including walking, standing, climbing, and liftingAbility to stand for an extended amount of timeExcellent written and verbal communication skillsAttention to detail and mathematical skillsAbility to Multitask and effectively manage time on assigned projectsInventory control and RF Gun knowledge is a plusPoint of Sale system knowledge is a plusAbility and willingness to work flexible hours including evenings, weekends, and holidaysComfortable in a fast-paced environment and enjoy being part of a teamCandidates should be able to work in a fast-paced environment and enjoy being part of a teamBenefits include medical, dental, vision, vacation and sick pay, significant store discount and participation in Employee Stock Ownership Program (ESOP) and 401KJob Type: Full-time"}, {"title": "Central TA Specialist (Remote)", "company": "Lowe&#39;s Inc.", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=8f3cf1fa48bec9b8&from=vj&pos=top", "description": "The Central Talent Acquisition Specialist supports the Central Talent Acquisition Managers to perform end-to-end support and talent acquisition activities related to low/high volume hourly roles, as well as low/high volume salaried roles requisitions forLowe's. Typically the Central Talent Acquisition Specialist is aligned to specific geographical scope, however may flex to other areas during high volume times to support seasonal needs. The Central Talent Acquisition Specialist would also support basic applicant sourcing for assigned roles, end to end workflow execution, delivering qualified candidates to hiring leaders and successfully closing out the hiring process for each assigned requisition. Lastly, this role will engage with candidates for a variety of roles and will ensure a quality experience is represented.\n\nResponsibilities:ENTS\nSupport Central Talent Acquisition Manager, hiring managers and Field Talent Acquisition Partners with low/high volume hourly roles, as well as low/high volume salaried roles requisitions for applicable geographical scope.\nResponsible for posting, sourcing, screening, scheduling, pre-screening, slating, supporting onboarding and\npreparing offers for low/high volume hourly roles, as well as low/high volume salaried roles requisitions and assigned requisitions as applicable.\nEffectively utilize human resource technology, resource material, websites, and software to effectively administer the recruiting processes.\nProvides exceptional candidate care for applicants throughout the process for assigned requisitions\nProvides regular status updates to COE on candidate progress throughout the process\nWorks regularly with TA technology including the applicant tracking system, job boards, and candidate relationship management tool.\nMinimum Qualifications:\nHigh school diploma or equivalent\n1-3 years talent acquisition experience required; preferably for a large retail company\nExperience in a shared service center environment preferred\nTHIS ROLE WILL BE REMOTE IN THE PACIFIC STANDARD TIME ZONE\nAbout Lowes\nLowes Companies, Inc. (NYSE: LOW) is a FORTUNE  50 home improvement company serving more than 17 million customers a week in the United States, Canada and Mexico. With fiscal year 2016 sales of $65.0 billion, Lowes and its related businesses operate or service 2,365 home improvement and hardware stores and employ over 290,000 people. Founded in 1946 and based in Mooresville, N.C., Lowes supports the communities it serves through programs that focus on K-12 public education and community improvement projects. For more information, visit Lowes.com."}, {"title": "Cashier", "company": "Builders FirstSource", "location": "San Diego, CA 92110", "job url": "https://www.indeed.com/rc/clk?jk=b55458f69b628200&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Retail Sales Associate", "company": "Crown Ace Hardware", "location": "Encinitas, CA 92024", "job url": "https://www.indeed.com/rc/clk?jk=b36d26cc02ba5676&from=vj&pos=top", "description": "Part-timeDo you like to go to work and love what you do?\nCrown Ace Hardware is that kind of place! We are focused on providing world class service to our customers and our employees. We thrive in a fun and challenging environment. Together with Ace we are proud to have won the JD Powers Award for Customer Service 10 years running. Thats how we do it! Our Vision is to be The most helpful hardware stores on the planet by providing an Amazing Customer Experience every time.\nWe provide opportunity through our \"Future Leaders\" program to grow with Crown Ace Hardware. We love to promote from within so if you are looking for a part time job for extra money or you are looking for a career, come check us out!!!\nIf this looks like a company you would love to be a part of apply now!\nJob Description  Sales associate\nA personality and approach that strongly represents our Core Values along with an enthusiastic, positive, supportive sales focused attitude.\nPuts \"Customers First, Tasks Second.\"\nMaintain awareness of all promotions and advertisements and provide this information to customers.\nExecute the daily operational goals and priorities assigned by store management.\nContinually work on increasing knowledge of the products we sell and their uses\nMerchandising skills and abilities.\nParticipate in the processing of new shipments and help the team to keep the receiving and back room areas clean and organized.\nPersonally responsible for pursuing in-store training.\nEducation/Training:\nHigh School diploma or GED equivalent or currently in school.\nExperience:\n\nTrade skills accompanied by a personality that will support our Core Values and mission is a plus but will train.\nSkills/Knowledge:\nAbility and willingness to work flexible hours including evenings, weekends and holidays to meet the needs of the business.\n\nKnowledge of retail computer systems a plus."}, {"title": "Hardware Validation Engineering Internship/Co-Op (Summer 2019)", "company": "Tesla", "location": "Fremont, CA", "job url": "https://www.indeed.com/rc/clk?jk=ed90bff98def57b0&from=vj&pos=top", "description": "Temporary, InternshipDesired: C/C++Tesla Motors is looking for an engineering intern to develop and manage the design validation and test environment for our hardware team.\nResponsibilities: Validate product functionality and ensure coverage of various use cases. Develop test environments, regressions, methodology, and test cases. Write and review validation test plans. Interface with 3rd party IP views and track deliverables, schedules and dependencies. Functional bring-up and debug on various platforms.\nYou will be working with a team of highly talented experts, who are focused on advancing Teslas mission. Here's what we'd like to see in you:\nMinimum requirements: Minimum GPA: 3.5 Pursuing a BS or MS in computer science or computer engineering. Solid programming skills in C++, Verilog, assembly, and at least one scripting language. Proficient in waveform and debugging. Deep knowledge in computer architecture and micro-architecture.\nDesirable experience: Experience with writing directed and random diagnostics. Prior internship experience with bring-up or validation of complex hardware systems with variety of interfaces and peripherals. Working knowledge of SoC architecture and protocols including CPUs, GPUs and peripherals (PCIe, Ethernet, etc.)\nQualifications:\n Ability to work independently, detail-oriented, and execution focused\nProfessional and positive communication skills.\nHighly collaborative and team-oriented.\nHands-on experience, previous internship and/or project experience is preferred.\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Installer I", "company": "Tesla", "location": "Vista, CA", "job url": "https://www.indeed.com/rc/clk?jk=76fb21f37a3703df&from=vj&pos=top", "description": "Desired: Basic Computer SkillsConstruction ExperienceCarpentryCustomer ServiceTHE ROLE\n\nThe Installer I will be part of Teslas Energy Field Operations team. As an integral member of the team, the ideal candidate will work cooperatively with other team members to successfully complete the installation of residential PV solar systems, battery storage and EV wall connectors safely and on time. It is the responsibility of every Installer to ensure safe work practices for Teslas installation team. New hire training and continued training will be provided.\n\nRESPONSIBILITIES\n\nLayout, assembly and installation of solar array and mounting hardware\nAssist with the electrical wiring of all energy products\nPrepare and clean-up job site\nWork with the warehouse team to pull materials for each installation job\nAttend weekly team meetings and mandatory training sessions on new products, installation methodology and safety\nProvide an exceptional customer experience to all customers throughout the process\nAdditional duties required as needed\n\nREQUIREMENTS\n\nRoof work, general construction, or carpentry experience preferred\n Ability to safely handle tools and materials such as: ladders, inverters, solar panels, panel boards, batteries, and other similar electrical equipment, lumber, roofing materials, etc.\nAbility to work in extreme environments (example: hot sun, cold, crawl spaces, etc.)\n Capable of working at heights including on rooftops, climbing ladders and stairs; and performing repetitious duties, including lifting, bending and standing for long periods of time\nExperience using basic hand and power tools\nBasic computer skills preferred\nMust have excellent written and verbal communication skills\nMust have excellent customer service skills\nExcellent attendance is crucial for the team to achieve success\nAbility to work well with others in a collaborative team environment\n\n\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Warehouse", "company": "RENO Hardware and Supply, Inc.", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=35ef24a29e4991ab&from=vj&pos=top", "description": "The warehouse employee pulls customer orders for will call and delivery, and receives and stores merchandise within the warehouse, yard and showroom. Assists customers with loading and unloading of merchandise. Stages orders and loads delivery trucks for shipment. Keeps warehouse, yard, showroom and offices clean and organized. Inspects equipment and keeps maintenance logs. Assists in maintaining the proper levels of merchandise and supplies.\nThe qualified candidate must have an excellent attendance and on time record. Excellent customer service skills are required. The candidate must know how to operate a forklift. While performing the duties of this position, lifting of up to 50 pounds will be required. Is responsible for following all safety procedures and rules.\nFor more information or to apply for this position please contact:\nMisty Wootten\nPO Box 91177\nLong Beach, CA 90809\n562-427-7250\nE-mail: HR@renohardware.com"}, {"title": "Administrative Assistant", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=6d03b7850a35ee22&from=vj&pos=top", "description": "Summary\nPosted: Oct 16, 2018\nWeekly Hours: 40\nRole Number: 114265684\nApples Communications Team is looking for an experienced Assistant to join their team. The successful candidate will be a collaborative team member with a friendly work style. Must be extraordinarily well-organized, able to effectively multi-task & prioritize, and take initiative.\nKey Qualifications\nKey Qualifications\nExperience handling multiple complex calendars\nExcellent organization skills, acute attention to detail, ability to juggle multiple tasks in a fast-paced, and time sensitive environment\nConsistent track record of meeting deadlines and taking initiative to make confident decisions quickly and under pressure\nStrategic thinking needed, able to understand the business and see the big picture\nMust possess a can-do attitude for all situations\nConcise written and verbal communication skills, with a professional demeanor\nDemonstrates a proactive ability to anticipate needs and changes, then react efficiently with independent/sound judgment\nHas a passion for learning new things, continuous improvement and sharing best practices\nDirect experience dealing with sensitive and confidential information with integrity\nComfortable collaborating with all levels of the team\nExtraordinary worth ethic, discreet and trustworthy\nMust be confident to make complicated decisions on their own when needed and able to explain their reasoning\nAbility to influence others; handle conflict appropriately, know when to delegate issues upward\nAble to anticipate change and react efficiently & expeditiously, with a calm approach\nOverall ability to understand and retain new information quickly\nWell-rounded understanding of Purchase Orders, and financial budgeting\nAbility to establish and maintain effective business partnerships\nDescription\nDescription\nProvide full administrative support to team leadership Ability to manage cross-functional meetings with heavy calendaring Organize and maintain complex travel schedules, domestic and international Facilitate meetings in person, video conference, WebEx and teleconference Proactively manage team support, ranging from printer management, office supplies, AOU ordering, catering, resource calendars and more Quickly develop an understanding of the teams operations, culture, policies and procedures Partner with the team for planning & executing key Events on and off Campus Experienced in eApproval, extensive PO submissions and expense reports Work regularly within File-Maker to help maintain budgets Manage facilities and team needs in multiple different buildings Handle and maintain highly confidential and sensitive information Ability to excel working with complex and different personalities diplomatically Experience with on-boarding new employees Efficient in Apple hardware and software Knowledge of how to address IT matters quickly and easily Work with the broader administrative team, to be a leader in team morale\nEducation & Experience\nEducation & Experience\nBS degree preferred, or equivalent experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "Student Services Supervisor I", "company": "San Diego Community College District", "location": "San Diego, CA 92108", "job url": "https://www.indeed.com/rc/clk?jk=44f11ce8c9dc96c3&from=vj&pos=top", "description": "$4,904 - $8,188 a monthTemporaryStudent Services Supervisor I\n\nSan Diego Community College District\n\nClosing Date: 11/29/2018\n\nPosition Number: 004040\n\nLocation: San Diego Mesa College\n\nPosition Type:\n\nThe Position:\nFrom San Diego Mesa College President Pamela Luster:\nSan Diego Mesa College seeks energetic and dedicated candidates to apply for classified positions. The College is committed to academic excellence and diversity, equity and inclusion among its faculty, staff, and students. As the Leading College of Equity & Excellence, we take responsibility for equitable outcomes and work together to create successful pathways for all of our students.\nAs the largest college in the San Diego Community College District, the institution enjoys a solid financial standing, state of the art facilities, and a world class faculty and staff. For 55 years, Mesa College has been on the leading edge, from offering a Community College Bachelor's Degree, to being the #1 California Community College to graduate students with an Associate Degree for Transfer in 2016.\nWe are adding new staff, faculty and administrators who, alongside our stellar colleagues, will lead us into the future. If this opportunity sounds like the right fit for you, I encourage you to file an application for employment.\n\nSan Diego Mesa College is located in Clairemont Mesa in San Diego and is one of three colleges in the San Diego Community College District. Applications are currently being accepted for Student Services Supervisor I at San Diego Mesa College. Under the supervision of the Dean of Student Development and Director of Admissions, the Student Services Supervisor I will be responsible for overseeing the full range of admission and records and other student services functions including admissions, international students, residency, registration, prerequisites, attendance, rosters, and other student services areas.\n\nThis position will be in the Admissions Office beginning March 1, 2019. Hours are Monday to Thursday from 8:00 AM to 5:00 PM and Friday from 8:00 AM to 3:00 PM. Note that schedules are adjusted as needed to accommodate departmental needs to support peak times. The selected candidate must be willing to adjust work days/hours based on the department's needs.\n\nMajor responsibilities include the following:\nCoordinate and supervise office operations, including admissions, international students, registration, residency, certifications, records, veterans, and others for a specific shift.\n\nProvide leadership and work with staff to develop and maintain a high performance, centralized and responsive service to the District, staff, and campus visitors.\n\nSupervise, train, evaluate, and assign office staff; participate in the hiring and disciplinary recommendations of staff. Supervise staff within labor contract provisions in a way that contributes to positive employee relations.\n\nMaintain student records, providing information to students and staff regarding registration, enrollment, grades, and class schedules; responding to inquiries as referred by staff; coordinating and performing admissions activities with other departments.\n\nProvide information to students and staff regarding admissions, registration, enrollment, grades, class schedules, and other areas of student services; respond to more difficult questions as referred by assigned staff; coordinate and perform admissions activities with other college departments.\n\nWork collaboratively and assist with the coordination of procedures and activities with other offices such as the Business Office, Accounting, Financial Aid, Counseling, Veterans and Records, and other student services programs.\n\nAssist students and staff in resolving problems and complaints involving admissions, records, attendance rosters, grades, and other areas of student services.\n\nClarify and explain complex college admissions and records policies and procedures to students, faculty, staff, and the community in person, over the phone, or in writing in order to assure compliance.\n\nAssure compliance of staff during a shift with district rules, policies, and procedures and laws governing residency, international students, veterans, admissions, and other areas of student services.\n\nAssist in monitoring budget expenditures for student services program areas.\n\nServe on special committees and perform special projects as assigned.\n\nPrepare and maintain reports and statistics as required.\n\nAssist in the development and implementation of the district admissions and records processing calendar.\n\nImplement success, equity, and achievement efforts as it relates to the admissions and other student services function.\n\nPerform related duties as assigned.\n\nPlease note that an employee may be transferred to any site at the option of the Chancellor.\n\nMajor Responsibilities:\n\nQualifications:\n\nDesired Qualifications:\nBachelors degree preferred. Experience with staff supervision preferred. College Admissions and Records experience highly desirable. Knowledge: Applicable sections of California Education Codes. Basic mathematics and accounting principles. District organization, operations, policies, and objectives. Laws, rules, regulations, and policies relating to the registration, admission, and related student services areas of a community college student. Modern office practices, procedures, and equipment, including computer hardware and software. Oral and written communications skills. Principles and practices of administration, supervision, and training. Technical aspects of field of specialty. Skills and Abilities: Analyze situations accurately and adopt an effective course of action. Communicate effectively both orally and in writing. Coordinate student services operations. Establish and maintain effective working relationships with administration, faculty, staff, students, and the general public. Interpret and apply the rules, regulations, and policies governing registration and admissions and other functions assigned. Perform special functions, prepare and maintain reports and statistics. Prepare and meet schedules and timelines. Operate computers and business-related software, including word processing, spreadsheets, and databases. Plan and organize work. Supervise, train, evaluate, and schedule office staff. Work independently with little direction.\n\nLicenses:\n\nPay Information:\nRange 10 ($4,904.40 - $8,188.09) per month based on the current Supervisory and Professional Employees Association - Salary Schedule A\n\nInitial salary placement is commensurate with related experience and promotional rules. The District offers a comprehensive fringe benefit package including employer paid: medical, dental, and vision plans; sick and vacation leave; and opportunities for professional development. Initial Salary Placement, Promoted or transferred employees will be placed as specified in the SPAA - Supervisory & Professional Administrators Association Handbook. This position is FLSA exempt and may not accrue overtime. A temporary probationary period will be applied to the employee entering this assignment. The SDCCD Employment Web Page provides a link to employee collective bargaining agreements and handbooks, and more information about terms and conditions of employment to include salary and benefits.\n\nTo apply, visit: https://www.sdccdjobs.com\n\nAll applicants must have demonstrated cultural competency and sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, gender identity, sexual orientation, and ethnic backgrounds of community college students and staff."}, {"title": "Remote Desktop Support Specialist", "company": "Remote PC Support", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=ff240bdc4a2078e3&from=vj&pos=top", "description": "The remote desktop support specialist is responsible for providing our customers with desktop support and administration of computing hardware and software.\n\nThis position requires a self paced and motivated individual that will work independently to support our customers on windows based operating systems including Windows Xp, Vista, Windows 7 and 8 desktops, WAN/LAN routing and desktop security on a case by case basis.\n\nPrimary Responsibilities:\nResponsible for the installation and configuration of:\nHardware drivers\nSoftware & Utilities\nProductivity Applications\nResponsible for software updates and upgrades\nManage and install all operating system patches and updates\nResponsible for assisting customers with the installation, configuration and troubleshooting of the following types of hardware:\nPrinters (Wired and wireless)\nScanners\nDigital cameras\nPDA and smartphones\nConduct and maintain an accurate inventory of user hardware and RF equipment via helpdesk\nResponsible for troubleshooting end user and network problems, and diagnosing the source of the problem to provide a resolution or next steps\nProvide documented follow-up to all open trouble tickets and escalate where required\nMaintain accurate system policies/procedures and perform responsibilities according to the processes developed by our corporate staff\nResponsible for submission of all service requests for new equipment, software, associate moves, adds or changes to our current infrastructure configuration\nBe proactive in recommending improvements in procedures that will increase the efficiency of the facility and staff members in regards to IT related technical issues and processes\n\nMinimum Requirements:\nMCSE, MCP, A+, Network+ Security+\nGood PC technical and troubleshooting skills\nFamiliar with networking hardware/concepts\nExtensive experience with Windows operating systems from Windows XP to current\nThorough understanding and solving printer issues\nWork well with all levels of the corporate IS department\nExcellent communication and customer service skills\nBe able to work independently\n\nMinimum Technical Requirements:\nMust have a reliable high-speed Internet connection (Minimum 1MB DSL or higher)\nMust have a windows based desktop or laptop with a minimum of Windows Xp and 2GB or RAM\nMust have a land-line or cell phone to communicate with RemotePcSupport.com helpdesk staff."}, {"title": "Receiver I Lumber Yard", "company": "Builders FirstSource", "location": "Solana Beach, CA 92075", "job url": "https://www.indeed.com/rc/clk?jk=35948ddb2627e875&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.Today, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, handles daily receipt of merchandise received from vendor trucks by performing the following duties.\n\n\nExamines shipment for defects and shortages against receiving documents.\nRecords factors causing goods to be returned.\nUnloads and moves incoming shipments to storage.\nForwards approved receiving documents to appropriate department for processing.\n\nRequirements: High school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience.\n\nManejar la recepcin diaria de mercadera recibida de camiones de vendedores al realizar las siguientes tareas. * Analizar los envos en busca de defectos y faltas en comparacin con los documentos que detallan lo recibido. * Registrar los factores por los cuales se devuelven los bienes. * Descargar y mover los envos entrantes al almacenamiento. * Reenviar los documentos aprobados de los productos recibidos al departamento correspondiente para su procesamiento. Requisitos: ttulo secundario o ttulo de educacin general (GED, por sus siglas en ingls) o de uno a tres meses de experiencia o capacitacin relevante, o una combinacin equivalente de educacin y experiencia.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, protected veteran status or status as an individual with a disability.\n\nIn compliance with the ADA Amendments Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position with Builders FirstSource, please call (214) 765-3990 or email: ADA.Accommodation@bldr.com. Please do not send resumes to this email address - it is intended only to be used to request an accommodation in submitting an application for a job opening.\n\nhttps://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\nEEO THE LAW - English/Spanish\nEEO IS THE LAW - SUPPLEMENT - English/Spanish\nPay Transparency Provision - English/Spanish"}, {"title": "Administrative Assistant", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=6d03b7850a35ee22&from=vj&pos=top", "description": "Summary\nPosted: Oct 16, 2018\nWeekly Hours: 40\nRole Number: 114265684\nApples Communications Team is looking for an experienced Assistant to join their team. The successful candidate will be a collaborative team member with a friendly work style. Must be extraordinarily well-organized, able to effectively multi-task & prioritize, and take initiative.\nKey Qualifications\nKey Qualifications\nExperience handling multiple complex calendars\nExcellent organization skills, acute attention to detail, ability to juggle multiple tasks in a fast-paced, and time sensitive environment\nConsistent track record of meeting deadlines and taking initiative to make confident decisions quickly and under pressure\nStrategic thinking needed, able to understand the business and see the big picture\nMust possess a can-do attitude for all situations\nConcise written and verbal communication skills, with a professional demeanor\nDemonstrates a proactive ability to anticipate needs and changes, then react efficiently with independent/sound judgment\nHas a passion for learning new things, continuous improvement and sharing best practices\nDirect experience dealing with sensitive and confidential information with integrity\nComfortable collaborating with all levels of the team\nExtraordinary worth ethic, discreet and trustworthy\nMust be confident to make complicated decisions on their own when needed and able to explain their reasoning\nAbility to influence others; handle conflict appropriately, know when to delegate issues upward\nAble to anticipate change and react efficiently & expeditiously, with a calm approach\nOverall ability to understand and retain new information quickly\nWell-rounded understanding of Purchase Orders, and financial budgeting\nAbility to establish and maintain effective business partnerships\nDescription\nDescription\nProvide full administrative support to team leadership Ability to manage cross-functional meetings with heavy calendaring Organize and maintain complex travel schedules, domestic and international Facilitate meetings in person, video conference, WebEx and teleconference Proactively manage team support, ranging from printer management, office supplies, AOU ordering, catering, resource calendars and more Quickly develop an understanding of the teams operations, culture, policies and procedures Partner with the team for planning & executing key Events on and off Campus Experienced in eApproval, extensive PO submissions and expense reports Work regularly within File-Maker to help maintain budgets Manage facilities and team needs in multiple different buildings Handle and maintain highly confidential and sensitive information Ability to excel working with complex and different personalities diplomatically Experience with on-boarding new employees Efficient in Apple hardware and software Knowledge of how to address IT matters quickly and easily Work with the broader administrative team, to be a leader in team morale\nEducation & Experience\nEducation & Experience\nBS degree preferred, or equivalent experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "Installer I", "company": "Tesla", "location": "Vista, CA", "job url": "https://www.indeed.com/rc/clk?jk=76fb21f37a3703df&from=vj&pos=top", "description": "THE ROLE\n\nThe Installer I will be part of Teslas Energy Field Operations team. As an integral member of the team, the ideal candidate will work cooperatively with other team members to successfully complete the installation of residential PV solar systems, battery storage and EV wall connectors safely and on time. It is the responsibility of every Installer to ensure safe work practices for Teslas installation team. New hire training and continued training will be provided.\n\nRESPONSIBILITIES\n\nLayout, assembly and installation of solar array and mounting hardware\nAssist with the electrical wiring of all energy products\nPrepare and clean-up job site\nWork with the warehouse team to pull materials for each installation job\nAttend weekly team meetings and mandatory training sessions on new products, installation methodology and safety\nProvide an exceptional customer experience to all customers throughout the process\nAdditional duties required as needed\n\nREQUIREMENTS\n\nRoof work, general construction, or carpentry experience preferred\n Ability to safely handle tools and materials such as: ladders, inverters, solar panels, panel boards, batteries, and other similar electrical equipment, lumber, roofing materials, etc.\nAbility to work in extreme environments (example: hot sun, cold, crawl spaces, etc.)\n Capable of working at heights including on rooftops, climbing ladders and stairs; and performing repetitious duties, including lifting, bending and standing for long periods of time\nExperience using basic hand and power tools\nBasic computer skills preferred\nMust have excellent written and verbal communication skills\nMust have excellent customer service skills\nExcellent attendance is crucial for the team to achieve success\nAbility to work well with others in a collaborative team environment\n\n\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Hardware Clerk", "company": "Walters &amp; Wolf Interiors", "location": "Fremont, CA 94538", "job url": "Not Available", "description": "Hardware ClerkWalters & Wolf is a leading Specialty Construction Company in Fremont, California who has been in business over 40 years. Today we have over nine facilities spanning from Arizona, Washington, California, and Nevada. Walters & Wolf offers their clients a range of products from glass and glazing, custom stone products, curtainwall systems, composite panels rain screen systems, terra cotta products, GRFC precast panels, custom doors, frames, and hardware products, including installations. The company today is comprised of 1500 employees across all geographic locations. We are seeking candidates that characterize themselves as dedicated, hardworking, eager to learn, must have high integrity values, teamwork is a must, and be someone who wants to continue LEARNING with our LEAN environment!At Walters & Wolf you will experience a culture that surrounds itself with exceptional customer service and exceptional quality products and a culture built on trust and family values which sets us apart from all competitors!Our Walters & Wolf Interiors, Fremont location is currently seeking a Hardware Clerk to join our team in Fremont, CA.Successful candidates will possess the following qualifications: Hardware and ormechanical aptitude.Forklift experience preferred.Shipping and receiving experience preferred.Exceptional eye for detail.Able to handle a very fast paced working environment.Self-motivated, responsible, and reliable.Strong multi-tasking and organizational skills.Excellent verbal and written communication skills.Basic computer skills (Microsoft Word, Excel and Outlook)Most important: You are responsible, eager to learn, and not afraid to ask questions. You have a sense of urgency and are driven to succeed. If you are self-motivated, organized, able to work with minimal direction, manage your time well, and are willing to do what it takes to get the job done, then youre a match for us!What We Provide You:Walters & Wolf values its employees contributions and believes strongly in promoting from within. We are a Union Shop that offers a competitive compensation and benefits package, including a medical, dental and vision coverage, pension, paid time off and holidays and more. In addition, we offer the opportunity to work with a phenomenal and elite group of individuals.Walters & Wolf is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.You may email your information to: aglazis @waltersandwolf.comPlease include Hardware Clerk - WWI in the subject line to ensure delivery.Website: www.waltersandwolf.comJob Type: Full-timeJob Type: Full-timeLocation:Fremont, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "Hardware Sales Associate", "company": "TRUE VALUE OF LARKFIELD", "location": "Santa Rosa, CA 95403", "job url": "Not Available", "description": "$13 - $15 an hourPart-timeLocally owned hardware store seeking new additions to our sales team for our growing business.Qualified candidates will possess some knowledge in a broad range of departments and items. Have a cheerful and pleasant attitude; a strong desire to learn, and serve our clients with pride and professionalism. You must be reliable and responsible.Job Types: Full-time, Part-timeSalary: $13.00 to $15.00 /hourExperience:Retail Sales: 1 year (Preferred)Plumbing: 1 year (Preferred)Hardware: 1 year (Preferred)"}, {"title": "Hardware Sales Associate", "company": "Grosse Ile Hardware", "location": "Grosse Ile, MI 48138", "job url": "Not Available", "description": "$12 - $15 an hourJob Position:  Sales AssociateOverview:This is a full time employment position, working for a very progressive Hardware store selling products and services in all departments of Electrical, Plumbing, Window & Screen Repairs, Lawn & Garden, Paint, Power Equipment, Hardware, along with potential duties in the Marine, Firearm and Liquor departments.Working knowledge of hardware tools, repair parts and solutions for customers is a must.If candidate does not know the difference between Channellocks and Vise Grips, lawn fertilizer and weed killer, black iron and galvanized pipe, dont apply here, instead seek employment at Home Depot, Lowes or Walmart.Responsibilities:All employees are cross-trained to operate from the Point of Sale/cashier position to working on window screens, loading top soil/mulch/concrete, cutting/threading pipe and making paint. Assembling wheelbarrows, barbeque grills and other products are a normal job function, therefore if you do not possess the mechanical aptitude and experience for this then please apply to Home Depot, Lowes or Walmart.This person will have the basic knowledge and experience working with all forms of financial sale transactions, Cash, Credit/Debit Cards, Checks and In-House Charge Accounts. All financial transactions are to be accurate and honest to the customer and to our store. Each and every movement of inventory must be handled in the point of sale system (currently named RockSolid POS software).Acceptable job performance is measured as accurate transactions, which are reflected in the end-of-day closing report with matching amounts of cash, checks and credit card receipts along with achieving outstanding customer satisfaction with service and problem solving.Naturally, job assignments will change day to day, and therefore the successful candidate must be flexible to adjust to these demands as they transpire.Compensation:This will be an hourly rate of pay position, within a typical workweek consisting of 40 hours, with workday schedules that will vary based on seasonal demands and workload demands from retail operations. Hourly rate will be determined based on work experience, demonstrated knowledge, and your contribution level back to our business.Job Type: Full-timeSalary: $12.00 to $15.00 /hourExperience:Plumbing: 1 year (Preferred)Mechanical & Hardware assembly: 1 year (Required)Retail Sales: 2 years (Required)"}, {"title": "Hardware Clerk", "company": "Walters &amp; Wolf Interiors", "location": "Fremont, CA 94538", "job url": "Not Available", "description": "Hardware ClerkWalters & Wolf is a leading Specialty Construction Company in Fremont, California who has been in business over 40 years. Today we have over nine facilities spanning from Arizona, Washington, California, and Nevada. Walters & Wolf offers their clients a range of products from glass and glazing, custom stone products, curtainwall systems, composite panels rain screen systems, terra cotta products, GRFC precast panels, custom doors, frames, and hardware products, including installations. The company today is comprised of 1500 employees across all geographic locations. We are seeking candidates that characterize themselves as dedicated, hardworking, eager to learn, must have high integrity values, teamwork is a must, and be someone who wants to continue LEARNING with our LEAN environment!At Walters & Wolf you will experience a culture that surrounds itself with exceptional customer service and exceptional quality products and a culture built on trust and family values which sets us apart from all competitors!Our Walters & Wolf Interiors, Fremont location is currently seeking a Hardware Clerk to join our team in Fremont, CA.Successful candidates will possess the following qualifications: Hardware and ormechanical aptitude.Forklift experience preferred.Shipping and receiving experience preferred.Exceptional eye for detail.Able to handle a very fast paced working environment.Self-motivated, responsible, and reliable.Strong multi-tasking and organizational skills.Excellent verbal and written communication skills.Basic computer skills (Microsoft Word, Excel and Outlook)Most important: You are responsible, eager to learn, and not afraid to ask questions. You have a sense of urgency and are driven to succeed. If you are self-motivated, organized, able to work with minimal direction, manage your time well, and are willing to do what it takes to get the job done, then youre a match for us!What We Provide You:Walters & Wolf values its employees contributions and believes strongly in promoting from within. We are a Union Shop that offers a competitive compensation and benefits package, including a medical, dental and vision coverage, pension, paid time off and holidays and more. In addition, we offer the opportunity to work with a phenomenal and elite group of individuals.Walters & Wolf is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.You may email your information to: aglazis @waltersandwolf.comPlease include Hardware Clerk - WWI in the subject line to ensure delivery.Website: www.waltersandwolf.comJob Type: Full-timeJob Type: Full-timeLocation:Fremont, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "Hardware Clerk", "company": "Walters &amp; Wolf Interiors", "location": "Fremont, CA 94538", "job url": "Not Available", "description": "Hardware ClerkWalters & Wolf is a leading Specialty Construction Company in Fremont, California who has been in business over 40 years. Today we have over nine facilities spanning from Arizona, Washington, California, and Nevada. Walters & Wolf offers their clients a range of products from glass and glazing, custom stone products, curtainwall systems, composite panels rain screen systems, terra cotta products, GRFC precast panels, custom doors, frames, and hardware products, including installations. The company today is comprised of 1500 employees across all geographic locations. We are seeking candidates that characterize themselves as dedicated, hardworking, eager to learn, must have high integrity values, teamwork is a must, and be someone who wants to continue LEARNING with our LEAN environment!At Walters & Wolf you will experience a culture that surrounds itself with exceptional customer service and exceptional quality products and a culture built on trust and family values which sets us apart from all competitors!Our Walters & Wolf Interiors, Fremont location is currently seeking a Hardware Clerk to join our team in Fremont, CA.Successful candidates will possess the following qualifications: Hardware and ormechanical aptitude.Forklift experience preferred.Shipping and receiving experience preferred.Exceptional eye for detail.Able to handle a very fast paced working environment.Self-motivated, responsible, and reliable.Strong multi-tasking and organizational skills.Excellent verbal and written communication skills.Basic computer skills (Microsoft Word, Excel and Outlook)Most important: You are responsible, eager to learn, and not afraid to ask questions. You have a sense of urgency and are driven to succeed. If you are self-motivated, organized, able to work with minimal direction, manage your time well, and are willing to do what it takes to get the job done, then youre a match for us!What We Provide You:Walters & Wolf values its employees contributions and believes strongly in promoting from within. We are a Union Shop that offers a competitive compensation and benefits package, including a medical, dental and vision coverage, pension, paid time off and holidays and more. In addition, we offer the opportunity to work with a phenomenal and elite group of individuals.Walters & Wolf is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.You may email your information to: aglazis @waltersandwolf.comPlease include Hardware Clerk - WWI in the subject line to ensure delivery.Website: www.waltersandwolf.comJob Type: Full-timeJob Type: Full-timeLocation:Fremont, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "Hardware Engineer, Microfabrication, Verily Life Sciences", "company": "Verily Life Sciences", "location": "South San Francisco, CA", "job url": "https://www.indeed.com/rc/clk?jk=e218c8104fd1c9ed&from=vj&pos=top", "description": "Apply to this job on the Verily Life Sciences career site at Verily Careers.\nAbout the job\n\nFor more information about this role please see the Verily Life Sciences career site above.\nLocation\n\n\n\nSouth San Francisco, CA, USA\n\nAt Google, we dont just accept differencewe celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes."}, {"title": "Administrative Assistant", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=6d03b7850a35ee22&from=vj&pos=top", "description": "Summary\nPosted: Oct 16, 2018\nWeekly Hours: 40\nRole Number: 114265684\nApples Communications Team is looking for an experienced Assistant to join their team. The successful candidate will be a collaborative team member with a friendly work style. Must be extraordinarily well-organized, able to effectively multi-task & prioritize, and take initiative.\nKey Qualifications\nKey Qualifications\nExperience handling multiple complex calendars\nExcellent organization skills, acute attention to detail, ability to juggle multiple tasks in a fast-paced, and time sensitive environment\nConsistent track record of meeting deadlines and taking initiative to make confident decisions quickly and under pressure\nStrategic thinking needed, able to understand the business and see the big picture\nMust possess a can-do attitude for all situations\nConcise written and verbal communication skills, with a professional demeanor\nDemonstrates a proactive ability to anticipate needs and changes, then react efficiently with independent/sound judgment\nHas a passion for learning new things, continuous improvement and sharing best practices\nDirect experience dealing with sensitive and confidential information with integrity\nComfortable collaborating with all levels of the team\nExtraordinary worth ethic, discreet and trustworthy\nMust be confident to make complicated decisions on their own when needed and able to explain their reasoning\nAbility to influence others; handle conflict appropriately, know when to delegate issues upward\nAble to anticipate change and react efficiently & expeditiously, with a calm approach\nOverall ability to understand and retain new information quickly\nWell-rounded understanding of Purchase Orders, and financial budgeting\nAbility to establish and maintain effective business partnerships\nDescription\nDescription\nProvide full administrative support to team leadership Ability to manage cross-functional meetings with heavy calendaring Organize and maintain complex travel schedules, domestic and international Facilitate meetings in person, video conference, WebEx and teleconference Proactively manage team support, ranging from printer management, office supplies, AOU ordering, catering, resource calendars and more Quickly develop an understanding of the teams operations, culture, policies and procedures Partner with the team for planning & executing key Events on and off Campus Experienced in eApproval, extensive PO submissions and expense reports Work regularly within File-Maker to help maintain budgets Manage facilities and team needs in multiple different buildings Handle and maintain highly confidential and sensitive information Ability to excel working with complex and different personalities diplomatically Experience with on-boarding new employees Efficient in Apple hardware and software Knowledge of how to address IT matters quickly and easily Work with the broader administrative team, to be a leader in team morale\nEducation & Experience\nEducation & Experience\nBS degree preferred, or equivalent experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "Receiver I Lumber Yard", "company": "Builders FirstSource", "location": "Solana Beach, CA 92075", "job url": "https://www.indeed.com/rc/clk?jk=35948ddb2627e875&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.Today, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, handles daily receipt of merchandise received from vendor trucks by performing the following duties.\n\n\nExamines shipment for defects and shortages against receiving documents.\nRecords factors causing goods to be returned.\nUnloads and moves incoming shipments to storage.\nForwards approved receiving documents to appropriate department for processing.\n\nRequirements: High school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience.\n\nManejar la recepcin diaria de mercadera recibida de camiones de vendedores al realizar las siguientes tareas. * Analizar los envos en busca de defectos y faltas en comparacin con los documentos que detallan lo recibido. * Registrar los factores por los cuales se devuelven los bienes. * Descargar y mover los envos entrantes al almacenamiento. * Reenviar los documentos aprobados de los productos recibidos al departamento correspondiente para su procesamiento. Requisitos: ttulo secundario o ttulo de educacin general (GED, por sus siglas en ingls) o de uno a tres meses de experiencia o capacitacin relevante, o una combinacin equivalente de educacin y experiencia.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, protected veteran status or status as an individual with a disability.\n\nIn compliance with the ADA Amendments Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position with Builders FirstSource, please call (214) 765-3990 or email: ADA.Accommodation@bldr.com. Please do not send resumes to this email address - it is intended only to be used to request an accommodation in submitting an application for a job opening.\n\nhttps://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\nEEO THE LAW - English/Spanish\nEEO IS THE LAW - SUPPLEMENT - English/Spanish\nPay Transparency Provision - English/Spanish"}, {"title": "Materials Stocker", "company": "MOUNTAIN HARDWARE AND SPORTS, INC.", "location": "Truckee, CA 96161", "job url": "https://www.indeed.com/rc/clk?jk=0d70066b15d2f844&from=vj&pos=top", "description": "Be part of a growing Employee Owned Company!\n\nMountain Hardware and Sports is now hiring for the following full time position:\n\nMaterials Stocker\n\nDuties include, but are not limited to:\nRequired Experience:\n\nStrong customer service\nUnload, uncrate and assemble merchandise and sales floor displays\nMark items with identifying codes, such as price, stock, or inventory control codes\nEnsure labels are clear and visible\nStock shelves with incoming products accurately and efficiently\nReplace damaged or missing products\nAssist customers on sales floor\nAssist with maintaining cleanliness of the store including merchandising, mopping, dusting, vacuuming, etc.\nProvide general support as needed, including cashiering\n\nRequired Skills:\n\nExcellent customer service\nOutgoing and friendly\nAbility to lift up to 75 lbs.\nAbility to work at heights, climbing ladders and 2-story back stock space\nAbility and comfort walking on uneven surfaces\nRequires continuous physical activity including walking, standing, climbing, and lifting\nAbility to stand for an extended amount of time\nExcellent written and verbal communication skills\nAttention to detail and mathematical skills\nAbility to Multitask and effectively manage time on assigned projects\nInventory control and RF Gun knowledge is a plus\nPoint of Sale system knowledge is a plus\nAbility and willingness to work flexible hours including evenings, weekends, and holidays\n\nCandidates should be able to work in a fast paced environment and enjoy being part of a team\n\nBenefits include medical, dental, vision, vacation and sick pay, significant store discount and participation in Employee Stock Ownership Program (ESOP) and 401K"}, {"title": "Cashier I Retail Sales Part-Time", "company": "Builders FirstSource", "location": "Solana Beach, CA 92075", "job url": "https://www.indeed.com/rc/clk?jk=5c1698ac7600ee64&from=vj&pos=top", "description": "Part-timeThe Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and six (6) months of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Installer I", "company": "Tesla", "location": "Vista, CA", "job url": "https://www.indeed.com/rc/clk?jk=76fb21f37a3703df&from=vj&pos=top", "description": "THE ROLE\n\nThe Installer I will be part of Teslas Energy Field Operations team. As an integral member of the team, the ideal candidate will work cooperatively with other team members to successfully complete the installation of residential PV solar systems, battery storage and EV wall connectors safely and on time. It is the responsibility of every Installer to ensure safe work practices for Teslas installation team. New hire training and continued training will be provided.\n\nRESPONSIBILITIES\n\nLayout, assembly and installation of solar array and mounting hardware\nAssist with the electrical wiring of all energy products\nPrepare and clean-up job site\nWork with the warehouse team to pull materials for each installation job\nAttend weekly team meetings and mandatory training sessions on new products, installation methodology and safety\nProvide an exceptional customer experience to all customers throughout the process\nAdditional duties required as needed\n\nREQUIREMENTS\n\nRoof work, general construction, or carpentry experience preferred\n Ability to safely handle tools and materials such as: ladders, inverters, solar panels, panel boards, batteries, and other similar electrical equipment, lumber, roofing materials, etc.\nAbility to work in extreme environments (example: hot sun, cold, crawl spaces, etc.)\n Capable of working at heights including on rooftops, climbing ladders and stairs; and performing repetitious duties, including lifting, bending and standing for long periods of time\nExperience using basic hand and power tools\nBasic computer skills preferred\nMust have excellent written and verbal communication skills\nMust have excellent customer service skills\nExcellent attendance is crucial for the team to achieve success\nAbility to work well with others in a collaborative team environment\n\n\nApply\n\nTesla participates in the E-Verify Program"}, {"title": "Stock Person", "company": "Taj Mahal Hardware", "location": "Brooklyn, NY 11218", "job url": "Not Available", "description": "$10.20 - $14.10 an hour (Indeed estimate) Spanish speaking required!Unloading boxes,Putting products onto the shelvescleaning aisles,making room for new products to go on shelves,taking care of deliveries that arrive weekly/monthly,restockingproviding order list to the assistant manager///Basic hardware knowledge is a must,Punctual,working in a fast environment,must be able to pick up atleast 50lbs!!!OSHA 10 will Be provided,*spanish speaking required*Job Type: Full-timeLocation:Brooklyn, NY 11218 (Preferred)Language:Spanish (Preferred)"}, {"title": "Seasonal Associate", "company": "Virgil&#39;s Hardware", "location": "Glendale, CA", "job url": "Not Available", "description": "Part-time, TemporarySeasonal Positions - Now hiring individuals to assist working in our Outside Christmas Tree Lot. Must be able to lift and maneuver heavy objects. Assisting customers and loading Christmas Trees into vehicles. Please apply within/See or call Ryan @ (818) 242-1104.520 N. Glendale AvenueGlendale, CA 91206Job Type: Part-time"}, {"title": "Cashier", "company": "Farm &amp; Home Hardware", "location": "Ohio", "job url": "https://www.indeed.com/rc/clk?jk=33b949173ac612c1&from=vj&pos=top", "description": "A Cashier's job is to maintain the register, direct customers, and transfer calls.\nThe Cashier is a key element of our team. Usually the first contact to our customers, they are responsible for greeting and directing individuals to an available Clerk.\nThe Cashier is responsible for answering a majority of all incoming phone calls. They answer questions, take messages, and transfer calls as needed."}, {"title": "Cashier", "company": "Cash Wise", "location": "Minot, ND", "job url": "https://www.indeed.com/rc/clk?jk=c2a2994b0709cd95&from=vj&pos=top", "description": "Part-timeCoborn's Wants YOU\nWe are hiring for an enthusiastic and friendly Cashier who is passionate about providing remarkable guest service with a Say Yes to the Guest attitude. The Cashier is responsible for upholding Coborns high standard of service by scanning, ringing and/or entering guest merchandise into the cash register, collecting guest payment and delivering appropriate change, bagging, and assisting guests with questions or concerns.\nResponsibilities\nA day in the life of the Cashier may include any combination of the below duties (and more!):\n\nMaintain a Say Yes to the Guest attitude by providing remarkable guest service.\nOperate a cash register in an accurate and efficient manner. Collect money, checks, electronic payments, and coupons from the guest and make correct change and assure the security of the cash drawer at all times.\nScan or ring items accurately and efficiently. Identify and key in department numbers, produce items, UPC numbers, look up numbers, weights, and other items that are unable to scan.\nAssist guests with locating merchandise and answering questions and/or concerns.\nAssist with bagging guest merchandise in a careful manner as necessary.\nStock and/or face merchandise on store shelves as needed.\nFollow all applicable federal, state and local applicable laws, rules and restrictions.\nPerform other duties within the Front-End department or other areas as assigned.\nQualifications\nThe ideal candidate for this position:\n\nis a self-motivated and enthusiastic people person who is a guest service rock star;\nhas excellent communication skills;\nhas the ability to efficiently and accurately operate a POS system and accurately handle all forms of payment transactions; and\nis excellent with multi-tasking.\n\nMust be able to work every other weekend and rotating holidays. Must be able to work a wide variety of shifts based on guest and location needs.\nOverview\nAt Coborns, Inc. we go all out to Be Remarkable. Our culture celebrates employee ideas and encourages creative innovations. Were growing, learning, and overflowing with energy. In a dynamic atmosphere that welcomes diversity, we are investing in our employees, along with the growth of our company. Join our grocery teams and connect with guests in a fast-paced retail position with advancement opportunities where you are encouraged to shine as you use your guest service skills. If you're friendly and dependable and you like to work with terrific guests, we'd love to talk about an opportunity on our team.\nCoborn's, Inc. is a fast-growing employee-owned grocery retailer located the Midwest. Our grocery store formats include Coborn's, Cash Wise, Marketplace Foods, and Save-A-Lot stores and we offer unique online grocery home delivery services through our CobornsDelivers and Cash Wise Delivers locations. Coborn's Inc. also owns and operates liquor stores under the Coborn's Liquor, Cash Wise Liquor, Payless Liquor, and Captain Jack's brands. Additionally, our fuel and convenience division, in-house grocery warehouse and distribution center, in-house Central Bakery, and Tops Cleaners are significant assets to our operations. We also have a handful of other retail entities in the markets where the fit is right: Little Dukes, Holiday Stationstores, Ace Hardware, Caribou Coffee, Dunn Bros Coffee, and Subway.\n\nOur remarkable employees strive to inspire happiness, healthy living and simplicity one guest at a time. With a vibrant and fun work environment, ongoing opportunities for career growth, and generous benefits packages, Coborn's offers a bright future for all employee owners.\n\nHeres a list of some of the many benefits that we offer:\n\nHealth, Dental, Life and Disability Insurance\nVacation Pay\nHoliday and Sunday Premium Pay\nFlex Spending Accounts (FSA)\nEmployee Stock Ownership Plan (ESOP)\n401(k) plans\nVoluntary Benefits\nTuition Reimbursement\n\nBecause we value our people and know our employees enjoy shopping our stores, we offer an employee discount on a variety of private brand items when employees use their MORE Rewards account at checkout.\nBecause we know everyone needs a coffee break to recharge from time to time, employees who work in a store with a coffee shop receive a discount on their purchase!\nIn addition to this list, we also offer flexible scheduling. We understand that many of our employees are trying to juggle school, practice, family time, errands and personal hobbies, all with only about 16 hours of awake time in a day.\n\nWe celebrate a culture of recognition, encouraging employees to recognize and thank one another for remarkable behavior. We even have an app for that!\n\nWere always looking for motivated, high-potential employees who want to be part of our next generation of leaders! There are opportunities to grow within our company to positions you may not yet even know exist. Coborns, Inc. offers a variety of development programs for employees who want to grow their careers with us.\n\nFinally, we believe that building a team of people with different backgrounds, beliefs, experiences and perspectives inspires fresh thinking and opens us up to new possibilities. We are an EEO/AA Employer - All qualified individuals, including minorities, females, veterans and individuals with disabilities are encouraged to apply."}, {"title": "Customer Service/Sales", "company": "The Home Depot", "location": "Encinitas, CA 92023", "job url": "https://www.indeed.com/rc/clk?jk=86bb9c1b864189d4&from=vj&pos=top", "description": "Job Description\nPosition Purpose:\nCustomer Service/Sales associates provide fast, friendly service by actively seeking out customers to assess their needs and provide assistance. These associates learn about products using our tools, and provide information to customers in order to sell an entire project. Associates in this position will learn how to greet, qualify, recommend and close every customer in their department, and know how to handle basics in adjacent departments. Customer Service/Sales associates maintain the in-stock condition of assigned areas, and ensure it is clean, shop-able, and safe. Each associate has the responsibility of providing a safe working and shopping environment by following all safety policies & standards, completing specified safety training, immediately correcting hazards & unsafe conditions or reporting conditions to the Manager on Duty, and working safely as not to endanger themselves, co-workers, vendors, or customers. These associates work in cooperation with their Department Supervisor and other associates in their department as well as other departments. Specific store departments may include Building Materials, Dcor, Electrical, Flooring, Garden, Hardware, Kitchen & Bath, Lumber, Millwork, Paint, Plumbing and Tool Rental. The Customer Service/Sales position types may include Department Sales, Lead Generator, Pro Account Sales, Sales Specialist, Special Services, and Customer Order Specialist."}, {"title": "Customer Support Specialist I", "company": "WIS International", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=4e7f8a799247c287&from=vj&pos=top", "description": "Desired: TroubleshootingWORKING RELATIONSHIPS\nReports To: Paul Lam  Manager, System Support\n\nSupervises: Non-Supervisory\n\nWORKS WITH\nWithin the Company: The employee interacts with all levels of WIS International employees by telephone or in person providing technical support assistance.\n\nOutside the Company: The employee has limited outside interactions with company customers, and vendors.\n\nJOB SUMMARY\n\nUnder the close supervision of the Manager of System Support this position exists to provide telephonic support for the office and Inventory System users by recommending immediate answers or solutions to their hardware and/or software problems or by forwarding the problem to the appropriate technical expert for resolution; perform simple or routine quality assurance testing as required or assigned.\n\nJOB DUTIES\nResolves user hardware/software issues by determining the nature of the problem, formulating a diagnosis, providing timely and accurate solutions, and referring the user to an appropriate technical expert when necessary.\nEnhance future troubleshooting capability by remaining knowledgeable of user functions as well as technical changes/enhancements to hardware and software for the office and inventory systems.\nDefine user needs and ensure timely resolution of problems or questions by coordinating and cooperating with end-users and technical personnel.\nProvide information to management about unusual trends or problems by maintaining a call tracking log to categorize all calls and by then analyzing and reporting log data.\nSupport Quality Assurance efforts by testing Client Software and reports, conducting field parallel and beta testing, and by reviewing and resolving QA problems.\nEnsure an excellent level of customer service by following up on problems referred to others; by giving calm and positive reinforcement to callers in stressful situations; and by promoting good relationships with all departments, co-workers, and field personnel.\n\n \nJOB REQUIREMENTS\nEducation: This position requires a high school diploma or an equivalent degree. Position also requires an in-depth knowledge and understanding of computer hardware and software troubleshooting methodologies.\n\nExperience: Must have ability to troubleshoot both PC hardware and software problems. Two to three years of experience with the field inventory operations would be helpful.\n\nSKILLS:\nAbility to understand, evaluate, and diagnose hardware/software difficulties and provide technical assistance to resolve problems or refer them on to a technical expert.\nAbility to remain cognizant of user requirements and technical changes/enhancements to hardware and software for the Office and Inventory Systems and apply this knowledge in troubleshooting user problems.\nAbility to communicate effectively, both verbally and in writing, in a timely manner with end-users and technical personnel.\nAbility to enter data into a spreadsheet or database to track, identify and isolate types of calls. Ability to analyze the data, and report back on the results.\nAbility to test all required software, conduct field parallel and beta testing, and review and resolve associated problems.\nAbility to calmly provide assistance to callers in stressful situations as well as the ability to promote good working relationships with all departments, co-workers, and field personnel.\nAbility to effectively operate multiple telephone lines when responding to time sensitive hardware/software inquiries from field managers.\nAbility to provide customer support by telephone and pagers outside normal business hours and weekends.\nEFFORT FACTORS\nPhysical Demands:\nRequires the ability to sit continuously, stand occasionally and walk occasionally.\nRegularly requires a great deal of visual concentration using equipment such as a computer.\nInfrequently requires bending, squatting or climbing a stool/ladder when in the field\nInfrequently requires lifting equipment >22lbs\nAbility to drive safely to required inventory events of offices\nAbility to periodically fly or use other public transportation when necessary to attend field inventories in order to enhance training skills.\n\n\nMental Demands:\nMust be mentally adaptable and flexible to deal with a variety of people and changing priorities\nMust be able to handle the pressure of working to schedules, may occasionally require unusual hours of work or working during nights and weekends supporting the Helpdesk by a mobile phone or a pager.\nMust be able to analyze causes of interpersonal conflict (both with employees and customers) and resolve these sometimes-complex issues despite ambiguities\nMust be able to analyze data in a computerized environment\nMust be able to communicate in a professional manner\nWORKING CONDITIONS\n\nThe Customer Support Specialist I (CSSI) position is required to have reliable personal transportation. Depending on the circumstances, there may be occasional travel outside San Diego for training purposes.\n\nThe CSSI works in a well-maintained corporate office or similar environment. Occasionally the employee may visit outdoor inventories that are conducted for retailers such as home improvement centers, lumber companies, etc. The employee may occasionally be exposed to unusual odors, or excessive noise, or health hazards or temperature extremes; in which case, proper precautions will be taken to protect the employee.\n\nWIS International maintains a Drug Free Workplace in compliance with the federally mandated Drug Free Workplace Act. Be advised that some WIS International positions require pre-employment drug and alcohol screening as a condition of employment.\n\nWIS International maintains a smoke-free work environment. Smoking is not permitted in any Company facility or vehicle.\n\nIn seeking to provide a safe work environment for all staff, the WIS International maintains a violence-free work environment. Any type of violent behavior committed by or against staff members will not be tolerated. CSSIs are expected to conduct themselves in a professional manner and in accordance with the Code of Conduct and all other company policies. Intimidating, threatening or violent behavior against other WIS staff, vendors, clients, or property, whether committed by supervisors, non-supervisory staff, or non-employees, during work or off-duty hours, will not be tolerated.\n\nThe physical demands and work conditions described here are representative of those an employee encounters while performing the duties/responsibilities of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\nEqual Employment Opportunity Policy Statement\nWIS International, in recognition of its responsibilities to its staff and the community it serves, affirms its policy to assure fair and equal treatment in all its employment, recruitment and placement practices, for all persons. WIS International shall strive to recruit and maintain a workforce that is representative of the communities it serves.\n\nThe Company will not discriminate on the basis of race, color, sex, sexual orientation, religious creed, national origin, citizenship, age, ancestry, pregnancy, marital or veteran status, medical condition, physical or mental disability or any other characteristic as established by law."}, {"title": "Hardware, Product Design Internship/Co-op", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=9fcf6b04f7a67a50&from=vj&pos=top", "description": "InternshipDesired: CADDesign ExperienceSummary\nPosted: Nov 12, 2018\n\nRole Number: 200011124\nApple is currently seeking enthusiastic ME majors who can start work in January or Summer, 2019. The interns will provide support to design, engineering, prototyping and validation activities for all hardware product lines.\nKey Qualifications\nKey Qualifications\nAbility to work in team-based environment.\nSelf-motivating.\nStrong analytical/problem solving skills and ability to use statistical tools and techniques.\nKnowledge of finite element analysis theory and general mechanical engineering analysis.\nFlexibility and comfort working in a quickly changing environment.\nDesired Experience in any of the following:\nPrior experience in product design (preferably consumer electronics).\nExperience with component modules (LCD assemblies, batteries, camera modules, etc.) and their interconnect (FPC design and ACF bonding).\nAbility in plastic and metal part design.\n3-D CAD skills\nExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.\nHandheld, portable and/or hardware experience.\nIntegration of wireless antenna (GSM, GPS, Wifi) into mechanical enclosures.\nDesign of audio subsystems (microphone, speaker, receiver).\nUnigraphics or Pro-engineer fluency.\nDescription\nDescription\nAs a member of a multi-functional design team at Apple, you will help to create the next generation of the world's finest hardware devices. You will conceive, design, and bring into production products that will re-define user experience. You will work closely with many different multi-functional teams including Industrial Design, Packaging, Safety, Hardware Engineering, EMC, and Marketing.\nEducation & Experience\nEducation & Experience\nWorking toward BS, MS or PhD in Mechanical Engineering, Materials Science or similar degree.\nAdditional Requirements\nAdditional Requirements\nGood written and verbal communication Ability to juggle multiple requests/tests"}, {"title": "Warehouse Specialist Second Shift Ace Hardware Summit Cross Dock", "company": "ACE Hardware", "location": "Chicago, IL", "job url": "https://www.indeed.com/rc/clk?jk=3e13de232a5f0539&from=vj&pos=top", "description": "$13.75 an hourWarehouse Specialist\nAce is a place for you to have a long term career you can be truly proud of, competitive pay, unheard of financial incentive opportunities, and comprehensive benefits for you and your family. Ace Hardware Distribution Centers are where team players collaborate to support amazing retailers be the most helpful hardware stores on the planet.\nOur incredible growth is creating exciting opportunities for Warehouse Specialists in our Summit Cross Dock. Come serve a purpose and take pride in enabling independent stores owners to compete and grow as they execute our ultimate goal; being Helpful within their communities.\nWe have a number of Warehouse Specialist positions such as order fillers, stockers, receivers and loaders.\nThe Benefits to You are Outstanding!\n\nCompensation: Our average hourly wage rate is $13.75 plus .55 shift premium for second shift\nHealth Insurance: Support yourself and your family with Ace subsidized medical coverage and benefits along with dental, vision, prescription drug coverage, and flexible spending accounts.\nPaid Time Off: Generous paid time off program.\n401K: Company match plus additional company contributions.\nTuition Reimbursement: Continue your education with a tuition reimbursement program.\n\nOur Amazing Warehouse Specialist Team:\n\nParticipates in a safe work environment ;\nDemonstrates quality work performance ;\nSupports our Stores / Owners by meeting productivity goals ;\nHelps each other by maintaining good attendance ;\nExpands their warehouse knowledge by cross training in other departments; and\nDemonstrates our Ace Values of Winning, Excellence, Love, Integrity, Gratitude, Humility, Teamwork .\n\n\n\nHere are a few necessities to get you started.\nYou have a desire to work at Ace Hardware  The helpful place;\nWell need a little of your time so we can learn more about you;\nYou must be 18 years or older; and\nYou have an idea of the schedule that would fit you best\n\n\nWe want to hear from you!\n\nWhen most people think of career opportunities with Ace Hardware, they often think of the helpful cashiers and sales associates at their local store. However, have you also considered the people behind the scenes who select, promote, ship and process the invoices for more than 75,000 products? Maybe you haven't, but we'd like you to. Because together we help our customers take care of their homes. Come find out why a career with the Ace Hardware Corporation is one of America's best kept secrets.\n\nEqual Opportunity Employer\n\nAce Hardware Corporation and its subsidiaries are committed to a policy of promoting equal employment opportunities. The company recognizes the importance of diversity and leveraging the skills and talents of all people to the mutual advantage of each individual and the organization. The company is committed to the prevention of employment discrimination related to race, religion, color, sex (including sexual harassment), gender identity, national origin, age, marital status, disability and military discharge, or any other action covered by federal or state laws."}, {"title": "Hardware Sales Associate", "company": "S&amp;H HARDWARE", "location": "Philadelphia, PA 19149", "job url": "Not Available", "description": "We are looking for an individual who has experience in a retail hardware:WITH EXPERIENCE WILL PAY WELL!A successful candidate must have the skills necessary to preform the daily tasks required including:Hardware knowledge and understand how to do the basics like:How to measure using a measuring tapeLifting up to 75lbsGood communication skillsGood teamwork attitudeUnderstand how things workGood with their handsBe able to move around as per neededWilling to grow with the companyKnowing how to cut keys a plus.Knowing how to cut glass a plus.Previous hardware store experience a plus.WILL TRAIN IF YOU ARE WILLING TO LEARNRESUMES ARE A HUGE PLUS AS WELL AS REFERENCES!IMMEDIATELY HIRING FOR NEW POSITIONSCOMPETITIVE WAGES FOR THOSE THAT WANT TO EXCEL WITH OUR TEAM!!!------------------------------------------------------------------------------------------------------------------------------IF YOU ARE NOT RELIABLE AND SEEM TO GET SICK A LOT OR NEED MANY DAYS OFF...PLEASE REFRAIN FROM APPLYING.WE NEED RELIABLE AND SUCCESSFUL CANDIDATES AS APART OF THE TEAM.Job Type: Full-timeExperience:Retail Sales: 1 year (Preferred)Plumbing: 1 year (Preferred)Electrical: 1 year (Preferred)Hardware: 1 year (Preferred)"}, {"title": "LABORER CUSTODIAL", "company": "United States Postal Service", "location": "Barrigada, GU", "job url": "Not Available", "description": "$32,588 - $52,082 a yearDesired: Driving ExperienceDriver's LicenseClean Driving RecordUnited States Postal Service\nExternal Publication for Job Posting 10254906\n\nIf this job requires qualification on an examination, the number of applicants who will be invited to take or retake the\n\nexamination may be limited.\n\nBranch\n\nHonolulu District\n\nJob Posting Period\n\n11/20/2018 - 11/28/2018\n\nThis job has an exam requirement. Examining capacity has been reached for this posting. Applicants with an eligible exam\n\nscore will be considered. Applicants without an exam score cannot be considered. If you apply without an exam score, you\n\nmay be invited to take the exam later if job opportunities remain unfilled. Exam invitations are sent by email; watch your\n\nemail and spam filters. Veterans are encouraged to apply and will receive preference in examining in accordance with\n\nVeteran Preference laws and regulations.\n\nJob Title\n\nLABORER CUSTODIAL\n\nFacility Location\n\nBARRIGADA\n\n489 ARMY DR\n\nBARRIGADA, GU 96913-9998\n\nPosition Information\n\nTitle: LABORER CUSTODIAL\n\nFLSA Designation: Non-Exempt\n\nOccupation Code: 3502-03XX\n\nNon-Scheduled Days: SATURDAY/SUNDAY\n\nHours: 11:00 P.M. TO 7:30 A.M.\n\nDRIVING REQUIRED: Applicants must have a valid state drivers license, a safe driving record, and at least two years of\nunsupervised experience driving passenger cars or larger. The driving must have taken place in the U.S. or its possessions\n\nor territories or in U.S. military installations worldwide.\n\nSALARY RANGE: $32,588 - $52,082 annual salary PLUS 25% TCOLA paid bi-weekly\n\nFINANCE NUMBER: 130500\n\nBENEFIT INFORMATION: This is a career position which offers excellent benefits. Newly hired employees are covered by\n\nthe Federal Employees Retirement System (FERS). Upon hire, employees are eligible to contribute into the Thrift Savings\n\nPlan (TSP) which is similar to 401(k) plans. We also offer the option to enroll into the Federal Employees Health Benefits\n\n(FEHB) program as well as the Federal Employees Group Life Insurance (FEGLI). Dental, Vision and Long-Term Care\n\nInsurance Programs as well as Flexible Spending Accounts to cover eligible out-of-pocket health care and dependent care\n\n(day care) expenses are also available. We offer ten paid federal holidays as well as accrued vacation and sick leave.\n\nPersons Eligible to Apply\n\nAll U.S. Citizens, permanent resident aliens, citizens of American Samoa or any other territory owing allegiance to the United\nStates. Applicants must be available for screening activities, including an interview. Applicants entitled to veterans\npreference and/or covered by the Veterans Employment Opportunity Act may apply for any posted position. This position is\n\nrestricted to applicants eligible for veterans preference. Applicants who are not entitled to veterans preference may be\n\nconsidered only when preference eligible applicants are not available for appointment.\n\nApplicants must apply online at www.usps.com/employment to be considered for this employment opportunity. You must\n\nhave a valid email address to apply as communication regarding employment opportunities, examinations, interviews and\n\nbackground checks will be conveyed by email. Please add the following email domain addresses to your contact list to allow\n\nall correspondences to be received.\n\n@usps.gov @psionline.com @geninfo.com @uspis.gov\n\nEXAM REQUIRED: If you are invited to take this test, instructions regarding the exam process will be sent to you via email.\n\nPlease ensure you can receive email messages from our test vendor and follow instructions carefully so you can be\n\nconsidered for this employment opportunity.\n\nNOTICE SCREENINGS REQUESTED: You may receive multiple requests for background checks in regards to this\n\nemployment opportunity. Respond to all requests quickly as we anticipate filling our vacancies quickly and nonresponses\n\nmay result in disqualification for this opportunity.\n\nCurrent non-career Postal Service employees who wish to apply for this vacancy must go to usps.com/employment and use\n\nyour existing eCareer Profile to apply. Do not log into LiteBlue; if you logged into LiteBlue, log out and close your browser\n\nbefore going to usps.com/employment.\n\nFunctional Purpose\n\nPerforms manual labor in connection with maintenance and cleaning of the buildings and grounds of a postal facility; assists\n\nin firing low pressure boiler and in making minor repairs to the building and equipment.\n\nDUTIES AND RESPONSIBILITIES\n\n1. Makes or assists in making minor maintenance repairs to building and equipment.\n\n2. In smaller buildings assists the fireman-laborer in firing the boiler; in firemen-laborer's absence fires and cleans the boiler.\n\n3. Operates a variety of power driven equipment such as floor scrubbers, floor sanders, waxers, and wall washers; adjusts\n\nbrushes, buffers, and other attachments on machines; uses wax, polish, and other protective agents appropriate for the\n\nvarious surfaces; washes walls and ceilings from scaffolding.\n\n4. Performs general laboring duties such as uncrating and assembling furniture and fixtures using bolts and screws for\n\nassembly, loading and unloading supplies and equipment.\n\n5. Performs janitorial duties such as cleaning, scrubbing, waxing, and polishing floors; washes walls and ceiling; dusts\n\nfurniture and fixtures; cleans hardware and toilet fixtures; washes windows; cares for lawns and shrubs; cleans sidewalks and\n\ndriveways and removes ashes, snow and ice.\n\n6. In addition, may: operate elevator, stack supplies in storage rooms and on shelves; move furniture and equipment.\n\nSUPERVISION\n\nSupervisor of unit to which assigned.\n\nQualified applicants must successfully pass a pre-employment drug screening to meet the U.S. Postal Service's requirement\nto be drug free. Applicants must also be a U.S. citizen or have permanent resident alien status.\n\nIMPORTANT INFORMATION:\n\nApplications must be submitted by 11:59 p.m., Central Time, of the posting's closing date. Applicants claiming veterans'\npreference must attach a copy of member copy 4 (only) of Certificate of Release or Discharge from Active Duty (DD Form\n214) or other proof of eligibility if claiming 10-point veterans' preference. The United States Postal Service (USPS) is an\nequal opportunity employer. The USPS provides reasonable accommodation for any part of the application, interview, and/or\nselection process, please make your request to the examiner, selecting official or local manager of Human Resources. This\nrequest can also be made by someone on your behalf. Explain the nature of your limitations and the accommodation\nneeded. The decision on granting reasonable accommodation will be on a case-by-case basis.\n\nSPECIAL NOTE: Current career Postal Service employees are ineligible to apply to this posting."}, {"title": "Hardware Sales Associate", "company": "Richmond Hardware &amp; Paint", "location": "Braintree, MA", "job url": "Not Available", "description": "$14 - $16 an hourPart-timeDesired: Retail SalesPAINT & HARDWARE TEAM MEMBERMake $14,$16 or $18 per hour based upon experience!**Put your experience to work for usPART TIME or FULL TIMEDo You: Possess a fun positive personality.Have fun working with tools & getting your hands dirtyEnjoy working where things are always happening.Love to work with our customers and build relationshipsAre tired of the same routine and want to make a positive impactIf this sounds like youThen we are looking for you!!!Position Description: PAINT & HARDWARE STORE TEAM MEMBERWho we are looking for: Handymen or women.Skilled professionalsCollege students w/retail experienceRetail employees looking for a change of paceRetirees or VeteransWhat we offer: Fun, relaxed working environment.A workplace where you are not just a number.Competitive hourly rates based upon experience.Reasonable hours with flexible scheduling.Team Atmosphere work environmentGreat Employee discountsHealth Benefits to full-time individualsRichmond Hardware and Paint, a family owned and operated store, has been the leading hardware store for Braintree, Massachusetts and surrounding communities since 1945. We are a full service distributor of paint, fasteners, plumbing supplies, electrical supplies, tools, lawn and garden supply, and more. Richmonds was founded on the belief that every customer should be treated as a lifelong friend and we proudly practice this tradition today.Qualified candidates must be committed to assisting the team and providing outstanding service to each customer. Hardware and or Paint store experience a plus!Required skills: Minimum two years of Retail store experience. Hardware experience a plus!!Ability to pass a background check and drug test.Positive and professional personalityStrong organizational skillsAbility to bend, lift, carry and move packages up to 70lbs.Ability to move about our retail store without assistance.Ability to operate a cash register and to process salesJob Types: Full-time, Part-timeSalary: $14.00 to $16.00 /hourExperience:Plumbing: 1 year (Preferred)Hardware: 2 years (Required)Retail store: 2 years (Required)Retail Sales: 2 years (Required)"}, {"title": "Cashier II Retail Sales Full Time", "company": "Builders FirstSource", "location": "Solana Beach, CA 92075", "job url": "https://www.indeed.com/rc/clk?jk=818e7ff8fe46a5de&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.Today, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder general supervision, greets customers and receives payment; issues receipts, refunds, credits, or change due to customers; package customer purchases.\n\n\nProvides training to Cashier I\nApproves cash refunds or issues credit memorandums to customers for returned merchandise.\nProvides product information, location, and general store knowledge. Directs customer to product pick-up point, if necessary.\nOpens and closes-out till and accurately documents all transactions, makes accurate change, verifies credit cards and checks, and balances receipts.\nAssists in pricing and stocking inventory, display preparation and maintenance, and maintains quality store presentation. Participates in annual physical inventory activities.\n\nRequirements: High school diploma or General Education Degree (GED) and two (2) years of related experience, or an equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, protected veteran status or status as an individual with a disability.\n\nIn compliance with the ADA Amendments Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position with Builders FirstSource, please call (214) 765-3990 or email: ADA.Accommodation@bldr.com. Please do not send resumes to this email address - it is intended only to be used to request an accommodation in submitting an application for a job opening.\n\nhttps://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\nEEO THE LAW - English/Spanish\nEEO IS THE LAW - SUPPLEMENT - English/Spanish\nPay Transparency Provision - English/Spanish"}, {"title": "Hardware QA Tester", "company": "Keywords Studios", "location": "Redmond, WA 98052", "job url": "https://www.indeed.com/rc/clk?jk=f90564e2dae076ed&from=vj&pos=top", "description": "$23,000 a yearSummary\n\nThe Hardware QA Tester is responsible for the daily test operations. The candidate who fills this position will be responsible for reporting and reproducing bugs in the client and VMC databases, as well as collecting various test metrics as warranted by test plans.\nResponsibilities\n\nResponsible for testing a variety of games titles, audio and video media, peripherals and the hardware itself on the Xbox gaming console\nEnter test data into a proprietary database application\nPerform reproduction of testing errors\nPerform ad-hoc game play\nProvide verbal and written feedback on the products under test\nPerform reproduction trials of issues based on the reproduction requirements\nTriage and document bugs and report to Test Lead using a proprietary database application\nWrite up issues utilizing Team Foundation Server\nSet up and install software on PCs and gaming consoles\n\nRequirements:\nQualifications\n\nStrong knowledge of Xbox One games\nStrong knowledge of the operation of the Xbox hardware, peripherals, and Dashboard\nKnowledge of the Windows 10 OS\nBe able to multitask and perform well in a high pressure situation\nStrong verbal and written communication\nAble to work with little supervision, have a high level of organization skills, and adapt to a quickly changing test environment\nExcellent triage and defect writing skills\nFamiliar with the gaming industry\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law"}, {"title": "Production Worker/Machine Operator", "company": "Lucky Line Products, Inc.", "location": "San Diego, CA 92126", "job url": "Not Available", "description": "Lucky Line Products, Inc.is an established manufacturer and distribution company looking for an Assembly Line Production Worker. The Production Worker is responsible for running the ZED (skin card) machine and preparing customer specific orders. The position works closely with employees from other work stations in a team environment. We offer a competitive salary with a full, generous, benefits package, including Paid Time Off, with additional opportunities for driven candidates.Responsibilities: Operates skin card machinePerforms complex set-up and assembly, explaining production procedures, drawing and instructionsPrepares custom customer specific orders according to pick listPrepares outside processing materialsBuilds specific displays (key shape and key reels).Assists in pulling raw material for productionObtains necessary supplies and equipment for accomplishing tasksPromotes compliance with safety standards and security measures consistent with Company policyProvides detailed production reports for managementCross trained in all work stationsPerforms other duties as assignedOperates a stand-up lift (certification required)Preferred experience/ background: Two to Five years of general experience in production or manufacturing warehouse related environment.Ability to stand for long periods of time, lift up to 70 poundsAble to read, write and speak EnglishExperience working with machinery and light repairs a plusStrong work ethics and excellent attendanceGood eye-hand coordinationPreferred educational background: High school graduate/GED required with additional knowledge or training in manufacturing processes associated with production demands a plus.Passing Background Check Required: Yes - Passing Drug Screen Required: Yes, & Education VerificationWork Environment: Small, friendly, family type of environmentBenefits:  Medical, Dental, and Life Insurance (All 100% paid by employer), Dependent Health Coverage (35% paid by Lucky Line), Medical Reimbursement Plan, Education Reimbursement, 401(k) plan, Cafeteria Plan, Paid Time Off plus other benefits.About the Company:  Around thirty-five employees, Lucky Line has been in business since 1961 and is known as the leading key accessory company in the locksmith and hardware industry. Products are packaged and sold to Hardware stores, Locksmiths, Car Rental companies and other retail outlets as well as the Advertising Specialty Industry, OEM, Industrial and Government. We have thousands of products and add to our product line each year. We take pride in our quality and service to our customers.Job Type: Full-timeExperience:Machine Operator: 1 year (Preferred)Manufacturing: 2 years (Preferred)Location:San Diego, CA 92126 (Preferred)Work authorization:United States (Preferred)"}, {"title": "Remote Support Position (IN OFFICE)", "company": "Watchlight / Alarm Relay", "location": "El Cajon, CA 92020", "job url": "Not Available", "description": "$13 - $14 an hourDesired: iOSCustomer ServiceRemote Support Position (IN OFFICE) - Entry LevelSecurity company in El Cajon looking for a motivated professional for a full-time support position in office. This position will require working with critical systems, web services, and security hardware. The candidate should be a team player with strong communications skills. Preferably IT related backgrounds with experience in router setup, computer configuration, and general electronic hardware knowledge.Requirements :Must be dependable, on-time, and responsibleMaintain a positive attitude at all timesGreat phone etiquette and customer serviceActively listen to customers, understand the issue at hand, and communicate solutions both verbally and writtenDocument customer interactions and knowledge solutionsActively learn new hardwire, software, conceptsMust be able to learn quicklyMust be capable of reviewing wiring diagrams and installation/setup manualsPreferred Qualifications :Understanding of CRM DynamicsGeneral knowledge of navigating Windows and MacWeb based support, familiar with iOS and Android platformsUnderstanding of home automation products (Z-Wave, ZigBee, Nest)Job Type: Full-timeSalary: $13.00 to $14.00 /hourExperience:Customer Service: 1 year (Preferred)Phone Skills: 1 year (Preferred)IT: 1 year (Preferred)"}, {"title": "Optical Engineer", "company": "Quartus Engineering", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=885043d00c02830b&from=vj&pos=top", "description": "Quartus Engineering Incorporated (www.quartus.com) is a leading provider of mechanical, optical, aerospace and electrical engineering services and integrated hardware solutions for the aerospace, defense, entertainment, commercial, consumer, and medical industries. We support our clients with advanced mechanical, optical, aerospace and electrical design, analysis, optimization, test, prototype development, and manufacturing using modern CAD and CAE tools and leveraging our clean room laboratories.\n\nWe are looking for Optical Engineer in our San Diego, CA office to join our growing team.\n\nEssential Job Functions:\n\nDesign, develop and analyze optical systems by applying principles in optics, mechanics, thermodynamics, and materials science.\nDesign components and systems for both short-term and long term solutions for customer applications.\nProvide tolerance analysis and recommendations for tolerances required for system performance.\nAnalyze problems and design custom solutions on a project by project basis.\nProvide reports in PowerPoint or word describing in detail the problem, design space, solutions, and limitations of a design.\nBuild test stations for evaluating system performances in a hands-on cleanroom environment.\nMaintain professional and technical knowledge by consistently educating oneself in areas of science necessary for completing the projects and tasks at hand.\nWork both independently and as a team to complete projects.\nEducate other team members and engineers in optical science and other fundamental physics principles to build the technical capability of the company as a whole.\nExperience & Qualifications:\n\nBS and/or MS in Optical Engineer or similar Engineering field and/or equivalent experience.\nExperience in optical design and analysis using optical cad software (e.g. Zemax).\nExperience with alignment and optical components for system integration, metrology, testing, etc.\nStrong understanding of fundamental optical physics (imaging optics, non-imaging optics, fourier optics, diffractive optics, etc.).\nHands-on experience with optomechanical mechanical assemblies and alignment processes.\nStrong presentation skills and ability to articulate a fundamental understanding of an optical system to non-optical engineers.\nAbility to work on multiple projects in a fast-paced environment where projects change on a yearly to semi-yearly basis.\nContributes to the overall success and quality of Quartus services.\nDocuments work using Microsoft Word or PowerPoint.\nMust be eligible to obtain US government security clearance\nKey Attributes:\n\nSuccessful candidates must be positive team players who are committed to excellence\nMust be able to communicate effectively - in written and verbal format\nMust be able to take direction for job functions\nMust be willing to learn new skills, software packages and general engineering knowledge\nMust be able to manage own schedule and technical work product\nQuartus provides comprehensive benefits including competitive salary, discretionary performance-based bonus, employee stock ownership plan, medical, dental, vision, and 401k plan with company match. Quartus is an equal opportunity employer."}, {"title": "Hardware Engineering Internship", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=a2da31cb6c15abf1&from=vj&pos=top", "description": "InternshipSummary\nPosted: Nov 12, 2018\n\nRole Number: 200011109\nExperience Apple. Theres the typical job. Punch in, make widgets, punch out, repeat. Then theres a career at Apple. Where youre inspired to defy routine. To explore the far reaches of the possible. To travel unchartered paths. And to be a part of something far bigger than yourself. Because around here, changing the world just comes with the job description. Apple is currently seeking enthusiastic EE major interns who can start work anytime between January 2019 to September 2019. The interns will support electrical & system design and integration of the iPod, iPhone, iPad, Watch and Mac computers. The applicants will assist in engineering processes that support the design, integration, implementation, testing, and qualification of various electrical sub-systems.\nKey Qualifications\nKey Qualifications\nFamiliar with computer system architecture, digital logic design and verification, and digital and analog circuit analysis, Analog IC\nInterest in chip design; microarchitecture of on-chip interconnection networks\nAntenna, cellular, wireless, OTA, RF Engineering, high-speed signals; wireless communication theory, RF circuit design\nCPU & GPU Architecture\nC, C++, Python, Perl, SQL, assembly, Mac OS X, PH, Obj-C\nVHDL, Verilog RTL, Digital Logic Design\nMeasurement equipment: spectrum analyzers, network analyzers, oscilloscope\nAbility to interpret schematics and have exposure to physical design and debugging of circuits via FPGA or PCBs.\nExcellent verbal and written social skills.\nPrior internships or work experience preferred.\nDescription\nDescription\nSome responsibilities in Hardware Engineering may include: - Engineering Program Management: Identifying, evaluating and driving engineering/quality improvements/new supplier qualifications) - Touch/Displays Engineering: Optics, Flat Panel/HW, Touch Mechanical Design. Design & Execute experiments validating new materials (optical, mechanical); Optimize design for performance and reliability - Wireless Technologies: Antenna Design, RF System Level Validation, Automated Software/Tool Dev, Optimization of RF Automated Systems, RF Sys Analysis - ASIC / VLSI: RTL Design & Implementation, Verification, Integration, Validation, Emulation, Power/Tech & Circuits, CAD, STA, Physical Design, Low Power Design, Signal Integrity, Analog/Mixed Signal, LDV/HDV, DFT - Embedded/Systems Development: Electrical System Design and Integration, System-Level Testing Support, Schematic Capture, Bug Resolution - Audio/Acoustics/Optical Production Testing and Mechanical Test Design - Human Interface Devices: Firmware Eng, Low-Level Microcontroller Code Dev, Prototyping concepts, design verification (FPGA), Streamline Electrical Design - Firmware Development: Writing/Debugging Low level firmware, drivers, protocols and other firmware code, developing embedded firmware solutions\nEducation & Experience\nEducation & Experience\nPursuing a BS, MS, or Ph.D. in EE/CE/ECE.\nAdditional Requirements\nAdditional Requirements\nGood written and verbal communication Ability to juggle multiple requests/tests\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. If you'd like more information about your EEO rights as an applicant, please click here. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, {"title": "Optical Engineer", "company": "Quartus Engineering", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=885043d00c02830b&from=vj&pos=top", "description": "Desired: Microsoft WordMicrosoft PowerpointQuartus Engineering Incorporated (www.quartus.com) is a leading provider of mechanical, optical, aerospace and electrical engineering services and integrated hardware solutions for the aerospace, defense, entertainment, commercial, consumer, and medical industries. We support our clients with advanced mechanical, optical, aerospace and electrical design, analysis, optimization, test, prototype development, and manufacturing using modern CAD and CAE tools and leveraging our clean room laboratories.\n\nWe are looking for Optical Engineer in our San Diego, CA office to join our growing team.\n\nEssential Job Functions:\n\nDesign, develop and analyze optical systems by applying principles in optics, mechanics, thermodynamics, and materials science.\nDesign components and systems for both short-term and long term solutions for customer applications.\nProvide tolerance analysis and recommendations for tolerances required for system performance.\nAnalyze problems and design custom solutions on a project by project basis.\nProvide reports in PowerPoint or word describing in detail the problem, design space, solutions, and limitations of a design.\nBuild test stations for evaluating system performances in a hands-on cleanroom environment.\nMaintain professional and technical knowledge by consistently educating oneself in areas of science necessary for completing the projects and tasks at hand.\nWork both independently and as a team to complete projects.\nEducate other team members and engineers in optical science and other fundamental physics principles to build the technical capability of the company as a whole.\nExperience & Qualifications:\n\nBS and/or MS in Optical Engineer or similar Engineering field and/or equivalent experience.\nExperience in optical design and analysis using optical cad software (e.g. Zemax).\nExperience with alignment and optical components for system integration, metrology, testing, etc.\nStrong understanding of fundamental optical physics (imaging optics, non-imaging optics, fourier optics, diffractive optics, etc.).\nHands-on experience with optomechanical mechanical assemblies and alignment processes.\nStrong presentation skills and ability to articulate a fundamental understanding of an optical system to non-optical engineers.\nAbility to work on multiple projects in a fast-paced environment where projects change on a yearly to semi-yearly basis.\nContributes to the overall success and quality of Quartus services.\nDocuments work using Microsoft Word or PowerPoint.\nMust be eligible to obtain US government security clearance\nKey Attributes:\n\nSuccessful candidates must be positive team players who are committed to excellence\nMust be able to communicate effectively - in written and verbal format\nMust be able to take direction for job functions\nMust be willing to learn new skills, software packages and general engineering knowledge\nMust be able to manage own schedule and technical work product\nQuartus provides comprehensive benefits including competitive salary, discretionary performance-based bonus, employee stock ownership plan, medical, dental, vision, and 401k plan with company match. Quartus is an equal opportunity employer."}, {"title": "Data Entry Associate", "company": "Daymon Interactions", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=aacbd8f0db9aab09&from=vj&pos=top", "description": "Summary\nData Entry Associate\n\nData Entry Associate completes the collection and accurate coding of all packaging data from source images. They facilitate the flow of this information from the output of the imaging process through to the Data Review function.\nResponsibilities\nThe Company is one of North Americas leading sales and marketing agencies specializing in outsourced sales, merchandising, category management and marketing services to manufacturers, suppliers and producers of food products and consumer packaged goods. The Company services a variety of trade channels including grocery, mass merchandise, specialty, convenience, drug, dollar, club, hardware, consumer electronics and home centers. We bridge the gap between manufacturers and retailers, providing consumers access to the best products available in the marketplace today.\n\nPosition Summary\nData Entry Associate completes the collection and accurate coding of all packaging data from source images. They facilitate the flow of this information from the output of the imaging process through to the Data Review function.\n\nEssential Job Duties and Responsibilities\n\nData collection processing to include multi-image review, data coding and proofreadingSupport data collection efforts involving new member on-boardingAssist management with projects and analysis on data collection issuesPerform system maintenance related to the data collection processDevelop and maintain constructive and cooperative relationships with othersOther duties and special projects as requested 90%\n\nSupervisory Responsibilities\n\nDirect Reports\nThis position does not have supervisory responsibilities for direct reports\n\nIndirect Reports\nThis position does not have guidance or mentoring responsibilities for indirect reports\n\nTravel and/or Driving RequirementsTravel and Driving are not essential duties or functions of this job\n\nMinimum Qualifications The following are the minimum job-related qualifications which an individual will need in order to successfully perform the essential duties and responsibilities of the job:\n\nEducation Level: (Required): High School Diploma or GED or equivalent experience\n\nField of Study/Area of Experience: Degree Program/Major (e.g. Marketing, Business Administration or related field)\n2+ Years of experience in Clerical and/or Data Processing\nPreferably in Consumer Product Goods Industry\nSkills, Knowledge and Abilities\nStrong Typing Skills\nBasic Computer Skills, including Microsoft Word, PowerPoint, Excel, Access, Outlook, & web browsers\nAbility to Work Independently & Prioritize with minimal supervision, in order to Meet Deadlines\nWell Organized, Detail Oriented, & able to Handle Fast Paced Work Environment\nProficient with Internet research\nDecision Making Skills\nAbility to Understand & Follow specific Instructions & Procedures\n\nTechnology Requirements\nComputer with minimum of Windows 7 operating system or a Macintosh (OSX) computer with updated software\nTwo (2) compatible high definition displays/monitors; resolution must be 1920 x 1080 or higher\nReliable high-speed internet (Wi-Fi is compatible, however must have ability to use hard-wired connection as well)\n\nEnvironmental & Physical Requirements\n\nOffice / Sedentary Requirements\nTypically, requires the abilty to sit for extended periods of time (66%+ each day), ability to hear telephone, ability to enter data on a computer and may require the ability to lift up to 10lbs.\n\nAdditional Information Regarding The Company Job Duties and Job Descriptions\n\nJob duties include additional responsibilities as assigned by ones supervisor or other manager related to the position/department. This job description is meant to describe the general nature and level of work being performed; it is not intended to be construed as an exhaustive list of all responsibilities, duties and skills required for the position. The Company reserves the right at any time with or without notice to alter or change job responsibilities, reassign or transfer job position or assign additional job responsibilities, subject to applicable law. The Company shall provide reasonable accommodations of known disabilities to enable a qualified applicant or employee to apply for employment, perform the essential functions of the job, or enjoy the benefits and privileges of employment as required by the law.\n\nAny estimate, schedule, or guideline provided to associates in this job description or elsewhere in connection with their jobs is only intended to help describe job duties and for planning purposes. Regardless of any such estimate, schedule, or guideline, associates must always record all time worked for our company (which includes but is not limited to on-site work time in an assigned store, office, or other work location; required waiting time; administrative time; and work-related travel time).\nImportant Information\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this position. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of associates so classified.\n\nThe Company is committed to providing equal opportunity in all employment practices without regard to age, race, color, national origin, sex, sexual orientation, religion, physical or mental disability, or any other category protected by law. As part of this commitment, the Company shall provide reasonable accommodations of known disabilities to enable an applicant or employee to apply for employment, perform the essential functions of the job, or enjoy the benefits and privileges of employment as required by the law.\n\nThe Company will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance. All of our positions require the satisfactory completion of a background check. Please be aware that acknowledging or having criminal convictions does not constitute an automatic bar to employment. Factors including, but not limited to age and time of the offense, seriousness and nature of the violation, and rehabilitation will be taken into account."}, {"title": "Sales Associate, Retail Hardware", "company": "Macomb Ace Hardware", "location": "Macomb, MI 48042", "job url": "https://www.indeed.com/rc/clk?jk=aa5ea1938dab36ac&from=vj&pos=top", "description": "Macomb Ace Hardware\n\nGeneral Summary\nThe Sales Associate will assist in the receiving, stocking, pricing of all merchandise and help maintain a clean and orderly merchandise presentation and overall store cleanliness.\n\nEssential Duties & Responsibilities\nInclude the following. Other duties may be assigned.\n\nCustomer Service:\n\nProvide a positive representation of Macomb Ace Hardware.\nProactively assist customers in solving problems.\nGreet customers entering and throughout the store. Thank customers when finished and when they are leaving the store.\nPossess a friendly outgoing demeanor; work well with customers as well as associates.\nEnsure all pages and calls are answered promptly, courteously and effectively.\nForward any customer complaint that cannot be handled to a member of management.\nPossess strong product knowledge and knowledge of store layout and location of products.\nAssist customers throughout the store with personal, customized service based on the premise of amazing every customer, every time.\n\nStore Operations\n\nAssist in creating a positive, professional and safe work environment.\nAssist with receiving, checking in and stocking of merchandise throughout the store.\nAssist with maintaining back stock levels.\nAssist with daily maintenance, orderliness and cleanliness of the sales floor, stock room and outdoor merchandise area.\nAssist with providing a clean and orderly sales floor, including end caps and ad merchandise.\nAssist with merchandise resets through the store.\nProvide assistance with price changes, special orders, etc. as required.\nEnsure signage is current throughout the store.\nBe professional in appearance and actions.\n\nEducation/Training\nHigh School or GED equivalent.\n\nExperience\nFormal retail experience preferred.\n\nPhysical Demands\nStanding, walking, lifting (up to 25lbs) and climbing."}, {"title": "Sales Associate Hardware", "company": "ACE HARDWARE CITY", "location": "Houston, TX 77079", "job url": "https://www.indeed.com/rc/clk?jk=053a41ebe1bcdf34&from=vj&pos=top", "description": "About ACE HARDWARE CITY\n\nGeneral Summary\nThe Sales Associate will assist in the receiving, stocking, pricing of all merchandise and help maintain a clean and orderly merchandise presentation and overall store cleanliness.\n\nEssential Duties & Responsibilities\nInclude the following. Other duties may be assigned.\n\nCustomer Service:\n\nProvide a positive representation of ACE HARDWARE CITY.\nProactively assist customers in solving problems.\nGreet customers entering and throughout the store. Thank customers when finished and when they are leaving the store.\nPossess a friendly outgoing demeanor; work well with customers as well as associates.\nEnsure all pages and calls are answered promptly, courteously and effectively.\nForward any customer complaint that cannot be handled to a member of management.\nPossess strong product knowledge and knowledge of store layout and location of products.\nAssist customers throughout the store with personal, customized service based on the premise of amazing every customer, every time.\n\nStore Operations\n\nAssist in creating a positive, professional and safe work environment.\nAssist with receiving, checking in and stocking of merchandise throughout the store.\nAssist with maintaining back stock levels.\nAssist with daily maintenance, orderliness and cleanliness of the sales floor, stock room and outdoor merchandise area.\nAssist with providing a clean and orderly sales floor, including end caps and ad merchandise.\nAssist with merchandise resets through the store.\nProvide assistance to Department Specialists, i.e. price changes, special orders.\nEnsure signage is current throughout the store.\nOperate forklift with proper training.\nCommunicate any Store Support Center issue to General Manager for follow up.\nCommunicate any merchandising, cost control or sales idea to General Manager.\nParticipate in store meetings.\nBe professional in appearance and actions.\nPerform all other duties as assigned.\n\nExperience\nFormal retail experience preferred.\n\nPhysical Demands\nStanding, walking, lifting (up to 25lbs) and climbing."}, {"title": "Inside Sales Rep Retail Counter Sales", "company": "Builders FirstSource", "location": "Solana Beach, CA 92075", "job url": "https://www.indeed.com/rc/clk?jk=010bc41f4f1dfae0&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, provides sales and customer service activities primarily related to retail customers utilizing knowledge of sales techniques and industry knowledge.\n\n\nProvides customer service primarily to retail customers, via walk-in, telephone or email, including assisting with customer inquiries on product selection, pricing, availability, and refunds/exchanges requiring a working knowledge of company products, procedures and practices.\nActively engages in selling company products/services and related items.\nProvides material estimates and quotes for small packages (stairs, decks, fences, sheds, etc.).\nEnters orders into computer system and schedules delivery of products.\nHandles and resolves simple customer complaints and forwards more complex issues to more senior staff for resolution.\n\nHigh School Diploma or General Education Degree (GED) and six (6) months sales-related experience; or equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Holiday Cashier", "company": "Hayward Hardware", "location": "Hayward, CA 94541", "job url": "Not Available", "description": "$15 - $18 an hourPart-time, TemporaryPart Time Cashier for HolidaysJob Type: TemporarySalary: $15.00 to $18.00 /hourExperience:Cashier: 1 year (Preferred)"}, {"title": "Cashier", "company": "Central Network Retail Group, LLC", "location": "McComb, MS 39648", "job url": "https://www.indeed.com/rc/clk?jk=8c97b58be47a6a38&from=vj&pos=top", "description": "A Cashier must provide aggressive customer service through greeting customers as they enter the store and the timely, accurate processing of customer transactions. Also, a Cashier greets customers as they approach the register area, scans merchandise, processes all sales, refunds/exchanges and uses the register to close transactions. The position also includes training, maintenance and stocking responsibilities as assigned similar to that of a CNRG - Home Hardware Center Sales Associate. Since the cashier will often be the first and last person a customer will encounter when shopping at Home Hardware Center they should greet each customer when they enter and thank each customer for shopping with us as they leave.\nEssential Duties and Responsibilities\nUnderstanding and conducting yourself according to our Values\nAccurately processing customer transactions in an orderly, timely, and friendly manner (credit cards, cash, checks, etc.)\nGreeting customers as they enter and exit the store, creating a lasting impression of friendliness to the customer\nVerifying merchandise quantities, descriptions, and prices to ensure accuracy when completing a transaction\nHandling returns/exchanges and sales of merchandise\nAnswer incoming phone calls in a prompt, efficient and courteous manner\nReceiving payment on commercial accounts, receiving money from drivers on C.O.D. tickets and aiding in credit application completion\nCompleting and filing due tickets for customers needing a later pick-up\nAccurately counting down all tenders, preparing deposits and organizing the drawer for the following day\nUtilizing the credit and check verification system according to established company policy and procedures\nEnsuring the daily inflow and outflow of paperwork, including filing and storage, is handled in an efficient and precise manner according to established procedures which will include daily reports, currency and other documentation as necessary.\nDirecting customers to items in the store and calling other team members for customer assistance\nResponsibility for cash and controls to protect company assets\nAbility to maintain a positive customer service-attitude at all times\nFollowing all register procedures\nAbility to accurately determine the difference between similar products\nHelp keep the store clea\n\nSafety & Loss Prevention:\nPossess working knowledge of company and store security measures.\nUnderstand common techniques employed by shoplifters or others seeking to defraud the company and remain vigilant about observing suspect activity and reporting it to management.\nFollow company safety guidelines and basic safety practices at all times. Participate in regular store safety meetings.\n\nPerform other duties similar to those above as assigned by the store manager's supervisor or other qualified corporate or platform representative. Other tasks as assigned by store management.\nThis job is an hourly position (non-exempt from overtime). Though successful sales associates may be considered for other opportunities within the company, the position carries no guarantee of career progression. The job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee.\n\nCentral Network Retail Group, LLC complies with all applicable equal employment laws, including the Americans with Disabilities Act. Qualified individuals with a disability may request reasonable accommodation from the company."}, {"title": "Stocking Associate", "company": "Evans Ace Hardware &amp; Building Supplies", "location": "Medina, NY", "job url": "Not Available", "description": "Part-timeSome experience necessary. Work schedule requires part-time afternoon,nights, and weekends. Approximately 18 to 20 hours per week. During summer, hours may increase. Must be able to lift 100lbs.Job Type: Part-timeExperience:Stocking/Retail: 1 year (Required)Shifts:Evening (Required)Mid-Day (Required)"}, {"title": "Hardware Engineering Other", "company": "Valve Software", "location": "Bellevue, WA", "job url": "https://www.indeed.com/rc/clk?jk=df83ab82e127beed&from=vj&pos=top", "description": "We are looking for highly skilled people to contribute to our collaborative, multi-disciplinary teams. Your talent and experience may be just what we need.\nQualifications\nAn entrepreneurial spirit\nA high level of expertise in your discipline"}, {"title": "Sales Floor Associate/Cashier", "company": "Matteson Ace Hardware", "location": "Morris, IL", "job url": "Not Available", "description": "$8.25 - $10.00 an hourPart-timeThird generation family owned hardware store looking for enthusiastic, excited and dependable team players to learn, grow and be part of a great community while earning their paycheck in life. Retail experience is preferred but is definitely not a must. We are happy to train and teach all areas needed to help produce a team player that is well rounded in all things hardware related. A friendly and honest attitude is your greatest asset at our company. Looking forward to meeting anyone interested and eager to work for a professional and fun workplace.Job Type: Part-timeSalary: $8.25 to $10.00 /hour"}, {"title": "Cashier", "company": "Discount Builders Supply", "location": "San Francisco, CA 94103", "job url": "Not Available", "description": "Established in 1961, Discount Builders Supply is one of the largest locally owned building material and home improvement stores in San Francisco. Proudly serving Contractors, Property Managers and Homeowners.We have immediate openings for the following full time 40 hour a week positions:-Cashier. This position requires one year of point of sale experience. Computer knowledge and experience required. Knowledge of hardware and building material a plus. The ideal candidate enjoys helping customers, ensuring customer satisfaction by demonstrating an energetic and positive demeanor.We offer competitive compensation, a comprehensive benefits package that includes health, dental, life insurance, 401k with match, paid vacation, 8 paid holidays and associate discount.The successful candidates will be required to pass pre-employment drug screening and background check.Job Type: Full-timeExperience:Cash Handling: 1 year (Required)"}, {"title": "Cashier", "company": "Discount Builders Supply", "location": "San Francisco, CA 94103", "job url": "Not Available", "description": "Established in 1961, Discount Builders Supply is one of the largest locally owned building material and home improvement stores in San Francisco. Proudly serving Contractors, Property Managers and Homeowners.We have immediate openings for the following full time 40 hour a week positions:-Cashier. This position requires one year of point of sale experience. Computer knowledge and experience required. Knowledge of hardware and building material a plus. The ideal candidate enjoys helping customers, ensuring customer satisfaction by demonstrating an energetic and positive demeanor.We offer competitive compensation, a comprehensive benefits package that includes health, dental, life insurance, 401k with match, paid vacation, 8 paid holidays and associate discount.The successful candidates will be required to pass pre-employment drug screening and background check.Job Type: Full-timeExperience:Cash Handling: 1 year (Required)"}, {"title": "Hardware | Assembly Help", "company": "Fabtron", "location": "San Carlos, CA 94070", "job url": "Not Available", "description": "$15 an hour$15.00 per hour Entry Level PositionNo Experience NecessaryHardware Installation and Light AssemblyClean and Quiet Working ConditionsIf interested please e-mail for more details.Job Type: Full-timeSalary: $15.00 /hour"}, {"title": "Hardware Testing/Recieving Clerk", "company": "Server Tech Solutions Inc", "location": "Central Park, FL", "job url": "Not Available", "description": "$14 - $17 an hourSTS INC, is a reseller of Server Storage devices. We buy, stock and sell hard drives and SSD's to resale to our customers online. We are looking to hire a Hardware Technician to test our incoming inventory in our Server Lab. Our lab includes customer built testing equipment along with All server brands and controllers to ensure functionality across hundreds of different storage devices.The ideal candidate will have experience in testing server components and will be well verses in installing and deinstallation of server components and has the ability to use software for testing. We will also require the candidate to work with our customer service department to troubleshoot minor problems customers might face and apply different receiving requirements for each shipment.You will be.1. Testing incoming inventory in servers and other equipment2. Receiving inventory with scanning and quality protocols3. Working with customer service to verify and trouble shoot minor tech issues to help avoid returns4. Work closely with our team to ensure reliability and data of each shipmentYou should know.1. how to work with servers2. how to troubleshoot computer hardware issues3. how to determine the scope of each shipment and what type of testing is required4. have worked with HP/Dell Servers in the past.5. have a love for hardware6. be able to converse with customers on the phone/email and help answer questions regarding trouble shooting.This positron will have room for growth and we are willing to train the right candidate with certifications to better their knowledge and our ability to test and qualify products.Vacation PaidAll Federal Holidays PaidBonusesFull-time with overtime availableJob Type: Full-timeSalary: $14.00 to $17.00 /hourExperience:Computer Hardware: 2 years (Required)Education:Associate (Preferred)License:FL Drivers (Required)"}, {"title": "Receiver", "company": "Restoration Hardware", "location": "La Mesa, CA", "job url": "https://www.indeed.com/rc/clk?jk=f414638b62042f9c&from=vj&pos=top", "description": "Part-timeWe believe that service starts inside the organization and embrace a concept called People First. At RH, do your best work in an inspiring space, enjoy a 50% product discount and receive opportunities for career advancement.\n\nRH is seeking a Receiver to join the Outlet team.\n\nRESPONSIBILITIES\n\nReceives shipments in a timely manner to maximize productivity and minimize costs\nMaintains stockroom department categories by stocking merchandise on appropriate shelves to maximize efficiency\nProperly tickets all merchandise in preparation to be received onto the sales floor\nPacks all client ship-outs professionally and appropriately to avoid breakage\nEnsures all client ship-outs are shipped within 24 hours of purchase\nRegularly assists sales team with clients\nMaintains inventory integrity\n\n\nREQUIREMENTS\n\n1+ years retail experience\nAsk questions, seek clarity, and dare to come up with solutions\nAbility to prioritize and handle multiple tasks in a fast paced environment with changing priorities\nMust have excellent written and verbal communication\nExcellent organizational and time management skills\nExcellent attention to detail\nMust have strong interpersonal skills\nFollows safety guidelines by keeping hallways, corridors, and elevators clear of merchandise\nMust have an understanding of our assortment\nFollows all safety procedures insuring personal safety and the safety of others\nConsistently follows all company policies and procedures\nMust be able to lift up to 50 pounds regularly throughout the day\n\n\nPHYSICAL REQUIREMENTS\n\nAbility to lift and mobilize small to medium items up to 50 lbs. while utilizing appropriate equipment and techniques\nAbility to maneuver effectively around gallery floor, stock room and office\nPosition entails prolonged standing, twisting, stooping, kneeling, squatting, bending and climbing\nTo the extent they do not impose an undue burden on RH, reasonable accommodations will be provided to enable qualified individuals with disabilities to perform the essential functions of the job described above\n\n\nBENEFITS\n\nGreat benefits package with premier medical, dental and vision partners\nRewarding paid time-off plans, including vacation, sick time, personal days, company holidays and more\nSubstantial associate discount of 50% off regularly priced RH merchandise and 30% off sale items\nAccess to all RH Members Program benefits, including complimentary design services\nHigh-value discounts with respected national vendors, partners and retailers\nGenerous Referral Bonus Program to reward associates for recruiting top talent"}, {"title": "Sales Associate", "company": "Blain&#39;s Farm &amp; Fleet (Blain Supply, Inc.)", "location": "Romeoville, IL", "job url": "https://www.indeed.com/rc/clk?jk=e46196c29e182499&from=vj&pos=top", "description": "Part-time, TemporaryOverview\nFounded in 1955, Blain's Farm and Fleet is a specialty retailer with privately-held stores in the Midwest. Our philosophy is simple: offer the hardest working people in America an honest value and the best customer service. We do this by carrying the best brands at the lowest price possible, and hiring and training talented, hardworking people. As a member of the Blains Farm & Fleet family, you will benefit from a stable work environment, family-owned company that is closed on major holidays and offers a comprehensive, competitive benefits plan.\nResponsibilities\nThe Sales Associate - Hardware Department would perform excellent customer service and stocking the areas of the Hardware Department, along with other assigned duties that would ensure that the customer has an efficient, pleasant shopping experience.\n\nThis can include, but is not limited to:\nStock shelves with back stock product and incoming freight for the day\nSet and remove Ad prices for the appropriate sales and check for pricing accuracy\nMaintain displays and face shelved products\nPlanograms and changing Floor Plans\nClean retail area by dust mopping, removing trash, and picking up litter\nUtilize computers to determine product delivery and inventory levels\nReturn excess product to the warehouse\nMove empty pallets to the warehouse and breaking down containers\nAttaching security tags to appropriate product\nHelp in other hardlines departments as assigned\nDemonstrate awareness and compliance with Loss Prevention and safety policies and procedures\nQualifications\nGreat communication skills\nPrior Retail experience preferred\nAble to work nights when needed and at least every other weekend\nAble to pass pre-employment drug screening and background checks\n\nBenefits:\nHealthcare*\nPaid Holidays and Paid Vacations*\n401(k)*\nProfit sharing*\nParental leave*\nFlexible work schedule\nAssociate discount program\nExciting and engaging work environment\nShort and long term disability and life insuranceElgibility Required\nJob Class\nRetail Store"}, {"title": "Game Test Analyst", "company": "Sony Interactive Entertainment PlayStation", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=847d593f6b294a08&from=vj&pos=top", "description": "This position is for a temporary engagement through our staffing partner Yoh Services. The anticipated duration of this engagement will vary. The duration of the assignment cannot exceed 12 months.\n\nThis is an entry level role and great for a recent grad!\n\nGame Testers at PlayStation are responsible for finding and replicating bugs/glitches and accurately reporting them to the game developers. The ideal candidate is a passionate and driven gamer who dreams of playing it first! We are looking for individuals that are analytical thinkers and problem solvers, have excellent grammar, and want to contribute their talents to the PlayStation team to help craft an exceptional entertainment experience.\n\nQuality Assurance is a great way to get into the gaming industry and possibly grow into other positions/fields.\n\nThe Game Test Analyst is expected to support the WWS QA department in all areas including:\n\nPrinciple Duties/Responsibilities\n\n\nExecuting test plans on pre-release versions of software\nAssessing product functionality against official SIE quality standards\nResearching and documenting product defects and violations\nLogging issues for development team review in concise written report formats\nApplying knowledge of basic to intermediate networking principles and online console, PC, and mobile gaming / functionality elements\nCollaborating on miscellaneous QA test process related tasks / projects\n\nRequirements\n\n\nMust be at least 18 years of age\nStrong analytical and problem solving skills\nExcellent written and verbal communication (needs to be able to communicate bugs  how did you find them? What exact steps are needed to make it happen again?)\nBasic to intermediate understanding of networking setup and hardware, as well as how its principles and components apply to modern console, PC, and mobile gaming / functionality\nAbility to work in both an individual and team environment\nFlexible schedule\n\nPreferred Experience\n\n\n1+ years of previous QA experience in a related field\n4 year college degree\n\nHeadquartered in San Mateo, California, Sony Interactive Entertainment America LLC (SIEA)  the creator of PlayStation - is a wholly owned subsidiary of Sony Interactive Entertainment LLC , with oversight for operations in the United States, Canada and Latin America. For over two decades, PlayStation has been a market leader, serving as the ultimate destination for millions of gamers across the world.\n\nSIEA has offices and creative studios in San Diego (San Diego Studios), Los Angeles (Santa Monica Studios), Aliso Viejo (Gaikai), Bend, OR (Bend Studios) and Bellevue, WA (Sucker Punch Productions). It is our immensely talented employees, who are deeply passionate about their love of gaming, which has given us the ability to empower game creators to unleash their imaginations and deliver new gaming experiences. Additionally, SIEA participates in a variety of higher education and high school based programs to help nurture young talent to fulfill their dream of working in the gaming industry.\n\nSIEA provides equal employment opportunity for all applicants and employees. SIEA does not discriminate on the basis of race, color, religion, gender, gender identity, marital status, age, disability, veteran status, sexual orientation, national origin, or any other category protected by applicable federal and state law. SIEA also makes reasonable accommodations for disabled applicants and employees."}, {"title": "Personal Systems Hardware Intern", "company": "HP", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=4f1e5244fe906ece&from=vj&pos=top", "description": "InternshipAbout Us\nInnovation is in HPs DNA. From our origins in a Palo Alto garage in 1939, to our current position as one of the worlds leading technology companies, HP has grown to become a leader in technology and corporate culture, inspiring innovators and entrepreneurs around the globe.\n\nHP brings together a portfolio that spans printing, personal computing, software and services to serve more than 1 billion customers in over 170 countries. We are committed to fostering a diverse and inclusive workplace that attracts exceptional talent and to supporting our employees to succeed at all levels. We dream in over 35 languages and share one mission: to engineer experiences that amaze.\n\nJoin us for a paid summer internship designed to let you apply your classroom learnings to real world challenges. Our internships involve a thoughtful balance of networking, executive speakers, and community involvement. Most importantly, you will be expected to complete a big, meaty task that will grow you as an engineer with support and guidance from the team.\n\nAbout You:\nPrimary job responsibilities will be developing reliability analysis processes and tools that will consider system level test results being performed by both HP and suppliers, triaging emerging issues, development, and execution of experiments to characterize problems and characterize proposed countermeasures.\n\nSpecific areas the Intern will engage in:\nAssembly/ Dis-assembly of 3D scanning devices for failure analysis and serviceabilityPerforming lab test on 3D scanning devices with guidance of Senior Engineers3D ModelingCreating mechanical drawings\n\nEducation and Experience Required:\nPursuit of a Mechanical Engineering degree required. 3rd Year of University completed.\nSuccessful candidates will possess a desire to deepen their capabilities in detailed analysis and problem-solving associated with the development of detailed electro-mechanical systems. They should be highly motivated, flexible, and possess excellent communication and interpersonal skills.\nStudent should also have an aptitude for system level development, including some level of electrical design."}, {"title": "Sensing Hardware Engineer", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=37bba00996a6c4f6&from=vj&pos=top", "description": "Summary\nPosted: Oct 3, 2018\nWeekly Hours: 40\nRole Number: 114128682\nThe Health Technology Team conceives and proves out exciting new technology for Apples future products and features. We are seeking a highly motivated engineer to join a cross-functional team to help drive feasibility of health, wellness, and fitness sensors, systems, and applications.\nKey Qualifications\nKey QualificationsRelevant industry or academic experience as a mechanical engineer, hardware engineer, electrical/electronics engineer or equivalent.Experience with health/physiological signal sensing, experimental design, data collection and data analysis.Good understanding of non-invasive sensors used to measure biomedical/physiological signals.Thorough understanding of measurement principles, sensing mechanisms, and instrumentation, experience with sensing hardware system design and architecture.Experience with bench top verification test development, design testers and fixtures, drafting protocols and conduct data collection and analysis.Experience with troubleshooting and debugging prototype hardware / software.Relevant experience in at least two of the following three areas:Biomedical data analysis, signal processing, machine learning and programming (using e.g., MATLAB, Python, LabView, C).Mechanical parts/system design and manufacturing design,Mechanical/multiphysics simulation using e.g., Comsol, Ansys or Abacus.\nDescription\nDescription\nDevelop prototype hardware for physiological measurement applications. Define engineering requirements, incorporate inputs from different engineering teams and deliver the requirements to component vendors. Design and execute on sensor process, manufacture and validation test. Work with vendors to develop process steps, SOP, and fixtures for consumer electronics components production. Perform analysis of data collected, root-cause source of error in measurements; implement improvements in hardware, measurement methods, or signal processing. Inform development direction related to product design, specification limits, and algorithm performance. Cross-Functional Responsibilities: Solicit and incorporate input from cross-functional teams at Apple for hardware, sensors, software, and algorithms. Communicate well-reasoned architectures, designs, and measurement approaches to other teams and Apple executives.\nEducation & Experience\nEducation & Experience\nDegree: Masters or Ph.D Field of Study: Mechanical Engineering, Electrical Engineering, Biomedical Engineering, Material Science, Engineering Physics, or other related discipline. Additional Requirements: PhD degree in sensor/sensing technology related field is a plus. Must thrive in fast-paced environment. Must be highly organized, and be able to multitask. Excellent communication and interpersonal skills. Demonstrated ability to work as a key member of a team. Strong analytical and problem-solving skills. Detail oriented.\nAdditional Requirements\nAdditional Requirements"}, {"title": "Holiday Cashier", "company": "Hayward Hardware", "location": "Hayward, CA 94541", "job url": "Not Available", "description": "$15 - $18 an hourPart-time, TemporaryPart Time Cashier for HolidaysJob Type: TemporarySalary: $15.00 to $18.00 /hourExperience:Cashier: 1 year (Preferred)"}, {"title": "Inside Sales Rep Retail Counter Sales", "company": "Builders FirstSource", "location": "Solana Beach, CA 92075", "job url": "https://www.indeed.com/rc/clk?jk=010bc41f4f1dfae0&from=vj&pos=top", "description": "The Dixieline Lumber and Home Centers are conveniently located throughout San Diego County, offering both homeowners and contractors complete customer service. Our sales staff can help select the proper hardware, tools and supplies needed for just about any project.\n\nToday, Dixieline Lumber & Home Centers is owned by Builders FirstSource, the largest supplier of building products, prefabricated components, and value-added services to the residential construction market in the U.S.\n\nUnder direct supervision, provides sales and customer service activities primarily related to retail customers utilizing knowledge of sales techniques and industry knowledge.\n\n\nProvides customer service primarily to retail customers, via walk-in, telephone or email, including assisting with customer inquiries on product selection, pricing, availability, and refunds/exchanges requiring a working knowledge of company products, procedures and practices.\nActively engages in selling company products/services and related items.\nProvides material estimates and quotes for small packages (stairs, decks, fences, sheds, etc.).\nEnters orders into computer system and schedules delivery of products.\nHandles and resolves simple customer complaints and forwards more complex issues to more senior staff for resolution.\n\nHigh School Diploma or General Education Degree (GED) and six (6) months sales-related experience; or equivalent combination of education and experience.\n\nBuilders FirstSource is an Equal Opportunity/Affirmative Action Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status or status as an individual with a disability."}, {"title": "Hardware Manufacturing Engineering Intern", "company": "Facebook", "location": "Menlo Park, CA", "job url": "https://www.indeed.com/rc/clk?jk=1f6a459eb3cfe1a1&from=vj&pos=top", "description": "InternshipFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities  we're just getting started.\nFacebook is seeking a Hardware Manufacturing Engineer Intern to join our Manufacturing and Quality Engineering team. Our servers and datacenters are the foundation upon which our rapidly scaling infrastructure efficiently operates and upon which our innovative services are delivered. The intern will be work with Manufacturing Quality and Product Engineers who are responsible for developing and implementing world class manufacturing and quality processes for Facebook compute, storage and networking hardware. This position is located in our Menlo Park office.\nRESPONSIBILITIES\n\nInterface with hardware and validation engineers to understand system architecture\n\nSet requirements and drive manufacturing partners to build, test, and deliver quality hardware\n\nAbility to generate yields calculations, predictive models, process capability studies.\n\nDevelop quality and reliability metrics, test methodologies, and assembly processes.\n\nHelp to create electrical and/or mechanical fixtures to assist the factories in building components and assembly\n\nDevelop and publish yield reports and communicate findings to team members.\n\nDiagnose and root cause component failures\n\nSupport diagnosis and root cause of component failures\nMINIMUM QUALIFICATIONS\n\nStudying towards a BS or MS in electrical, mechanical or computer engineering\n\nFamiliar with server and storage hardware design\n\nBackground in product and process quality\n\nFamiliar with Supply Chain and Manufacturing processes\n\nUnderstanding of statistics, distributions, hypothesis testing, regressions statistical process control, process capability analysis\n\nDashboard display software like tableau\n\nStrong trouble shooting and analytic skills\n\nExcellent communication skills\n\nExperience working with linux and object oriented programming is a strong plus.\n\nMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n\nMust be currently enrolled in a full-time degree program and returning to the program after the completion of the internship/co-op"}, {"title": "Product Manager, Google Hardware Store", "company": "Google", "location": "Mountain View, CA", "job url": "https://www.indeed.com/rc/clk?jk=2b3d3bc3b400b0d1&from=vj&pos=top", "description": "Qualifications\nMinimum qualifications:\n\nBachelor's degree in Computer Science, related technical field or equivalent practical experience.\n5 years of product management experience.\n\nPreferred qualifications:\n\nExperience in e-commerce.\nKnowledgeable across many functional areas, including product management, engineering, UI, sales, customer support, finance, and marketing. Familiarity with business issues, or the ability to quickly learn.\nAbility to articulate product vision, documenting both short-term plans and long-term strategy.\nEntrepreneurial drive and demonstrated ability to achieve stretch goals in innovative ways.\nBias for action. Ability to juggle multiple priorities in a fast-paced, ambiguous environment.\nDemonstrated user interaction and design skills.\nAbout the job\n\nAt Google, we build products that organize the world's information and make it universally accessible to our users. These products are the lifeblood of who we are. As part of the Product Management team, you work closely with our engineers to guide products from conception to launch. You connect the technical and with the business, working with teams across Engineering, Sales, Marketing and Finance. With your technical expertise, you identify a projects setback and generate solutions for resolving them quickly. As a Product Manager, you help shape the future of Google products.\nAs a Product Manager, you'll work to help grow a segment of the Google Hardware business.\nIn this role, you'll define the B2B product strategy for Googles Nest B2B business. You will work closely with the Business, Engineering, UX and Customer Support teams to identify opportunities and build features that ensure our B2B customers can run and grow their Nest business. You will have an opportunity to drive the Google Hardware product strategy as well as be part of the Google Store team within Hardware.\n\nYour background is in e-commerce product management, with an emphasis on back-end order management, inventory management and operations systems.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user's interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people's lives better through technology.\nResponsibilities\n\nOwn the product strategy for Googles Nest B2B business. Partner with the User Research team to understand key usage patterns and data.\nDefine product requirements, initiate and prioritize projects within engineering, assist in determining the best technical implementation, track product development, and develop product launch plans.\nWork jointly with our B2B business partners to identify opportunities to grow the business and improve the way our partners work with Nest.\nForm relationships with the User Experience teams to create design concepts, and work with Engineering to implement and iterate.\nMeasure and analyze product and feature performance for opportunities to innovate, simplify and create intuitive user interfaces that improve customer experience and increase adoption. Understand and track trends in the marketplace for competing sites.\nLocation\n\n\n\nMountain View, CA, USA\n\nAt Google, we dont just accept differencewe celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes."}, {"title": "Hardware Technical Recruiter", "company": "Apple", "location": "Austin, TX", "job url": "https://www.indeed.com/rc/clk?jk=ee97f4a67a3fa5f4&from=vj&pos=top", "description": "Desired: NegotiationRecruitingSummary\nPosted: Nov 10, 2018\n\nRole Number: 200010554\nDo you have a passion for helping others succeed? Do you genuinely believe that talent is the greatest asset of any company? As a member of Apples People group, youll help discover and develop our most important resource: our people. Together, well search the world to build our collective of talented perfectionists, visionaries, and inventors. All the while, your efforts will maintain Apple as the most innovative company by striving to make us the most diverse  open to all people, all backgrounds, and all perspectives. And thats just the beginning, because throughout Apple employees careers, you will continue to help them grow professionally and support them in work and life. Join the team and help build and keep the extraordinary talent it takes to make extraordinary products. Were seeking a Technical Recruiter to join the Apple Hardware Technology Recruiting team. In this role, you will have the opportunity to join an amazing, robust, and agile team responsible for hiring best-in-class engineering talent. Apple has an exciting, inspiring culture. If you are results driven, a self-starter, and ready to Think Different, join us.\nKey Qualifications\nKey Qualifications\nKEY QUALIFICATIONS3+ years of full-lifecycle recruiting experience with a high-performing companyProven background in using innovative research & sourcing methods to hire for niche areas and hard to fill roles.Experience in partnering effectively with all types of teams and levels of professionals.Exceptional closing and negotiation skills required.Ability to dive into the details with meticulous organization and prioritization skills\nDescription\nDescription\nAs a Technical Recruiter at Apple, your main goal is to identify, assess, and bring top talent to Apple. Apple Recruiters are strategic partners for the business they support, and compelling ambassadors of Apple. You will be responsible for guiding hiring managers and candidates through Apples selection process, performing full lifecycle recruiting, and maintaining excellent relations with hiring managers, candidates, and the community at large. This position is technically focused so experience with leading-edge software and hardware products is essential. Do you have a passion for helping others succeed? Do you genuinely believe that talent is the greatest asset of any company? As a member of Apples People group, youll help discover and develop our most important resource: our people. Together, well search the world to build our collective of talented perfectionists, visionaries, and inventors. All the while, your efforts will maintain Apple as the most innovative company by striving to make us the most diverse  open to all people, all backgrounds, and all perspectives. And thats just the beginning, because throughout Apple employees careers, you will continue to help them grow professionally and support them in work and life. Join the team and help build and keep the extraordinary talent it takes to make extraordinary products. Were seeking a Technical Recruiter to join the Apple Hardware Technology Recruiting team. In this role, you will have the opportunity to join an amazing, robust, and agile team responsible for hiring best-in-class engineering talent. Apple has an exciting, inspiring culture. If you are results driven, a self-starter, and ready to Think Different, join us. KEY QUALIFICATIONS - 3+ years of full-lifecycle recruiting experience with a high-performing company - Proven background in using innovative research & sourcing methods to hire for niche areas and hard to fill roles. - Experience in partnering effectively with all types of teams and levels of professionals. - Exceptional closing and negotiation skills required. - Ability to dive into the details with meticulous organization and prioritization skills DESCRIPTION As a Technical Recruiter at Apple, your main goal is to identify, assess, and bring top talent to Apple. Apple Recruiters are strategic partners for the business they support, and compelling ambassadors of Apple. You will be responsible for guiding hiring managers and candidates through Apples selection process, performing full lifecycle recruiting, and maintaining excellent relations with hiring managers, candidates, and the community at large. This position is technically focused so experience with leading-edge software and hardware products is essential. KEY RESPONSIBILITIES - Partner and maintain positive relationships with the hiring team, recruiting team members, and have a keen sense of negotiation with all customers throughout the recruiting process. - Have deep understanding of the complete recruiting function, including: research, sourcing, networking, behavior based interviewing and closing. - Develop effective and timely communication approaches that include: actively keeping others informed, appropriately expressing ideas and thoughts, verbally and/or in written form. - Maintain flexibility to deal with ambiguity and the evolving needs of the business environment. - Stay informed of trends and innovative recruiting techniques in order to be competitive in state-of-the-art recruiting practices.\nEducation & Experience\nEducation & Experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "Hardware Associate", "company": "Schillings", "location": "Saint John, IN 46373", "job url": "https://www.indeed.com/rc/clk?jk=52cba4ba009cb5b3&from=vj&pos=top", "description": "Great news! Schillings is currently looking for a Hardware Associate at our Saint John, IN location. This position is Monday through Friday, 7am-5pm with opportunities for advancement.\n\nResponsibilities:\n\nShelf facing and stocking, merchandising of hardware and materials\nAssist with receiving duties\nInventory counts, communicate needs with Purchasing department\nDaily/Weekly/Monthly maintenance\nResolve issues, if they arise\nProvide excellent customer service\nAdhere to all company policies and procedures\nMaintain best interest of the company\nAny other tasks or areas of responsibility that the Sales Manager, General Manager or Schilling family deem appropriate\nRequirements:\n\nAbility to adapt to change quickly\nStrong interpersonal skills; must be a team player!\nAbility to lift and carry over 50lbs\nWorking knowledge of Excel, Word, and Windows\nGood math skills and strong attention to detail\nAbility to multi-task and thrive in a fast-paced environment\nExceptional organizational skills\nProficient scoring on all candidate testing\nMust pass pre-employment drug screen\nBenefits:\nCompetitive pay\nNever work evenings or Sundays\nFull package of insurance benefits\nPaid holidays\n401k with profit sharing\nContractor-sponsored lunch events (free food!)\nFun breakroom equipped with video games & board games\nMission: Give our customers what they want, on time and error free\n\nSchillings provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Schillings is a drug-free workplace."}, {"title": "Customer Service/Sales", "company": "The Home Depot", "location": "Encinitas, CA 92023", "job url": "https://www.indeed.com/rc/clk?jk=86bb9c1b864189d4&from=vj&pos=top", "description": "Job Description\nPosition Purpose:\nCustomer Service/Sales associates provide fast, friendly service by actively seeking out customers to assess their needs and provide assistance. These associates learn about products using our tools, and provide information to customers in order to sell an entire project. Associates in this position will learn how to greet, qualify, recommend and close every customer in their department, and know how to handle basics in adjacent departments. Customer Service/Sales associates maintain the in-stock condition of assigned areas, and ensure it is clean, shop-able, and safe. Each associate has the responsibility of providing a safe working and shopping environment by following all safety policies & standards, completing specified safety training, immediately correcting hazards & unsafe conditions or reporting conditions to the Manager on Duty, and working safely as not to endanger themselves, co-workers, vendors, or customers. These associates work in cooperation with their Department Supervisor and other associates in their department as well as other departments. Specific store departments may include Building Materials, Dcor, Electrical, Flooring, Garden, Hardware, Kitchen & Bath, Lumber, Millwork, Paint, Plumbing and Tool Rental. The Customer Service/Sales position types may include Department Sales, Lead Generator, Pro Account Sales, Sales Specialist, Special Services, and Customer Order Specialist."}, {"title": "Associate Buyer- Hardware", "company": "Family Dollar", "location": "Chesapeake, VA", "job url": "https://www.indeed.com/rc/clk?jk=5e2fe6c225c80f57&from=vj&pos=top", "description": "Associate Buyer- HardwareMER06698\n\nGeneral Summary:\n\nAssociate Buyers are responsible for collaborating with Buyers to develop merchandise assortment and business strategies that drive sales and profitability. This position participates in the forecasting and analysis of business results, identifies key industry trends, plans product assortment and negotiates with vendors as it pertains to a particular area of the business, key classification and/or department.\n\nAssociate Buyers are required to assume complete responsibility for a portion of the Buyers overall business and manage the processes necessary to achieve or exceed sales and profitability objectives for that area. This position is responsible for providing support to Buyers in terms of the development and execution of plans and strategies for defined categories and/or departments. Associate Buyers are responsible for embracing Family Dollars store-centric commitment to customers, customer service and sales.\n\nPrincipal Duties & Responsibilities:\n\nDevelop competitive customer and market strategies that involve targeted merchandise selection, proper assortment planning and accurate pricing plans for a specified area of the business\nExecute sales, margin percent and dollar and inventory plans. Monitor and respond to issues and opportunities resulting from deviations in plan variances, and share concerns with Buyers\nAssist in analyzing class performance and planned class penetration using assortment planning tool and approved allocations strategies.\nProvide information to support micro-merchandising strategies and review with team.\nExecute and aid in the development of departmental strategies to achieve sales and profitability targets. Assist in establishing replenishment strategies and identify items as replenishment candidates\nAnalyze sales trends, key items, vendor profitability, and aged inventory and make recommendations for driving improved performance\nDesign a promotional for a particular area of the business and monitor and manage performance\nObtain samples and provide direction during promo planning process. Perform quality control to ensure correct information is provided for both ads and signage\nComplete accurate forecasts as well as evaluate sales, markdowns and receipts\nAnalyze assigned category(s) on a regular basis to identify opportunities, trends, and sales shortfalls. Design specific, targeted action plans to enhance sales in assigned area(s)\nDevelop detailed seasonal plans that allow departments to meet sales and profitability objectives. Recommend visual presentation guidelines to support seasonal and other strategies within the stores\nWork with Planners and Pricing to manage the markdown process in accordance with Family Dollar policy\nMaintain collaborative partnership and relationships with all internal colleagues and departments\nManage vendor relationships to ensure that merchandise is available in the appropriate quantities as needed to meet customer demands\nContinuously build upon and increase industry and product knowledge by reading monthly industry reports and enhancing systems knowledge\nShop local Family Dollar stores, as well as other comparative retail stores, on a regular basis to identify new trends and opportunities, evaluate merchandise mix, evaluate competition, and translate findings into executable product plans\nResponsible for work-related travel (approximately 10-15% of the time)\nOther job-related duties as assigned\n\n\nMinimum Requirements:\nEducation: Bachelors Degree from a four-year college or university or equivalent experience / training preferred\nExperience: 3 or more years of related experience as a Buyer or 5 or more years of combined buying, planning and allocation responsibilities\nTechnical Skills: Must be proficient in the use of Microsoft Office and Windows-based programs as well as retail math; Strong merchandising, product, trend and analytical skills\nOther Skills: Demonstrated leadership and decision making skills\nJob Merchandising\nPrimary Location VA-Chesapeake\nJob Level Individual Contributor\nEducation Level Bachelor's Degree (16 years)\nShift Day Job\nTravel Yes, 10 % of the Time\nUnposting Date Ongoing\nRelocation Assistance Yes\nDrug Screen Required Yes"}, {"title": "Embedded Hardware Engineer Intern", "company": "VisualThreat Inc.", "location": "San Jose, CA", "job url": "Not Available", "description": "$15 - $25 an hourPart-time, InternshipWe are looking for a embedded system intern to develop vehicle software/firmware on variant embedded platform.Requirements requiredPractical working experience of ARM based embedded systemWell understand the structure of embedded Linux kernelSTM32 MCU embedded C and firmware development skillswork experience in tools like KEILVehicle CAN bus background is advantageousJob Types: Part-time, InternshipSalary: $15.00 to $25.00 /hourExperience:Linux: 1 year (Preferred)Embedded Software: 1 year (Preferred)Firmware: 1 year (Preferred)Education:Bachelor's (Required)Work authorization:United States (Required)"}, {"title": "Stock Person", "company": "Taj Mahal Hardware", "location": "Brooklyn, NY 11218", "job url": "Not Available", "description": "Spanish speaking required!Unloading boxes,Putting products onto the shelvescleaning aisles,making room for new products to go on shelves,taking care of deliveries that arrive weekly/monthly,restockingproviding order list to the assistant manager///Basic hardware knowledge is a must,Punctual,working in a fast environment,must be able to pick up atleast 50lbs!!!OSHA 10 will Be provided,*spanish speaking required*Job Type: Full-timeLocation:Brooklyn, NY 11218 (Preferred)Language:Spanish (Preferred)"}, {"title": "Warehouse Team Member", "company": "Hardware Sales Inc. Internet Division", "location": "Ferndale, WA", "job url": "Not Available", "description": "$14 an hourWarehouse position available at a Local Online Retail Sales/Distribution Company. We are a growing company, including a startup in Indiana, and are looking for great people to grow with us! There are future opportunities for the ideal employee to move into office work, brand management, or information technology positions.Hardware Sales Internet Division is the online division of Hardware Sales Inc. headquartered in Bellingham, WA. Located in Ferndale, WA this warehouse is responsible for shipping logistics for the Western US.Experience isn't necessary; we hire for positive attitude and ability to learn. Being detail oriented and accurate with numbers is a must. We will train you to operate within our current processes. If you do have experience, that is a bonus. We invest in personal development and continuous learning for all employees. Our mission is to help you grow into a world class problem solver who is viewed by all as a positive influence in your work, community, and planet.Our ideal candidate is one who thrives in a fast-paced environment. You will be expected to follow standard processes and use creativity to improve those processes. If you enjoy learning, you will excel at this job. We pride ourselves on problem solving, striving for excellence, learning from our mistakes, being adaptable, and having positive attitudes.You will be involved with high volume shipping (picking, packing & shipping 350+ orders daily), stocking, receiving products, and driving a variety of forklifts (stand up, sit down, and narrow aisle turret).You are expected to be very comfortable with computers, able to type quickly, and able to navigate most programs with ease. You must be physically fit to do well at this position. You will be on your feet all day as well as lifting, pushing, and pulling products and/or pallets.Please send resume by email.$14.00 DOE, Medical, dental, paid vacation, paid holidays, 401(k) plan****Qualified applications need only apply. Must be able to pass a criminal background check and drugJob Type: Full-timeSalary: $14.00 /hourLocation:Ferndale, WA (Required)"}, {"title": "Sales Associate/Cashier", "company": "Coachella Ace Hardware", "location": "Coachella, CA 92236", "job url": "https://www.indeed.com/rc/clk?jk=ccbf9c8897c48035&from=vj&pos=top", "description": "$11 an hourPart-timeAce Hardware is coming to Coachella! We're opening Coachella Ace Hardware in January 2019 to give our community a locally owned and operated Hardware store. We're excited to make it the best and most helpful place to go for DIYers and contractors alike for their hardware needs!\n\nWe are looking for vibrant and personable FULL-TIME (32 to 40 hours/week) and PART-TIME (15 to 25 hrs/week) Sales Associates/Cashiers for our location.\n\n\nPay starts at $11/hour\nMust be available evenings and weekends\nBi-lingual preferred\nPrior experience with hardware or cash registers is preferred but not required\nExceptional customer service and people skills required\n\nThe Sales Associate/Cashier will be responsible for providing amazing customer service, assisting in stocking inventory, and performing various duties as required. You will learn a lot about Hardware and be rewarded by getting to help people.\n\nStore Hours:\nMonday-Friday 7am - 6pm\nSaturday 8am - 5pm\nSunday 9am - 4pm"}, {"title": "Picking and Packing Associate", "company": "Apex Tool Group", "location": "Apex, NC", "job url": "Not Available", "description": "Apex Tool Group, LLC has an opening for a Pick/Packer position. This is a Full Time Opportunity with an Award Winning Hand and Power Tool company. The ideal candidate will have at least 2 years of experience picking and packing orders in a fast paced environment.Work Hours 3:30pm to 1:00amKey ResponsibilitiesAssist in the sorting of labels based on priorityPlace the labels on the boxes in the designated areasPlace packing lists in and on the respective boxesUse the pre-sorted labels as a guide to pick casesUse the Warehouse Management System (WMS) to look at ordersUse the RF scanner to pick and pack items within the WMSOperate machinery to package certain special ordersPerform basic mathematical calculationsFollow safety regulationsPerform other related duties, as requested or directedMinimum Qualifications: High school diploma or GED equivalentAbility to consistently lift, push and pull 30-50 lbsAbility to consistently move in a full-range of motionAbility to stand and sit for long periods of timePreferred Qualifications: Previous distribution or warehouse experienceIf you are interested in joining our team please submit a copy of your resume.We are Apex Tool Group (www.apextoolgroup.com), a $1.5 billion manufacturer and worldwide designer of industrial hand and power tools, tool storage, drill chucks, chain, and electronic soldering products. Apex Tool Group (ATG) and our 8000 associates have built a legacy of powerhouse brands, trusted to get the job done. Our brands include Crescent, GearWrench, Weller, SATA, Lufkin and Wiss as well as several key private label products for major global retailers. With a heritage that began in the 1800s with Wiss scissors, Nicholson files and Lufkin wood rules, today our tools and products support a wide variety of global industries, including automotive, aerospace, electronics, energy, hardware, industrial, and consumer retail.ATG associates, in 30 locations around the world, are dedicated to providing our customers with high performing, innovative products, timely delivery, and customer service that is second to none. We pride ourselves on continuous improvement, and use lean and efficiency tools to guide our company-wide improvement initiatives. Our five core values - Customers Come First, Integrity in All We Do, Continuous Improvement in Every Aspect of our Business, Innovation for Growth and Best Talent, One Team - drive how we operate, every day.But dont just take our word for it. Customers and industry groups recognize our innovation and responsiveness, and every year we are proud to earn supplier accolades. For example, ATG was named Vendor of the Year by national retailers Ace Hardware and Do-It-Best, and were honored by Sears Holdings with its Partners in Transformation award for our innovative product offerings. Our Weller brand won the prestigious Red Dot global design award for our new Consumer Soldering Iron.If you like to work in an environment where the journey to finding a better way never ends, and where your ideas are heard and acted upon, ATG is the company for you!Apex Tool Group is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.Job Type: Full-timeExperience:using RF Scan System: 2 years (Preferred)picking and packing: 2 years (Preferred)Education:High school or equivalent (Required)"}, {"title": "Human Resources Business Partner- Hardware", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=a0a24568ca3a604a&from=vj&pos=top", "description": "Summary\nPosted: Oct 23, 2018\nWeekly Hours: 40\nRole Number: 113975912\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple dont just craft products - they build the kind of wonder thats revolutionized entire industries. Its the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The promise of working at Apple is the opportunity to do your best work - ultimately contributing to products and services that enrich the lives of millions of people. Delivering on this promise requires commitment from individual employees, their managers and their leaders. The stewards of this promise, however, are the HR Business Partners. People Business Partners at Apple facilitate and influence the dialogue and decisions that impact employees, and ensure that conditions are enabling peoples best work. They partner closely with leaders on short-term and long-term strategies, balancing competing needs and approaches, and arriving at the best decisions for a given situation. This is a great opportunity to partner with and support the Hardware Engineering Products teams at Apple. Hardware Engineering is a critical and strategic imperative for the company, delivering products that provide the highest quality experience our Customers expect and deserve.\nKey Qualifications\nKey Qualifications\nExperience in a HR management, generalist, and/or business partnering role within a complex environment.\nStrong communications skills, including influencing and ability to support innovation.\nHighly collaborative style and flexible approach. Willingness and demonstrated ability to work in teams, as both a lead and a supporting team member.\nAbility to coach, mentor and advise where appropriate to help employees grow and develop in alignment with business and personal goals.\nAbility to execute foundational Project Management skills where needed and appropriate.\nDescription\nDescription\nIn this role, you will closely partner with key business leaders, by aligning HR strategy with business strategies. You will provide a full spectrum of both strategic and tactical HR support and programs on a global basis to employees and managers. Business Knowledge: Ensure depth of understanding of organizations supported, including key business functions and processes. Connects People, Teams and Organizations: Ensures the right information gets to leaders and key partners throughout the organization. Finds ways for managers and senior leaders to build meaningful connections with their team members and with each other. Bridges teams, regions, and individuals, identifying opportunities and mediating issues within the organization. Culture: Develop knowledge and skills to be able to reinforce the Apple culture with leaders and employees. Partner with Apple University and business leaders to develop programs and initiatives which help educate and reinforce Apple culture with teams. Uses both data and observations to develop the morale and motivation of the organization. Consistently assesses the organizational effectiveness of all aspects of the employee life cycle. Puts programs in place that help managers and leaders build community and address the specific needs of their teams. Coaches: Is seen as a trusted and knowledgeable member of the leadership team for the organizations supported. Provides positive and constructive feedback to leaders. Guides managers and senior leaders making talent decisions, from everyday decisions to challenging situations. Helps managers and senior leaders resolve conflict within their teams or with their peers across Apple. Collaborates with employee relations partners on complex legal and employee relations issues. Talent Strategy: Drives a talent strategy to meet the short and long term needs of the business and Apple. Diagnoses trends for the organization (growth, attrition, performance, succession) and alerts leaders about trends to watch. Knows the top talent in the organization and ensures plans are in place to support their growth and development. Compensation & Benefits: Advise and support line management on local and global compensation and benefits initiatives. Competence in interpreting internal compensation framework and external market survey data. Identifying emerging trends. Partner with management and Benefits to assist with the management of leaves, disabilities, and Workers Compensation. Special Projects: Develop and work on special and cross-functional projects as needed. Examples include Division HR project, site specific (Austin, Sacramento, Cupertino) projects and global projects. Training: Understand the training/development needs of organization and act as liaison with Corporate Training to deliver or secure appropriate training to the organization. Author and deliver curriculum for site- and division-specific brown bags and training.\nEducation & Experience\nEducation & Experience\nBachelors degree required\nAdditional Requirements\nAdditional Requirements"}, {"title": "Cashier", "company": "Thacker ACE Hardware", "location": "Petersburg, VA 23805", "job url": "https://www.indeed.com/rc/clk?jk=79dfdfd8bd025df2&from=vj&pos=top", "description": "Desired: CashieringCustomer ServiceThacker Ace Hardware\n\nGeneral Summary\nThe Cashier is responsible for register transactions involving the sale and/or return of merchandise.\n\nEssential Duties & Responsibilities\nInclude the following. Other duties may be assigned.\n\nCustomer Service\n\nProject a positive representation of Thacker Ace Hardware.\nGreet customers entering and throughout the store. Thank customers by name, when possible, when they are leaving the store.\nProject a friendly, outgoing demeanor; work well with customers as well as associates.\nClear customer checkout lines quickly and efficiently.\nAnswer and monitor all calls and pages promptly, courteously and effectively.\nCommunicate any problem or issue that requires management assistance.\nContinually build product knowledge base and possess the ability to assist customers with store layout and product location.\nAssist in pricing, stocking, marking and bagging of merchandise.\n\nRegister Operations\n\nFollow all cash register transaction procedures.\nResponsible for balancing of register drawer.\nAdhere to any Store Support Center program or promotion that may require implementation at the cash registers.\nParticipate in store and Cashier meetings.\n\nFront End Appearance and Upkeep\n\nKeep the front end, including checkout areas and entrance doors neat and clean at all times. Face and dust front end.\nAssist with keeping impulse counters stocked and faced, rotate fresh merchandise in as seasons change.\nEnsure fresh ads are stocked in shopping carts at all times.\nEnsure forms and supplies are stocked at all times.\nAssist with decorating the front end according to the Store Support Center program.\nCall for cart pickups when necessary.\nInform sales associates when merchandise returns need to be put away.\nPerform all other duties as assigned.\n\nOther Essential Requirements\n\nAbility to stand for long periods of time\nMust be able to report to work during inclement weather.\n\nEducation/Training\n\nHigh School or GED equivalent.\n\nExperience\n\nCashier experience preferred. Customer service experience preferred.\n\nPhysical Demands\n\nStanding, walking, lifting (up to 25lbs) and climbing.\n\nYou are applying for a job with an independently owned cooperative member of Ace Hardware Corporation, who operates this Ace Hardware store, not Ace Hardware Corporation. The independent store owner alone is responsible for and independently makes all decisions concerning employment related matters, including hiring, firing, discipline, supervision, staffing and scheduling. Ace Hardware Corporation will not receive a copy of any applications submitted for this position, and will have no control over interviews and/or hiring decisions, does not control and is not responsible for the employment policies and practices of the independent store owner. If hired, the independent store owner will be your only employer. Ace Hardware Corporation is not the employer for this position. The Ace Hardware trademarks, logos and designs are owned by Ace Hardware Corporation and used by independent store owners under a license from Ace Hardware Corporation."}, {"title": "Work-At-Home Customer Experience Representative", "company": "DISH Network", "location": "Harlingen, TX", "job url": "https://www.indeed.com/rc/clk?jk=6852f9bc137560bb&from=vj&pos=top", "description": "DISH is a Fortune 200 company with more than $15 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service  Sling TV  that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.\n\nNow we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers.\n\nWe are driven by curiosity, pride, adventure, and a desire to win  its in our DNA. Were looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\n\nOpportunity is here. We are DISH.\nA successful WAH Customer Support Representative will have the following:\nHigh School diploma, GED, or equivalent experience\nSix-months related customer service/technical support experience and/or training preferred\nAnalytical and intuitive; capable of following logic and then making the instinctive leap to a solution; problem solving and critical thinking skills are essential\nProficiently utilize Windows OS (XP, 7, 8, 10) and internet search engines\nAbility to speak effectively with customers and employees of the organization\nStrong organizational, time management, and problem solving skills\nExcellent written and oral communication skills\nStrong sense of professionalism and active listening skills\nAbility to problem solve and use available software/tools to understand and craft the right solution across varying customer needs, business rules, and processes\nAbility to work with minimal supervision in a remote location\nTechnical Requirements\nInternet Minimum Specifications\nAt Home agents must meet and maintain the following requirements:\nMinimum 7 Mbps download\nMinimum 1 Mbps upload\nInternet provider thats not fixed wireless or satellite\nAll costs to meet and maintain these requirements, including repairs, Internet/ISP charges, and additional charges associated from their ISP are the responsibility of the At Home agent and are not reimbursed by DISH\nData and Usage Caps\nDISH prefers that At Home agents do not have bandwidth or data cap on Internet usage (caps lower than 250GB are not recommended). At Home agents are responsible for managing their data usage in a way that does not impact ISP connectivity, and they will be responsible for paying any overage charges associated with exceeding a cap.\n\nEquipment\nAgents will receive the necessary At Home equipment on-site. At Home agents will be responsible for transporting and installing the equipment to their at-home location. Agents will receive a document to help install the equipment and will have the opportunity to connect the equipment onsite before going home.\n\nConnectivity\nAt Home agents are expected to have 99% uptime.\n\nHome Environment and Work Space\nAgents must have a dedicated workspace as the home office (preferably a separate room) and must maintain the workspace in a safe condition, free from hazards and other dangers to people and equipment. Since At Home agents will assist DISH customers over the phone personal disruptions such as but not limited to children playing, dogs barking, loud music, and non-work-related phone calls. Additionally, dependent care and other family obligations must not interfere with job duties.\n\nDISH reserves the right to inspect At Home workspaces to ensure business requirements are met. At Home agents must agree and understand that such inspections are necessary to ensure continuity of DISHs business and excellent standards of customer service.\n\nTeam Environment\nAt Home agents will be members of a larger virtual team, with support from a supervisor. There will be additional resources available such as team leads, help desk, and online tools. This is a structured environment and At Home agents will be provided a schedule they must adhere to.\n\nWE PROUDLY OFFER A FULL BENEFITS PACKAGE:\nMedical, Dental and Vision\n401K with company match + profit sharing\nPaid holidays and time off\nLife and short/long term disability insurance\nDiscounted Employee Stock Purchase Program\nTuition reimbursement\nCOMPLIMENTARY DISH PROGRAMMING (YES that includes HBO, Showtime, and Cinemax!)\n5% increase to your salary upon successful completion of 90 days!\nOpportunity to earn up to 30% increase to your salary within your first year!\nCumulative shift differentials for working split shifts, hours worked past 6pm & weekends- potential $5 additional per hour worked!\nWe need driven individuals who can adapt as we continue to grow and who are motivated to advance while taking on new responsibilities. We love to promote employees from within and have several career path opportunities to choose from - Operations, Training, Workforce, Quality Assurance, Management and more!\nThe WAH Customer Experience Representative answers inbound technical and customer service calls from internal and external customers. Other responsibilities as follows:\nSupport Tier 1 technical support and customer service phone support for external customers\nRegular and predictable attendance\nThis support can be, but is not limited to, entertainment services and products, hardware systems/accessories, and customer service inquiries regarding technical support, billing, and general information requests\nProvide quality technical support service through one-contact resolution to establish a long-term customer relationship\nAccurately respond to questions and assist customers (internal and external) with product features, installation, setup, and troubleshooting and hardware operations primarily via phone\nAssist customers with their billing and payments as needed\nSell multiple entertainment products and services as well as hardware systems and accessories\nMust be Harlingen based\nEssential Functions:\nA WAH Customer Experience Representative performs the job duties and responsibilities above as well as the following essential job functions:\nWillingness to work flexible schedules including weekends, holidays, and evenings\nAbility to regularly sit for long periods of time\nAbility to multi-task; speaking with customer while accurately logging and recording customer information in to call center databases\nTake back-to-back phone calls from DISH internal customers nationwide andassist them with questions regarding work order modifications, equipment modifications, as well as activation of customer services\nMeet or exceed minimum performance standards including but not limited to Average Handle Time; Customer Satisfaction; Quality, Up-selling, etc. You will be constantly measured on these metrics\nDeescalate upset or irate customers in order to satisfactorily address their customer service needs"}, {"title": "Apple Media Producer", "company": "Apple", "location": "Santa Clara Valley, CA", "job url": "https://www.indeed.com/rc/clk?jk=b01433d4d57ba7a0&from=vj&pos=top", "description": "Summary\nPosted: Sep 21, 2018\nWeekly Hours: 40\nRole Number: 114096027\nThe people here at Apple dont just create products  they create the kind of wonder thats revolutionized entire industries. Its the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. We are looking for a highly motivated and experienced producer with top-notch project management, communication and collaboration skills, to lead profile promotions across the movie, TV and book store.\nKey Qualifications\nKey Qualifications\nExcellent organization, leadership, communication, and written skills.\nA self-starter who demonstrates critical thinking.\nSkilled at developing and exercising cross-functional influence; translating between business owners, technical and production teams.\nProven experience working on complex, international, large-scale, time-critical projects.\nCommunicates clearly and concisely across multiple audiences and partners, including analytical outcomes and technical roadblocks\nExperience project managing software engineering and product engineering teams.\nTechnically savvy with a deep understanding of UI and UX principals and practice.\nExcels at driving overarching schedules and identifying milestones.\nGrasps complex processes and adapts to change seamlessly.\nConfidence in calling out issues and presenting to senior management on project status and schedules.\nExperience working hand-in-hand with creative teams.\nUnderstands the Apple ecosystem of services and hardware: (Mac OS, iOS, Apple Music, iTunes, App Store, Apple Books, Video (Movies and TV), Podcasts, iTunes U, Trailers, Apple TV, etc.)\nWell versed in pop culture, and passionate about digital entertainment including the latest trends and technologies\nAvailable to work evenings and/or weekends\nDescription\nDescription\nThe producer sits at the heart of Apple Media, working cross functionally with Design, Production and Editorial teams to coordinate and deliver engaging promotions and campaigns to our customers. Working closely with business partners to identify and understand their priorities, the producer maps out execution plans including deliverables, timelines, and dependencies. They collaborate with a wide range of worldwide teams to ensure that projects are completed under the required deadlines and that all teams execute the vision in a clean and painless fashion. Responsibilities include leading kickoff meetings, creating and communicating timelines, establishing milestones, scheduling creative reviews and articulating launch plans. Producers must effectively track and share project status, identify and resolve potential delays, QA and troubleshoot technical problems and confirm that all aspects are ready for launch. The producer will drive and document efficient processes in collaboration with engineering and product development teams. They must be the expert in how content iterates in our ecosystem, and have an in-depth understanding of how upcoming features will impact merchandising strategy. Producers bring together multiple lines of business and help fulfill the needs for content curation, events, and brand development. They must set the pace while working on high-pressure projects with extremely tight deadlines, staying flexible as priorities shift while also holding peers accountable to meet deadlines. Our ideal candidate will hit the ground running and be familiar with the speed at which traditional design and creative agencies work. This is someone who has a proven track record of cross-functional collaboration, exercises the highest levels of professionalism and confidentiality, understands how to set the appropriate tone for a project, and operates with a constant sense of urgency, but without a sense of panic. The ideal candidate loves popular media and has an in-depth knowledge of Apple products.\nEducation & Experience\nEducation & Experience\nBA or BS degree, plus 5 or more years of related work experience\nAdditional Requirements\nAdditional Requirements"}, {"title": "2019 Summer Full Time Intern/Co-Op", "company": "Quartus Engineering", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=f4f3358838fbecfd&from=vj&pos=top", "description": "Temporary, InternshipQuartus Engineering Incorporated (www.quartus.com) is a leading provider of mechanical, optical, aerospace and electrical engineering services and integrated hardware solutions for the aerospace, defense, entertainment, commercial, consumer, and medical industries. We support our clients with advanced mechanical, optical, aerospace and electrical design, analysis, optimization, test, prototype development, and manufacturing using modern CAD and CAE tools and leveraging our clean room laboratories.\n\nWe are looking for Mechanical or Aerospace Engineering students interested in working in a fast-paced, multi-disciplinary environment and who are excited about assisting on a variety of projects to join our growing team. Some examples of projects students have worked on in the past include design, analysis, prototype development and/or testing of satellites, aircraft structures, launch vehicles, composite UAVs, cell phones, mp3 players, telescopes, roller coasters, and opto-mechanical laser and camera assemblies.\n\nGet Real World Experience:\n\nIn todays competitive professional world, the most qualified job candidates possess more than classroom experience. They leave college and enter the workforce with hands-on exposure to their chosen fields, gained through enriching internships with prominent organizations. Quartus places high value on internship experience when making hiring decisions. And through our own Internship and co-op programs, we strive to shape the future leaders of our company. As a Quartus intern, youll be challenged to realize your own potential. Youll learn from Quartus professionals and immerse yourself in real project work. From day one, youre an important member of our team. Our internship program is designed to provide you with a well-rounded view of life at Quartus, The typical sequence includes:\n\nSetting goals for learning and achievement\nReceiving guidance from Quartus mentors\nWorking on actual client projects and visiting job sites\nInteracting with other interns on special projects\nEnjoying social and professional events\nReceiving feedback and a formal evaluation from your supervisor\nWhat Makes Quartus Different?\n\nFrom your internship with Quartus, youll take away an invaluable work experience, a sense of contribution to the community, and hopefully some new friends. Perhaps most importantly, youll leave with the feeling of being valued. Unlike many programs, prior Quartus interns are given strong consideration for full-time employment after graduation.\n\nAre You Up to the Challenge?\n\nQuartus is looking for aspiring individuals who want to make a difference in the world and in themselves. Our ideal internship candidates are:\n\nSophomores, Pre Juniors or Juniors currently enrolled at a four-year institution\nMajoring in an Engineering field\nProactive, open-minded, eager to learn and willing to work hard as part of a team\nInterested in design and/or analysis\nAvailable full time for specified term (40 hours per week)"}, {"title": "Entry Level Hardware Engineer", "company": "EchoStar", "location": "San Diego, CA", "job url": "https://www.indeed.com/rc/clk?jk=b3a5a542e4c75ec3&from=vj&pos=top", "description": "EchoStar Corporation (NASDAQ: SATS) headquartered in Englewood, CO, with additional locations world-wide, is a premier global provider of satellite solutions and technology services. Together with its major subsidiariesEchoStar Satellite Services and Hughes Network Systems EchoStar offers employees the opportunity to explore the boundaries of whats possible in the fields of engineering and the business functions transforming this engineering into revenue.\n\nHughes Network Systems, LLC, an EchoStar Company, (Hughes) is the world's leading provider of satellite broadband for home and office, delivering innovative network technologies, managed services, and solutions for enterprises and governments globally. HughesNet is the #1 high-speed satellite Internet service in the marketplace, with offerings to suit every budget. To date, Hughes has shipped more than 4 million systems to customers in over 100 countries, representing approximately 50 percent market share.\n\n\nHughes has some exciting opportunities for entry level hardware engineers in areas such as RF, DSP, Board Level Design and VLSI/ASIC for positions located in San Diego, CA.\n\n\nResponsibilities:\nDevelop and qualify high performance satellite products or systems.\nInvolve selection of components for products, schematic capture, high speed signal integrity and power integrity analysis, design verification testing, design and test documentation, as well as product failure analysis\nProjects may involve exploration of products and/or process problems, definition and selection of new concepts and approaches, origination or modification of material, component and process specifications as well as defining product requirements .\n\nBasic Requirements\nBachelors in Electrical Engineering\n\nEchoStar and its Affiliated Companies are committed to hiring and retaining a diverse workforce. We are an Equal Opportunity/Affirmative Action employer and will consider all qualified applicants for employment without regard to race, color, religion, gender, pregnancy, sex, sexual orientation, gender identity, national origin, age, genetic information, protected veteran status, disability, or any other basis protected by local, state, or federal law. U.S. Citizenship is required for certain positions. EEO is the law."}, {"title": "Materials Stocker", "company": "MOUNTAIN HARDWARE AND SPORTS, INC.", "location": "Truckee, CA 96161", "job url": "https://www.indeed.com/rc/clk?jk=0d70066b15d2f844&from=vj&pos=top", "description": "Be part of a growing Employee Owned Company!\n\nMountain Hardware and Sports is now hiring for the following full time position:\n\nMaterials Stocker\n\nDuties include, but are not limited to:\nRequired Experience:\n\nStrong customer service\nUnload, uncrate and assemble merchandise and sales floor displays\nMark items with identifying codes, such as price, stock, or inventory control codes\nEnsure labels are clear and visible\nStock shelves with incoming products accurately and efficiently\nReplace damaged or missing products\nAssist customers on sales floor\nAssist with maintaining cleanliness of the store including merchandising, mopping, dusting, vacuuming, etc.\nProvide general support as needed, including cashiering\n\nRequired Skills:\n\nExcellent customer service\nOutgoing and friendly\nAbility to lift up to 75 lbs.\nAbility to work at heights, climbing ladders and 2-story back stock space\nAbility and comfort walking on uneven surfaces\nRequires continuous physical activity including walking, standing, climbing, and lifting\nAbility to stand for an extended amount of time\nExcellent written and verbal communication skills\nAttention to detail and mathematical skills\nAbility to Multitask and effectively manage time on assigned projects\nInventory control and RF Gun knowledge is a plus\nPoint of Sale system knowledge is a plus\nAbility and willingness to work flexible hours including evenings, weekends, and holidays\n\nCandidates should be able to work in a fast paced environment and enjoy being part of a team\n\nBenefits include medical, dental, vision, vacation and sick pay, significant store discount and participation in Employee Stock Ownership Program (ESOP) and 401K"}, {"title": "Cashier", "company": "Central Network Retail Group, LLC", "location": "McComb, MS 39648", "job url": "https://www.indeed.com/rc/clk?jk=8c97b58be47a6a38&from=vj&pos=top", "description": "A Cashier must provide aggressive customer service through greeting customers as they enter the store and the timely, accurate processing of customer transactions. Also, a Cashier greets customers as they approach the register area, scans merchandise, processes all sales, refunds/exchanges and uses the register to close transactions. The position also includes training, maintenance and stocking responsibilities as assigned similar to that of a CNRG - Home Hardware Center Sales Associate. Since the cashier will often be the first and last person a customer will encounter when shopping at Home Hardware Center they should greet each customer when they enter and thank each customer for shopping with us as they leave.\nEssential Duties and Responsibilities\nUnderstanding and conducting yourself according to our Values\nAccurately processing customer transactions in an orderly, timely, and friendly manner (credit cards, cash, checks, etc.)\nGreeting customers as they enter and exit the store, creating a lasting impression of friendliness to the customer\nVerifying merchandise quantities, descriptions, and prices to ensure accuracy when completing a transaction\nHandling returns/exchanges and sales of merchandise\nAnswer incoming phone calls in a prompt, efficient and courteous manner\nReceiving payment on commercial accounts, receiving money from drivers on C.O.D. tickets and aiding in credit application completion\nCompleting and filing due tickets for customers needing a later pick-up\nAccurately counting down all tenders, preparing deposits and organizing the drawer for the following day\nUtilizing the credit and check verification system according to established company policy and procedures\nEnsuring the daily inflow and outflow of paperwork, including filing and storage, is handled in an efficient and precise manner according to established procedures which will include daily reports, currency and other documentation as necessary.\nDirecting customers to items in the store and calling other team members for customer assistance\nResponsibility for cash and controls to protect company assets\nAbility to maintain a positive customer service-attitude at all times\nFollowing all register procedures\nAbility to accurately determine the difference between similar products\nHelp keep the store clea\n\nSafety & Loss Prevention:\nPossess working knowledge of company and store security measures.\nUnderstand common techniques employed by shoplifters or others seeking to defraud the company and remain vigilant about observing suspect activity and reporting it to management.\nFollow company safety guidelines and basic safety practices at all times. Participate in regular store safety meetings.\n\nPerform other duties similar to those above as assigned by the store manager's supervisor or other qualified corporate or platform representative. Other tasks as assigned by store management.\nThis job is an hourly position (non-exempt from overtime). Though successful sales associates may be considered for other opportunities within the company, the position carries no guarantee of career progression. The job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee.\n\nCentral Network Retail Group, LLC complies with all applicable equal employment laws, including the Americans with Disabilities Act. Qualified individuals with a disability may request reasonable accommodation from the company."}, {"title": "Electronic/Mechanical Assembler", "company": "Quantum Design Inc.", "location": "San Diego, CA 92121", "job url": "https://www.indeed.com/rc/clk?jk=ae397680be707fa8&from=vj&pos=top", "description": "Description:General Summary:\nThis position is responsible for performing various repetitive electronic/mechanical assemblies. Assigned projects range from simple to complicated; requiring attention to detail and instruction. One shift available 6 am to 2:30 pm.\n\nEssential Job Functions:\n\nUses a computer to look-up information; reads and follows instructions Reads and interprets drawings and schematics Uses a microscope to align parts and perform detailed work Handles fragile boards in accordance to ESD techniques Disassembles, reworks or reassembles electronic and mechanical assemblies Cable Assembly: dressing, routing, epoxy, crimping, wire handling (10 to 40 gauge) Uses hand tools such as electric drills, screwdrivers, wrenches, hand crimpers, and other hand tools Performs work in accordance to established procedures.\n\nRequirements:\nEducation and Experience:\nPrevious experience in a manufacturing/assembly environment.\nMust be able to multi-task and work in a flexible work environment.\nMust be able to sit for long periods.\nMust be able to lift up to 25 lbs.\nMust have knowledge of hardware and understand dimensions.\nMust be able to work with small parts and fine wires.\nFine Wire Solder proficiency: mechanical parts, cables/wires, PCA preferred"}]