[{"title": "Online English Tutor", "company": "Cambridge Network", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=b6c46dfbbc7adfa4&from=vj&pos=top", "description": "ContractAre you looking for fun and rewarding work? We are searching for passionate and talented Online Tutors to assist our students in English! Become a tutor today! Cambridge Network provides our tutors excellent support, flexible hours that fits your schedule, and great pay. Become part of our team today!\nLearn more about us at www.cambridgenetwork.com\nEnglish: (English literature, academic reading, writing and composition)\nResponsibilities include, but are not limited to:\nBuild rapport and relationships with students to encourage and motivate students\nDevelop appropriate lesson plans and goal setting\nConduct one-on-one or small group tutoring session\nAssist with homework and projects, and review work with the student to ensure advanced comprehension of school materials and prepare the student for any upcoming teaching content, tests, or quizzes\nTrack and analyze student progress, complete progress reports, and communicate with Tutoring Coordinator about student progress\nQualifications:\nBachelors degree and established high-level proficiency in subject matter\nExcellent interpersonal and communication skills\nFamiliarity with American middle and high school curricula\nPassionate about education and cultural diversity\nPass a background check and eligible to work in the US"}, {"title": "Online Social Studies Tutor", "company": "Cambridge Network", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=5d5aa516d7f22226&from=vj&pos=top", "description": "ContractAre you looking for fun and rewarding work? We are searching for passionate and talented Online Tutors to assist our students in Social Studies! Become a tutor today! Cambridge Network provides our tutors excellent support, flexible hours that fits your schedule, and great pay. Become part of our team today!\nLearn more about us at www.cambridgenetwork.com\nSocial Sciences: US history, world history, European history, government and politics, geography, psychology, sociology, economics, study skills, business\nResponsibilities include, but are not limited to:\nBuild rapport and relationships with students to encourage and motivate students\nDevelop appropriate lesson plans and goal setting\nConduct one-on-one or small group tutoring session\nAssist with homework and projects, and review work with the student to ensure advanced comprehension of school materials and prepare the student for any upcoming teaching content, tests, or quizzes\nTrack and analyze student progress, complete progress reports, and communicate with Tutoring Coordinator about student progress\nQualifications:\nBachelors degree and established high-level proficiency in subject matter\nExcellent interpersonal and communication skills\nFamiliarity with American middle and high school curricula\nPassionate about education and cultural diversity\nPass a background check and eligible to work in the US"}, {"title": "Math Tutor / Coach Opportunity", "company": "Mathcodes", "location": "San Diego, CA", "job url": "Not Available", "description": "$65 - $100 an hourPart-timeAs a result of growing demand, I am hiring a new team of Math Coaches to serve a wider market of students across various time zones.In our expanding but unregulated tutoring industry, there is a range of tutor competence and a disparity of compensation. Tutors are often undervalued or untrained and can offer unpredictable services, either independently or for companies who will profit heavily on their skill-sets.My commitment is to share my teaching process and my system of student/parent management developed over 17 years of working privately with hundreds of struggling math students. The approach is proven and effective. It will increase your value, improve your results and define you as a Math Coach not a tutor.Our clients view Math Coaches as a valuable investment, not a last-minute expense and their motivation and commitment ensure a predictable, consistent income at rates much higher than average.I look forward to training a new wave of Math Coaches so you can work with us, perform at the highest level, and be justly rewarded.If you are skilled at math, have a growing mindset and a desire to transform the lives of struggling math students I would like to get to know you.Candidates may reside in time zones across North America.Please complete the questionnaire located at the link below, and I will follow up with you.https://www.mathcodes.com/p/mathcoach-applicationKohilawww.mathcodes.comJob Type: Part-timeSalary: $65.00 to $100.00 /hour"}, {"title": "Online Religious Studies Tutor", "company": "Cambridge Network", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=82f9758ef1115628&from=vj&pos=top", "description": "ContractAre you looking for fun and rewarding work? We are searching for passionate and talented Online Tutors to assist our students in Religious Studies! Become a tutor today! Cambridge Network provides our tutors excellent support, flexible hours that fits your schedule, and great pay. Become part of our team today!\nLearn more about us at www.cambridgenetwork.com\nReligious Studies: Catholicism, Christianity, and World Religions\nResponsibilities include, but are not limited to:\nBuild rapport and relationships with students to encourage and motivate students\nDevelop appropriate lesson plans and goal setting\nConduct one-on-one or small group tutoring session\nAssist with homework and projects, and review work with the student to ensure advanced comprehension of school materials and prepare the student for any upcoming teaching content, tests, or quizzes\nTrack and analyze student progress, complete progress reports, and communicate with Tutoring Coordinator about student progress\nQualifications:\nBachelors degree and established high-level proficiency in subject matter\nExcellent interpersonal and communication skills\nFamiliarity with American middle and high school curricula\nPassionate about education and cultural diversity\nPass a background check and eligible to work in the US"}, {"title": "Reading Tutor", "company": "PRIDE Learning Center", "location": "Oceanside, CA", "job url": "Not Available", "description": "$30 an hourPart-timePRIDE Learning Center, is a premier tutoring company for children with learning difficulties.We are looking for enthusiastic, reliable, and flexible educators seeking part time employment. We are looking for someone that is available a few hours every week after school hours.We are currently looking for Reading Tutors that:Are ready to be trained and can deliver our easy to implement and 100% scripted multi-sensory reading program, to teach reading, spelling and comprehensionHave experience working with school age children with special needs and with creating and maintaining a positive and engaging learning environmentMust have the ability to develop rapport with studentsMust have an electronic device that can be brought to the tutoring locationHave great communication skills and are able to motivate studentsAre able to commute to the tutoring location (students home/school/library etc.)Are committed to establish and maintain a professional long term tutoring relationship with the studentTo apply:Send resume outlining your relevant experience and educationPlease let us know what your availabilities are (days and times)This is a great part time job if you are an instructional assistant, ABA therapist, paraprofessional, teacher, substitute teacher, graduate student in the educational field, or speech therapist assistant.We are looking forward to hearing from you!PRIDE Learning Center provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics as well as marital status, sexual orientation, gender identity, medical condition, military status, political activities or affiliations, and status as a victim of domestic violence, assault, or stalking . In addition to federal law requirements, PRIDE Learning Center complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.Job Type: Part-timeSalary: $30.00 /hourJob Type: Part-timeSalary: $30.00 /hour"}, {"title": "Homework Tutor / STEM Instructors (K-6)", "company": "Sylvan Learning Encinitas", "location": "Encinitas, CA", "job url": "Not Available", "description": "$13 - $15 an hourPart-timeThe Sylvan Learning Center in Encinitas is seeking Part-Time Homework Support or STEM Instructors (K-6th grades). Instructors will manage and assist elementary school students with their homework and projects, while representing the Sylvan Learning Center company. Training will be provided. Classes are from 2 - 3 hrs on school campuses in the Encinitas/Carlsbad area.As a successful Instructor, you will: Deliver Program:Provide individualized instruction to help students complete school assignments.Supervise, interact with and motivate students during instruction hourReward students for completed assignmentsEvaluate and document student progressCommunicate student needs to the center managerInspire Students:Develop rapport with studentsEstablishes a fun learning environmentInspire students to work toward comprehensive reading and fluent writing skillsEncourage a positive attitude toward learningRequirements:1. Have experience in working with children would be preferred but not required.2. Mid-afternoon (2 - 4 PM) hours available are needed3. An enthusiastic approach to teaching.Job Type: Part-timeJob Type: Part-timeSalary: $13.00 to $15.00 /hourEducation:Associate (Preferred)"}, {"title": "Online Language Tutor", "company": "Transparent Language", "location": "Nashua, NH", "job url": "https://www.indeed.com/rc/clk?jk=3b4b461a645b34ba&from=vj&pos=top", "description": "$12 - $20 an hourPart-timeDesired: Teaching ExperienceTransparent Language is a leading provider of best-practice language learning software for consumers, government agencies, educational institutions, and businesses. Transparent Language is now building the capabilities to deliver online, instructor-led, language instruction and tutoring services. As part of this program, Transparent Language will be hiring part-time Online Language tutors.\n\nOnline Language Tutors shall have responsibility for assisting students in language learning by teaching new concepts and facilitating communicative tasks.\n\nOnline Language Tutor:\nAll tutor applicants should have strong foreign language teaching experience. Experience with classroom technology and/or online instruction is a plus.\n\nRequirements:\n1. Fluency in English and at least one target language: , Chinese, Mandarin Chinese, Danish, Dari, Dutch, Farsi, French, German, Greek, Hebrew, Hindi, Indonesian, Iraqi Arabic, Arabic-MSA, Italian, Japanese, Korean, Malaysian, Modern Standard Arabic, Norwegian, Pashto, Polish, Portuguese, European, Russian, Spanish, Swahili, Swedish, Thai, Turkish, Vietnamese, Urdu\n\n2. Ability to teach one or more of the following languages: Chinese, Mandarin Chinese , Danish, Dari, Dutch, English (ESL/TESOL), Farsi, French, German, Greek, Hebrew, Hindi, Indonesian, Iraqi Arabic, Arabic-MSA, Italian, Japanese, Korean, Malaysian, Modern Standard Arabic, Norwegian, Pashto, Polish, Portuguese, European, Russian, Spanish, Swahili, Swedish, Thai, Turkish, Vietnamese, Urdu\n\n3. Availability during evenings and/or weekends\nThis position can be based anywhere, but instructors must have a computer with a fast, reliable internet connection, (no dial up, please!)\n\nCompensation: $12-20/hour, based on experience."}, {"title": "High School Tutor", "company": "La Jolla LearningWorks", "location": "San Diego, CA", "job url": "Not Available", "description": "$18 - $25 an hourPart-timeWe are looking for fun, engaging, and experienced educators to help our students reach their fullest potential in academic achievement! Our ideal candidate has experience helping students overcome academic challenges related to learning disabilities and ADHD. The right person for our company communicates with confidence and compassion, inspiring a love of learning in students and collaborating effectively with parents and classroom teachers. You will have outstanding oral and written language skills and are well versed in terms like, dyslexia and executive functioning. You are a regular note-taker and understand the importance of record keeping to track student progress. You are someone others look up to and admire how you handle a full life with such grace. You care about health and fitness, pursue your passions, and appreciate nature and just being silly - because there is a whole lot more to life than work.Job Type: Part-timeSalary: $18.00 to $25.00 /hourExperience:Teaching: 2 years (Required)"}, {"title": "GRE / GMAT Tutor", "company": "Vince Kotchian Test Prep", "location": "San Diego, CA 92121", "job url": "Not Available", "description": "$50 - $100 an hourPart-timeAre you personable? Patient? A people person?and...Are you really good at the GRE and / or GMAT?Then lets talk! Were looking for someone for both private tutoring and classroom teaching for the GRE / GMAT.Experienced candidates only - please dont apply if you have never done this before.Job Type: Part-timeSalary: $50.00 to $100.00 /hourLocation:San Diego, CA 92121 (Preferred)"}, {"title": "$30/hr Tutor Needed in Laguna Niguel", "company": "Titan Tutors", "location": "Aliso Viejo, CA", "job url": "Not Available", "description": "$30 an hourPart-timeTitan Tutors is a in home-online tutor matching service. Our goal is to develop a network of tutors that feel valued in pay and time. Connecting great people to help with students that struggle is an exciting opportunity. However, we know the value of our Tutors and we focus on making sure this part-time position is easy, convenient and stress free so that you can focus on your students!How it worksGet paid $30/hrGet paid the day you work!We match and create comfortable distance with competitive hourly payWhat we requireReliability and consistencyResponsibleBe able to travelEnjoy helping studentsIf interested, please apply by sending our resume.Job Type: Part-timeSalary: $30.00 /hourEducation:High school or equivalent (Preferred)Location:Aliso Viejo, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "SAT / ACT Tutor", "company": "Vince Kotchian Test Prep", "location": "San Diego, CA 92121", "job url": "Not Available", "description": "$50 - $100 an hourPart-timeAre you personable? Patient? A people person?and...Are you really good at both the SAT and the ACT?If so, lets talk! Were looking for tutors / teachers to help us both with one-on-one tutoring and classroom teaching for the SAT and ACT.Experienced candidates only, please - dont apply if youve never done this before.Job Type: Part-timeSalary: $50.00 to $100.00 /hourLocation:San Diego, CA 92121 (Preferred)"}, {"title": "Online Latin and Spanish Tutor", "company": "Cambridge Network", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=8e8424feb98b987d&from=vj&pos=top", "description": "ContractAre you looking for fun and rewarding work? We are searching for passionate and talented Online Tutors to assist our students in Latin and Spanish Languages! Become a tutor today! Cambridge Network provides our tutors excellent support, flexible hours that fits your schedule, and great pay. Become part of our team today!\nLearn more about us at www.cambridgenetwork.com\nResponsibilities include, but are not limited to:\nBuild rapport and relationships with students to encourage and motivate students\nDevelop appropriate lesson plans and goal setting\nConduct one-on-one or small group tutoring session\nAssist with homework and projects, and review work with the student to ensure advanced comprehension of school materials and prepare the student for any upcoming teaching content, tests, or quizzes\nTrack and analyze student progress, complete progress reports, and communicate with Tutoring Coordinator about student progress\nQualifications:\nBachelors degree and established high-level proficiency in subject matter\nExcellent interpersonal and communication skills\nFamiliarity with American middle and high school curricula\nPassionate about education and cultural diversity\nPass a background check and eligible to work in the US"}, {"title": "Online Science Tutor", "company": "Cambridge Network", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=cf50dc83e6c70b57&from=vj&pos=top", "description": "ContractAre you looking for fun and rewarding work? We are searching for passionate and talented Online Tutors to assist our students in Science! Become a tutor today! Cambridge Network provides our tutors excellent support, flexible hours that fits your schedule, and great pay. Become part of our team today!\nLearn more about us at www.cambridgenetwork.com\nScience: Chemistry, physics, biology, anatomy, physiology, geology, computers and computer sciences\nResponsibilities include, but are not limited to:\nBuild rapport and relationships with students to encourage and motivate students\nDevelop appropriate lesson plans and goal setting\nConduct one-on-one or small group tutoring session\nAssist with homework and projects, and review work with the student to ensure advanced comprehension of school materials and prepare the student for any upcoming teaching content, tests, or quizzes\nTrack and analyze student progress, complete progress reports, and communicate with Tutoring Coordinator about student progress\nQualifications:\nBachelors degree and established high-level proficiency in subject matter\nExcellent interpersonal and communication skills\nFamiliarity with American middle and high school curricula\nPassionate about education and cultural diversity\nPass a background check and eligible to work in the US"}, {"title": "Part Time Tutor Available", "company": "Leading Edge Learning Center", "location": "San Diego, CA", "job url": "Not Available", "description": "$13.50 - $19.00 an hourPart-timeInstructor Job Description: Leading Edge Learning Center, LLC is a certified supplemental Education Service Provider that was established in June 2004. Our goal is to provide a chance for achievement to children and adults who are struggling academically and tools for success for children looking to gain an academic advantage in school and in the workplace. Services provided by Leading Edge Learning Center include academic instruction, student assistance, Saturday homework help, a variety of enrichment programs for youth, and professional development courses for adults.Instructor: Responsible for facilitating student academic growth and utilizing effective instructional strategies. Instructors will provide students with opportunities and necessary skills for progressive academic success.Eligibility: Must be currently enrolled in college or have college degree/credential. Eligibility for continued assignment is contingent upon instructors demonstration of optimal performance of job duties and professional consistency for a 90-day period and successful evaluation.Mandatory Pre-employment Requirements:  TB Clearance (From within the last three years) DOJ Livescan Clearance (Leading Edge Specific)Responsibilities: Arrive on time for your tutoring appointments. Keep your time sheets updated daily and submit on time. Competency and knowledge in academic subject(s). Develop grade appropriate lessons plans. Multitask and tutor 2-5 students at a time. Assess your students appropriately after each session. Computer/software literate in Microsoft Word, Excel & internet programs/applications. Demonstrate effective verbal communication, active listening skills, and collaboration with students, parents, and co-workers. Maintain a safe environment. Clean up your area after your session ends. Demonstrate flexibility, adaptability. Project enthusiasm, professionalism, and willingness to help students learn. Monitor students results and complete progress reports on time. Ensure parent signatures are received after every session. Other duties as assigned.Job Type: Part-timeSalary: $13.50 to $19.00 /hourLocation:San Diego, CA (Required)"}, {"title": "Math Tutor", "company": "JEI Learning Center San Diego", "location": "San Diego, CA 92129", "job url": "Not Available", "description": "Part-timeDesired: CalculusTeaching CertificationTutoring*** Math Teacher / Tutor ***Welcome to JEI Learning Center in San Diego!Our center is offering after-school tutoring programs from elementary, middle and / or to high school students.Open Position: Math Teacher / TutorWe seek enthusiastic, reliable part-time Math Teacher for after-school tutoring program from elementary, middle and /or to high school students at our business in San Diego.Qualification and other conditions:Must have Math teaching / tutoring experience (more than 1 year)All levels of Math from Arithmetic, Algebra, Geometry, Pre/Calculus, or StatisticsAble to work well and to be patient with childrenAt least 12 months commitmentPlease submit resumeTeaching certification is a plusCenter Operation Hour: From 3:30pm to 7:30pm Monday to FridayEssential Job Functions:Tutor 1-4 students in a classBe knowledgeable of our Center curriculum and follow our policies with regards to tutoringMonitor and record student progress on a daily basis as well and conduct summative \"checks\" on the lesson on the lesson objectives taught that weekNotify Supervisor immediately if student(s) fail to show progressMust be able to participate in the planning, organization, implementation and coordination of individual pupil and/or client programs.A team player, detail-oriented, flexible, consistent and reliable, able to work under only minimal supervision and willing to work with multiple staff.For more information about JEI Learning, please visit our website at http://sandiego.jeilearning.comThank You -- we look forward to hearing from you!Job Type: Part-timeExperience:tutoring: 1 year (Preferred)"}, {"title": "$30/hr Anatomy Tutor Needed", "company": "Titan Tutors", "location": "Laguna Niguel, CA", "job url": "Not Available", "description": "$30 an hourPart-timeTitan Tutors is a in home-online tutor matching service. Our goal is to develop a network of tutors that feel valued in pay and time. Connecting great people to help with students that struggle is an exciting opportunity. However, we know the value of our Tutors and we focus on making sure this part-time position is easy, convenient and stress free so that you can focus on your students!How it worksGet paid $30/hrGet paid the day you work!We match and create comfortable distance with competitive hourly payWhat we requireReliability and consistencyResponsibleBe able to travelEnjoy helping studentsJob Type: Part-timeSalary: $30.00 /hourEducation:High school or equivalent (Preferred)Location:Laguna Niguel, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "Tutor/Literacy Specialist", "company": "Jodie K. Schuller &amp; Associates", "location": "San Diego, CA", "job url": "Not Available", "description": "$17 an hourPart-timeImmediate opening for TUTOR/LITERACY SPECIALIST for children and adults with reading/writing challenges. BA or BS and experience with children required; teaching credentials preferred. Must have excellent speaking and writing skills and be available for bi-monthly training meetings on Tuesday or Wednesday mornings. Must commit to working for a minimum of 2 years to keep stability for the kids. Tutor must also be somewhat flexible with hours and be willing to work Saturdays and evenings until 7pm. Close proximity to work is also preferred.\n\nPart time with salary base of $17/hour; $10.50 for administrative assistant & training. Start at 10 hours a week and grow to 20 hours by summer. This is a professional environment where professional attire is required.\nHow to Apply\nEmail your cover letter and resume to Jodie K. Schuller & Associates (jodie@therapiesforsuccess.com) or fax them to (858) 509-1151."}, {"title": "Math Tutor / Coach", "company": "Mathcodes", "location": "Washington, DC", "job url": "Not Available", "description": "$65 - $100 an hourPart-timeAs a result of growing demand, I am hiring a new team of Math Coaches to serve a wider market of students across various time zones.In our expanding but unregulated tutoring industry, there is a range of tutor competence and a disparity of compensation. Tutors are often undervalued or untrained and can offer unpredictable services, either independently or for companies who will profit heavily on their skill-sets.My commitment is to share my teaching process and my system of student/parent management developed over 17 years of working privately with hundreds of struggling math students. The approach is proven and effective. It will increase your value, improve your results and define you as a Math Coach not a tutor.Our clients view Math Coaches as a valuable investment, not a last-minute expense and their motivation and commitment ensure a predictable, consistent income at rates much higher than average.I look forward to training a new wave of Math Coaches so you can work with us, perform at the highest level, and be justly rewarded.If you are skilled at math, have a growing mindset and a desire to transform the lives of struggling math students I would like to get to know you.Candidates may reside in time zones across North America.Please complete the questionnaire at this link (cut and paste if necessary)Link : https://www.mathcodes.com/p/mathcoach-applicationKohilawww.mathcodes.comJob Type: Part-timeSalary: $65.00 to $100.00 /hour"}, {"title": "Online Math Tutor", "company": "Cambridge Network", "location": "Work at Home", "job url": "https://www.indeed.com/rc/clk?jk=9abad1bb121ae10e&from=vj&pos=top", "description": "ContractDesired: CalculusAre you looking for fun and rewarding work? We are searching for passionate and talented Online Tutors to assist our students in Math! Become a tutor today! Cambridge Network provides our tutors excellent support, flexible hours that fits your schedule, and great pay. Become part of our team today!\nLearn more about us at www.cambridgenetwork.com\nSubjects: Pre-algebra, Algebra, Algebra II, Geometry, Trigonometry, Pre-Calculus, Calculus, Statistics\nResponsibilities include, but are not limited to:\nBuild rapport and relationships with students to encourage and motivate students\nDevelop appropriate lesson plans and goal setting\nConduct one-on-one or small group tutoring session\nAssist with homework and projects, and review work with the student to ensure advanced comprehension of school materials and prepare the student for any upcoming teaching content, tests, or quizzes\nTrack and analyze student progress, complete progress reports, and communicate with Tutoring Coordinator about student progress\nQualifications:\nBachelors degree and established high-level proficiency in subject matter\nExcellent interpersonal and communication skills\nFamiliarity with American middle and high school curricula\nPassionate about education and cultural diversity\nPass a background check and eligible to work in the US"}, {"title": "Reading tutor", "company": "A+ IN HOME TUTORS", "location": "Yuba City, CA", "job url": "Not Available", "description": "$30 an hourPart-timeWe need an experienced Reading tutor for an 8 year old student.To begin immediately and throughout the school year. Some daytime availability preferred.Our ideal Tutor versed in one or more of the following:Bachelors degree or above1-2 years experience teaching/tutoring students with positive and engaging styleSkilled tutoring to include core curriculum subjects, content and test prepAbility to simplify concepts, support positive study habits and organization for studentsTutoring will be in the students home 1-3 hours per week.Pay is $30.00 per hourIf available, please send resume and call Carla (415) 755-8203Job Type: Part-timeSalary: $30.00 /hourExperience:tutoring or teaching: 2 years (Required)Education:Bachelor's (Required)Location:Yuba City, CA (Preferred)License:Driver's License (Required)Language:English (Required)"}, {"title": "Online Tutor (K-12 Grade Levels)", "company": "GoLearner Tutoring Academy", "location": "Atlanta, GA", "job url": "Not Available", "description": "$19 - $22 an hourPart-time, ContractWork from home with one of the fastest growing online tutoring organizations in the US!GoLearner is an online tutoring community that fosters a strength-based learning environment to middle and high school students. We use specialized aptitude testing and behavioral personality assessments to create a customized educational journey.Join our network of tutors and teachers who enjoy providing students the tools necessary to pursue their unique interests and talents as they develop desired expertise for the modern age.Eligible CandidatesQualified ESL TeachersLicensed School TeachersUniversity GraduatesPay: Between $19/hr - $22/hrWork from home and set your own scheduleInstant technical support and world class teacher supportTeacher RequirementsCertificate in TEFL, TESOL, CELTA or any other relevant certificates is a plusBachelor's degree or above (or final year student)Relevant teaching experience is preferredNative in one of the following languages required (English, Spanish, French, German, Latin, Mandarin ChineseDesktop or Laptop with Fast Internet connection and audio/video capabilityJob Types: Full-time, Part-time, ContractSalary: $19.00 to $22.00 /hourExperience:SAT Test Administering: 1 year (Preferred)ACT Test Administering: 1 year (Preferred)ESL Training: 2 years (Preferred)Teaching: 1 year (Required)Education:Bachelor's (Required)License:Teaching Certificate (Preferred)Language:French (Preferred)Mandarin Chinese (Preferred)Latin (Preferred)English (Preferred)Spanish (Preferred)Work authorization:United States (Preferred)"}, {"title": "$20/hr Math Tutor Needed In Tustin", "company": "Titan Tutors", "location": "Tustin, CA", "job url": "Not Available", "description": "$20 an hourPart-timeTitan Tutors is a in home-online tutor matching service. Our goal is to develop a network of tutors that feel valued in pay and time. Connecting great people to help with students that struggle is an exciting opportunity. However, we know the value of our Tutors and we focus on making sure this part-time position is easy, convenient and stress free so that you can focus on your students!How it worksGet paid up to $20/hrGet paid the day you work!We match and create comfortable distance with competitive hourly payWhat we requireReliability and consistencyResponsibleBe able to travelEnjoy helping studentsJob Type: Part-timeSalary: $20.00 /hourExperience:teaching: 1 year (Preferred)Education:High school or equivalent (Preferred)Location:Tustin, CA (Preferred)Work authorization:United States (Preferred)"}, {"title": "Math Tutor", "company": "Wahupa Upward Bound", "location": "San Diego, CA 92103", "job url": "Not Available", "description": "$14 - $22 an hourPart-timeSchool sites:Lincoln High School, 4777 Imperial Avenue San Diego, CA 92113.Kearny High School, 7651 Wellington St San Diego, CA 92111Ofarrell High school, 6130 Skyline Dr San Diego,CA 92114Sweetwater High School, 2900 Highland Ave National City, CA 91950Castle Park High School, 1395 Hilltop Dr Chula Vista, CA 91911Availability needed: Tuesday (2:30  4:30 Lincoln High School, 3:30  5:30 Kearny High School. Wednesday: 1:00 to 2:30 OFarrell HS, 2:30  4:30 Sweetwater High School, Thursday 2:30  4:30 Lincoln High School, 3:00 to 5:00 Castle Park.With the possibility of additional hours (ex. Saturdays)Under the supervision of Wahupa Upward Bound, tutors will be responsible for providing academic support and assistance in high school level classes (especially Math & Science). Tutoring will be after school and you will be tutoring individually and small groups. There is a possibilities of additional hours at other sites during the week or on SaturdaysTutors should be punctual, have good attendance, be outgoing, understanding, patient, friendly, take initiative, self motivated, good communicators, and comfortable working with low-income and first generation college students.If hired, tutors will undergo a criminal background check and have to get a Tuberculosis Skin Test (TB test).Qualifications: Tutors should be currently enrolled college students or college graduates. In addition, should have the ability to follow oral and written directions and work independently.Hours and Compensation: Pay is $14-$22/hour. Tutors are paid biweeklyWe are seeking tutors who are assertive, outgoing, demonstrate understanding and encouragement when dealing with students who are struggling academically. A very strong grasp of high school math (Intermediate Algebra - AP Calculus) required, science (Chemistry & Physics) is preferredJob Type: Part-timeSalary: $14.00 to $22.00 /hourJob Type: Part-timeSalary: $14.00 to $22.00 /hourExperience:tutoring: 1 year (Preferred)"}, {"title": "STEM Tutor", "company": "Code Ninjas Poway", "location": "Poway, CA", "job url": "Not Available", "description": "$11.50 - $12.50 an hourPart-timeWe will be hiring 16 - 22 year-olds with experience/interest in coding, robotics, and STEM, to work in our 'dojo' as mentors and guides (Sensies) to our young ninjas (ages 7-14). If you would like to join our team of dynamic, energetic, forward-thinking minds, working toward our common goal: providing a fun and safe environment for children, we want to meet you.Our Senseis will oversee the day-to-day guidance of children as they work their way through our game building curriculum, gaining confidence as coders using our belt system (white to black belt) from Scratch to JavaScript to Unity 3D. Work in a field you love while developing experience that will enrich your college applications and future resumes.We will be open weekdays after school and on Saturdays and will begin hiring in January 2019.Do you like coding and game building?Are you experienced in working with children?Do you enjoy teaching and building problem-solving skills in young minds?Have you mentored youth?THIS COULD BE THE ROLE FOR YOU!Please send your resume.Thank you,Code Ninjas - PowayJob Type: Part-timeSalary: $11.50 to $12.50 /hourExperience:coding/computer programming: 1 year (Preferred)working with youth: 1 year (Preferred)Location:Poway, CA (Preferred)"}, {"title": "AVID Tutor", "company": "Calistoga Joint Unified School District", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=b22ca07664472107&from=vj&pos=top", "description": "$15 an hourPart-timeEmployer:\nCalistoga Joint Unified\nDate Posted:\n11/6/2018\nContact:\nMichael DeFrancesco\n707-312-1706\nNumber Openings: (At time of posting)\n3\nLength of Work Year:\nAs needed\nEmployment Type:\nPart Time\nApplication Deadline:\nUntil Filled\nSalary:\n$15/hour\n\nJob Description / Essential Elements:"}, {"title": "HomeworkCoach Tutor", "company": "HomeworkCoach", "location": "Mesa, AZ 85212", "job url": "https://www.indeed.com/rc/clk?jk=4e4fca5d2d28f968&from=vj&pos=top", "description": "$30 an hourHomeworkCoach Tutor - Mesa (85212) $30/hr\n\nBachelor's Degree"}, {"title": "Reading tutor", "company": "A+ IN HOME TUTORS", "location": "Yuba City, CA", "job url": "Not Available", "description": "$30 an hourPart-timeWe need an experienced Reading tutor for an 8 year old student.To begin immediately and throughout the school year. Some daytime availability preferred.Our ideal Tutor versed in one or more of the following:Bachelors degree or above1-2 years experience teaching/tutoring students with positive and engaging styleSkilled tutoring to include core curriculum subjects, content and test prepAbility to simplify concepts, support positive study habits and organization for studentsTutoring will be in the students home 1-3 hours per week.Pay is $30.00 per hourIf available, please send resume and call Carla (415) 755-8203Job Type: Part-timeSalary: $30.00 /hourExperience:tutoring or teaching: 2 years (Required)Education:Bachelor's (Required)Location:Yuba City, CA (Preferred)License:Driver's License (Required)Language:English (Required)"}, {"title": "Tutor", "company": "JEI Learning Center, Pleasanton, CA", "location": "Pleasanton, CA 94588", "job url": "Not Available", "description": "$15 - $35 an hourPart-timeJEI Learning Center, Pleasanton is looking for tutors for elementary and middleschoolers.English/WritingMathDebateHomework helpJob Type: Part-timeSalary: $15.00 to $35.00 /hourLocation:Pleasanton, CA 94588 (Preferred)"}, {"title": "Tutor", "company": "Streamline Tutors, LLC", "location": "Baltimore, MD", "job url": "Not Available", "description": "$25 - $40 an hourPart-time, ContractAre you good at math, science, grammar, and/or critical reading? Did you score really well on your standardized tests?Streamline Tutors is expanding! We are looking for part-time tutors for our Roland Park and Owings Mills locations. Interested parties should visit our website (streamlinetutors.com), scroll to the bottom of the page, and click \"Join Our Team\". There, they will find an application form to fill out. Additionally, resumes and transcripts should be sent to kristina at streamlinetutors.com.Minimum Commitment of 7.5 hours a weekMust be currently enrolled in or recently graduated from a top 20 College or UniversityMust have private transportationNo experience necessary - training will be extensive and providedAbility to tutor math and science subjects preferred (APs, honors, and general statistics, precalculus, algebra I-III, geometry, calculus, biology, physical science, physics, chemistry, anatomy, computer science, etc.).Qualified candidates will be punctual, organized, and detail-oriented. They will also have excellent communication skills.We also offer a bonus structure.Job Types: Part-time, ContractSalary: $25.00 to $40.00 /hourWork authorization:United States (Required)"}, {"title": "8th grade Algebra 1 Tutor Wanted in San Diego", "company": "Inspire In-Home Tutoring, Inc", "location": "San Diego, CA", "job url": "Not Available", "description": "$24 an hourPart-timeDesired: Teaching ExperienceDo you have a gift for helping people learn? Would you like to share your skills with our students? We are currently seeking an inspiring tutor to work with an 8th-grader in Algebra 1.Bachelors degree or higher and tutoring or teaching experience required. We are seeking highly reliable and dependable individuals who have a passion for helping others, and who enjoy working with students. You must live in or near the area. If this is you, we would love to hear from you! Please submit application for immediate consideration. Thank you!Job Type: Part-timeSalary: $24.00 /hourEducation:Bachelor's (Required)Location:San Diego, CA (Required)"}, {"title": "AVID Tutor", "company": "Cherry Creek School District", "location": "United States", "job url": "https://www.indeed.com/rc/clk?jk=e62d12d413e53b96&from=vj&pos=top", "description": "$195 a dayAVID Tutor\n\n\nJOB STATUS: OPEN\n\nPOSTING DATE: 11/19/2018\n\nCLOSING DATE: 02/01/2019 04:00 PM\n\nPOSTING NUMBER: L22482\n\nFACILITY: ISF\n\nPOSITION TITLE: AVID Tutor\n\n\nJOB DESCRIPTION:\n\nDevelop the academic and personal strength of AVID students using AVID strategies (WICR: writing, inquiry, collaboration, and reading).\n\nDUTIES AND RESPONSIBILITIES:\n\n1. Provide academic support for students in rigorous courses.\n2. Facilitate the tutorial learning process and implement AVID methodologies.\n3. Actively participate in collaborative groups and tutorials.\n4. Participate in motivational activities when possible.\n5. Become a master of each stage of the AVID tutorial and inquiry learning process.\n6. Act as a role model and mentor.\n7. Adhere to district/site policies and procedures.\n8. Arrive on time and prepared for class.\n9. Performs other related duties as assigned or requested.\n\nEXPERIENCE:\n\n1. Previous AVID student is preferred\n2. Strong Math and Science skills\n\nJOB QUALIFICATIONS:\n\n1. High school graduate\n2. Good communication skills\n3. Positive and professional demeanor\n4. Is able to do assessment and grading\n5. Is able to do comparing and computing\n6. Has flexible availability\n\nOTHER INFO:\n\nDays and hours vary\nSome schedules rotate\n\n\nAPPLY TO:\n\n\nEMPLOYEE GROUP: Hourly\n\nSALARY: $12.00 minimum per hour\n\nDAYS: 195\n\nSTART DATE: December 2018"}, {"title": "Part-time Spanish Tutor", "company": "Tutoring Services", "location": "Home Based", "job url": "https://www.indeed.com/rc/clk?jk=59d8aca36f47916b&from=vj&pos=top", "description": "Part-timeCompany Summary:\n\nAt Pearson, were committed to a world thats always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always reexamining the way people learn best, whether its one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technologyand each other to surpass these boundarieswe create seeds of learning that become the catalyst for the worlds innovations, personal and global, large and small.\n\nPearsons Online & Blended Learning K-12 group provides high-quality, highly accountable online education solutions to schools, school districts and students in grades K-12. It serves families and schools with a variety of digital learning and online school solutions including Connections Academy, International Connections Academy, and Pearson Connexus, delivering online learning to over 400,000 students in the U.S. and 48 countries. The group, also known as Connections Education, is based in Columbia, Maryland and has been named a Top Workplace by the Baltimore Sun for three consecutive years and a Best Place to Work by Baltimore magazine. Recognized for its outstanding curriculum, high-quality teachers and leadership, Pearson Online & Blended Learning is committed to expanding quality education through technology, and helping students achieve both academic and personal success.\n\nPosition Summary:\n\nWorking out of their home, the World Language Live Tutor will virtually manage a synchronous virtual classroom utilized by students from Pearson and Connections Academy schools. The World Language Live Tutor will be responsible for working with students to develop understanding of the Spanish language using specifically designed activities. World Language Live Tutors will be responsible for monitoring student activity within the virtual classroom at all times, and providing support/feedback.\n\nThis part-time position is for the 2018-2019 school year and is a 10-month position. Tutors availability should be flexible and may work up to five (5) days per week, Monday- Friday; for 3 or more hours per day and for a minimal of 15 hours per week.\n\nPossible shifts would fall within the following time frames: Monday through Thursday 3:00 pm. - 11:00 p.m. EST and Friday 1:00 pm. - 4:00 p.m. EST. Tutors will be working with students in the Elementary, Middle School and High School levels.\n\nPrimary Responsibilities:\n\nCommunicate with students through the use of LiveLesson\nMonitor students language proficiency and vocabulary recognition throughout tutoring sessions\nGeneral Responsibilities:\n\nWorking in the LiveLesson room, facilitate student completion of a series of pronunciation and vocabulary activities;\nMonitor student language proficiency while in tutoring sessions;\nProvide students with grade and feedback reflective of student progress;\nAssist students with minor technical issues;\nWork with Program Manager and tutors to develop consistency within LiveLessons; and\nOther duties as assigned.\nPearson Online and Blended Learning is focused on providing a flexible work environment to its employees, including the ability to work from home on a regular basis in most positions. We believe that flexibility in work/life balance is a critical part of our culture and employee satisfaction, and we are proud to provide to our employees the ability to work from anywhere, anytime. In exchange, we require that employees have the appropriate means to work remotely, including adherence to our work at home policies regarding home office setup, including but not limited to privacy of records, technology standards, equipment standards and expectations.\n\nThe following equipment will need to be provided by you, as the employee, when working from home:\n\nLaptop or desktop;\nHigh Speed Internet Access;\nHeadset or internal speaker and microphone installed in computer;\nMouse (required); and\nKeyboard (required).\nCapabilities:\n\nCustomer Centric  Acts with a strong customer mindset (both internal and external) and is a visible advocate for the customer. Builds strong relationships with customers and uses those to improve their experience and outcomes.\nCommunications - A great communicator who works well in teams and with students in one-on-one to small group environment.\nWorks well in a matrix - Demonstrates collaboration, problem solving skills, and is able to work under pressure.\nTakes personal responsibility  Can be relied on to complete tasks timely and well, demonstrates ownership regardless of the outcome, proactive in exploring and exploiting new opportunities.\nBehaviors:\n\nHigh level of integrity and transparency;\nHigh degree of flexibility;\nCustomer focused approach;Positive attitude;\nEvidence of a strong work ethic; and\nDemonstrated team player.\nK-12 Teaching experience preferred;\nMust be able to speak (standardized accent required), read and write Spanish fluently;\nExperience with online instruction is a plus;\nPrior experience as tutor is a plus;\nStrong technology skills (especially with Microsoft OS, MS Office and Google Suite);\nExcellent communication skills, both oral and written; and\nDemonstrated ability to work well in fast paced environment."}, {"title": "Male HomeworkCoach/Tutor", "company": "HomeworkCoach", "location": "Santa Ana, CA 92705", "job url": "https://www.indeed.com/rc/clk?jk=a4c8c9ea7ff65153&from=vj&pos=top", "description": "$30 - $35 an hourMale HomeworkCoach/Tutor - Santa Ana $30 - $35/hr\n\nBachelor's Degree"}, {"title": "Tutor students", "company": "HT Learning Center", "location": "Fountain Valley, CA", "job url": "Not Available", "description": "$17.50 - $25.00 an hourPart-timeAfterschool Tutoring Center for K-12th grade at our Centers in Westminster, Garden Grove or Fountain Valley - We open 7 days per week. No travel to students' homes.We are looking for math tutors, specifically for Pre-calculus and CalculusHours are usually after school around 3:25-5:25 pm or 5:30-7:30 pm. You can choose the number of hours or days you want to work.Subject: Math, English, Science. We also need instructors for SAT/ACT test prep.We are looking to hire 5 more tutors for our tutoring company, established over 12 years. (B.A. degree and up).Compensation depends on experience and background.Please send resume (embedded in email, as well as attachment). Include your cell phone number and/or email that you can be reached at.In the subject heading please write the subject and grades you prefer to teach, i.e. Biology, Geometry, Algebra, Chemistry, HS English, etc.We will respond to applicants to schedule an interview. If we do not respond soon you can follow up to check the status, as well as your Spam Box.We are only interested in serious applicants.When we respond to your email, you will have our company website, phone number and address so you can contact us for questions.Thank you for your interest in working with us.Job Type: Part-timeSalary: $17.50 to $25.00 /hourExperience:tutoring: 1 year (Preferred)"}, {"title": "Homework coach/tutor, Dallas, Part-time $30/hr", "company": "HomeworkCoach", "location": "Dallas, TX 75225", "job url": "https://www.indeed.com/rc/clk?jk=82cfefd46dffe9e1&from=vj&pos=top", "description": "$30 an hourPart-time4-yr college degree preferred"}, {"title": "Private Math Tutor", "company": "Hawk Educational Solutions", "location": "San Diego, CA", "job url": "Not Available", "description": "$22 - $27 an hourContractSeeking a private math tutor to provide instruction for K-12 students in homes and at local libraries. Candidates must demonstrate proficiency in Integrated Math, Geometry, Algebra Trig and Calculus. Candidates will possess a BA in math or related field, a valid driver's license and at least one year of teaching or tutoring experience.Job Type: ContractSalary: $22.00 to $27.00 /hourExperience:tutoring: 1 year (Required)Education:Bachelor's (Required)"}, {"title": "ESL Conversational English Tutor", "company": "Woor Tutor", "location": "Cupertino, CA", "job url": "Not Available", "description": "$30 an hourPart-time, ContractConversational English tutors needed for Woor Tutor (www.wooritutor.com), to work one-on-one with Korean students.Tutors will be responsible for helping Korean students with conversational English, reading and writing.Since there is a large Korean population and high demand for English tutors in Cupertino and San Jose area we can connect students with tutors ASAP.Our tutors work between 6 and 20 hours per week. It varies based on tutor's availability.Please email a resume if you are interested.Please tell us what your availability is. (time, days)Compensation: $30/hrQualifications: Fluent English speakers.BA degree in related fields (English, Education, etc) or TESL certificates preferred but not required.ESL teaching experience preferred, but not required.Good conversation partner and good listener.Strong work ethics and professional attitude.Experience teaching kids preferred, but not requiredJob Types: Part-time, ContractLocation:Cupertino, CA (Preferred)"}, {"title": "Typing Tutor", "company": "2utors2you", "location": "Porter Ranch, CA", "job url": "Not Available", "description": "Part-timeDesired: Teaching ExperienceTeach students in grades K-12 how to type on a computer. Looking for tutors who have their own computer to bring with them for tutoring sessions. For this position we are looking for tutors who are specialized in Autism.Job Type: Part-timeExperience:teaching: 1 year (Preferred)"}, {"title": "Tutor", "company": "Academy Of Music and Fine Arts (AMFA)", "location": "North Hollywood, CA", "job url": "Not Available", "description": "$18 an hourPart-timeAcademy of Music and Fine Arts (est. 1999) is looking for Tutors that can help our student with improving overall knowledge and grades in most K-12 disciplines, as well as preparing students for classroom and nationwide tests. Especially in demand are Math, Science, Chemistry / Bio and English subjects.The schedule is flexible and starts generally after 3:30 PM. We do our best to adjust to the Instructor's schedule. Local candidates are preferable. Pay is negotiable and starts at $18 / hour.For information about other classes we offer, contact us at 818 760 3185. Resume and some experience is a must and should pertain only to this specific subject.Job Type: Part-timeLocation:North Hollywood, CA (Preferred)"}, {"title": "Tutor Wanted \\xe2\\x80\\x93 6h-grade Reading/Writing in Colton", "company": "Inspire In-Home Tutoring, Inc", "location": "Colton, CA", "job url": "Not Available", "description": "$24 an hourPart-timeDesired: Teaching ExperienceDo you have a gift for helping people learn? Would you like to share your skills with our students? Inspire In-Home Tutoring, Inc. is currently seeking a great tutor to work with a 6th-grader in Reading/Writing, in Colton.Bachelors degree or higher and tutoring or teaching experience required. We are seeking highly reliable and dependable individuals who have a passion for helping others, and who enjoy working with students. You must live in or near the area. If this description fits you, we would love to hear from you! Please apply now for immediate consideration. Thank you!Job Type: Part-timeSalary: $24.00 /hourEducation:Bachelor's (Required)Location:Colton, CA (Preferred)"}, {"title": "Male HomeworkCoach/Tutor", "company": "HomeworkCoach", "location": "Santa Ana, CA 92705", "job url": "https://www.indeed.com/rc/clk?jk=a4c8c9ea7ff65153&from=vj&pos=top", "description": "$30 - $35 an hourMale HomeworkCoach/Tutor - Santa Ana $30 - $35/hr\n\nBachelor's Degree"}, {"title": "Math Tutor / Coach Oppportunity", "company": "Mathcodes", "location": "Fresno, CA", "job url": "Not Available", "description": "$65 - $100 an hourPart-timeAs a result of growing demand, I am hiring a new team of Math Coaches to serve a wider market of students across various time zones.In our expanding but unregulated tutoring industry, there is a range of tutor competence and a disparity of compensation. Tutors are often undervalued or untrained and can offer unpredictable services, either independently or for companies who will profit heavily on their skill-sets.My commitment is to share my teaching process and my system of student/parent management developed over 17 years of working privately with hundreds of struggling math students. The approach is proven and effective. It will increase your value, improve your results and define you as a Math Coach not a tutor.Our clients view Math Coaches as a valuable investment, not a last-minute expense and their motivation and commitment ensure a predictable, consistent income at rates much higher than average.I look forward to training a new wave of Math Coaches so you can work with us, perform at the highest level, and be justly rewarded.If you are skilled at math, have a growing mindset and a desire to transform the lives of struggling math students I would like to get to know you.Candidates may reside in time zones across North America.Please complete the questionnaire at this link (cut and paste if necessary)Link : https://www.mathcodes.com/p/mathcoach-applicationKohilawww.mathcodes.comJob Type: Part-timeSalary: $65.00 to $100.00 /hour"}, {"title": "Reading Tutor", "company": "Syllables Learning Center", "location": "Alpharetta, GA", "job url": "Not Available", "description": "$15,600 - $23,400 a yearPart-timeSyllables Learning Center, is looking for part time staff members for their Alpharetta and Atlanta offices. Syllables helps students overcome learning differences including dyslexia, ADD/ADHD, and working memory deficits in a one-on-one environment.Extensive training is provided. Summer hours are 8:30 a.m.  6:30 p.m. Monday through Thursday. School year hours are 2:30 p.m.  6:30 p.m. Monday  Thursday and Saturday mornings.If you have an interest in helping children learn, and are positive, outgoing, and articulate, please apply. Locations in Atlanta, Alpharetta and East Cobb.Responsibilities include:Completion of Syllables training instruction (provided to all new hires)One-on-one reading instruction with students age 5 and upDirect communication with parents about student tasks during tutoring sessionsFollow-up reporting on student progressEqual opportunity employer. Must pass a background check. No previous tutoring experience required. Minimum bachelors degree needed, or nearing completion of degree.Syllables Learning Center offers rewarding work and competitive pay in a friendly environment! Learn more about us: www.SyllablesLearningCenter.com.Job Type: Part-timeSalary: $15,600.00 to $23,400.00 /yearJob Type: Part-timeEducation:Bachelor's (Required)"}, {"title": "Math Coach / Tutor Opportunity", "company": "Mathcodes", "location": "Arlington, TX", "job url": "Not Available", "description": "$65 - $100 an hourPart-timeAs a result of growing demand, I am hiring a new team of Math Coaches to serve a wider market of students across various time zones.In our expanding but unregulated tutoring industry, there is a range of tutor competence and a disparity of compensation. Tutors are often undervalued or untrained and can offer unpredictable services, either independently or for companies who will profit heavily on their skill-sets.My commitment is to share my teaching process and my system of student/parent management developed over 17 years of working privately with hundreds of struggling math students. The approach is proven and effective. It will increase your value, improve your results and define you as a Math Coach not a tutor.Our clients view Math Coaches as a valuable investment, not a last-minute expense and their motivation and commitment ensure a predictable, consistent income at rates much higher than average.I look forward to training a new wave of Math Coaches so you can work with us, perform at the highest level, and be justly rewarded.If you are skilled at math, have a growing mindset and a desire to transform the lives of struggling math students I would like to get to know you.Candidates may reside in time zones across North America.Please complete the questionnaire at this link (cut and paste if necessary)Link : https://www.mathcodes.com/p/mathcoach-applicationKohilawww.mathcodes.comJob Type: Part-timeSalary: $65.00 to $100.00 /hour"}, {"title": "Spanish Tutor", "company": "2utors2you", "location": "Porter Ranch, CA", "job url": "Not Available", "description": "Part-timeDesired: Teaching ExperienceTutor students in grades K-12 in beginner's Spanish. Teach students how to read, write, & speak the language. Looking for experienced tutors only.Job Type: Part-timeExperience:teaching: 1 year (Preferred)"}, {"title": "Tutor", "company": "Christian Resource Network Inc", "location": "Boston, MA", "job url": "Not Available", "description": "$15 an hourPart-timeThe person will be tutoring a special needs adult in the area of art, basic math and English for 2 to 3 hours per week. The person selected should be patient and have experience working with this population.Job Type: Part-timeSalary: $15.00 /hourExperience:special-needs: 1 year (Preferred)Education:Associate (Preferred)Location:Boston, MA (Preferred)Language:English (Preferred)Work authorization:United States (Preferred)"}, {"title": "Private Tutor", "company": "Tutor Me LA", "location": "San Francisco Bay Area, CA", "job url": "Not Available", "description": "$20 - $65 an hourPart-timePrivate Tutor Needed To Start ASAP - In the Bay AreaIn-Home Tutoring & Test-Prep- Create your own schedule and hours. No Minimum Required.- Only work with students you approve.- Same-day interview!$20-$65/hrIf you are interested, please message us with your CV and preferred email.(For a faster response, please apply on our website under \"tutor jobs\")Job Type: Part-timeSalary: $20.00 to $65.00 /hourExperience:tutor: 1 year (Preferred)"}, {"title": "Academic Tutor", "company": "A Plus Success Tutoring", "location": "Washington, DC", "job url": "Not Available", "description": "$20 - $24 an hourPart-timeA Plus Success is a tutoring and academic enrichment provider in DC and Maryland. We are currently seeking a Tygiaya language speaking tutor. This tutor will provide non-classroom instruction to our students on an individual bases at their house, library or school.Responsibilities: - Tutor will manage and educate students in a non-classroom setting- Tutor will follow lesson plans at varying academic levels using materials provided- Tutor will follow academic goals and milestones with students- Tutor will document and communicate progress reportsJob Type: Part-timeSalary: $20.00 to $24.00 /hourEducation:Bachelor's (Required)Language:Tygiaya (Required)"}, {"title": "ESL English Tutor", "company": "Woori Tutor", "location": "Sunnyvale, CA", "job url": "Not Available", "description": "$30 an hourPart-time, ContractDesired: Teaching ExperienceConversational English tutors needed for Woori Tutor (www.wooritutor.com), to work one-on-one with Korean students.Tutors will be responsible for helping Korean students with conversational English, reading and writing.Since there is a large Korean population and high demand for English tutors in Sunnyvale and San Jose we can connect students with tutors ASAP.Our tutors work between 6 and 20 hours per week. It varies based on tutor's availability.Please email a resume if you are interested.Please tell us what your availability is. (time, days)Compensation: $30/hrQualifications: Fluent English speakers.BA degree in related fields (English, Education, etc) or TESL certificates preferred but not required.ESL teaching experience preferred, but not required.Good conversation partner and good listener.Strong work ethics and professional attitude.Experience teaching kids preferred, but not requiredJob Types: Part-time, ContractSalary: $30.00 /hourLocation:Sunnyvale, CA (Preferred)"}, {"title": "Tutor", "company": "EMA Tutoring and Testing Center", "location": "Laguna Hills, CA", "job url": "Not Available", "description": "$25 - $65 an hourPart-time, TemporaryWe are looking for individuals who can tutor core school subjects for grades ranging K-12.Expectations:Possess a strong subject matter knowledge in one or more subject area.Be able to clearly articulate main points in an engaging way and break complex concepts down into simple ideas.Reliability and punctuality.Experience:One-on-one and or small group tutoringEducation:Bachelors Degree or higher but current college students are welcome to apply.Job Types: Full-time, Part-time, TemporarySalary: $25.00 to $65.00 /hourExperience:Teaching or Tutoring: 1 year (Preferred)Education:High school or equivalent (Preferred)Location:Laguna Hills, CA (Preferred)Shifts:Graveyard (Preferred)"}, {"title": "Academic Tutor", "company": "A Plus Success Tutoring", "location": "Washington, DC", "job url": "Not Available", "description": "$20 - $24 an hourPart-timeA Plus Success is a tutoring and academic enrichment provider in DC and Maryland. We are currently seeking a Tygiaya language speaking tutor. This tutor will provide non-classroom instruction to our students on an individual bases at their house, library or school.Responsibilities: - Tutor will manage and educate students in a non-classroom setting- Tutor will follow lesson plans at varying academic levels using materials provided- Tutor will follow academic goals and milestones with students- Tutor will document and communicate progress reportsJob Type: Part-timeSalary: $20.00 to $24.00 /hourEducation:Bachelor's (Required)Language:Tygiaya (Required)"}, {"title": "AVID Tutor", "company": "Oxnard School District", "location": "Oxnard, CA", "job url": "https://www.indeed.com/rc/clk?jk=dc761606328b5ef2&from=vj&pos=top", "description": "$12.27 an hourPart-timePositions are typically 2 - 4 hours per day and are open to current college/university students only.\n\nApplicants must attach a copy of their college transcripts indicating that they are a current student in order to be considered.\n\nPLEASE NOTE: Applying more than once does not increase your chances of being contacted.\n\nTutors may be needed for the following schools (hours will vary by school):\nChavez, 301 North Marquita Street, Oxnard, CA 93030\nCurren, 1101 North F Street, Oxnard, CA 93030\nDriffill, 910 South E Street, Oxnard, CA 93030\nFrank, 701 North Juanita Ave., Oxnard, CA 93030\nFremont, 1130 North M Street, Oxnard, CA 93030\nHaydock, 647 West Hill Street, Oxnard, CA 93033\nKamala, 634 West Kamala Street, Oxnard, CA 93033\nLemonwood, 2200 Carnegie Street, Oxnard, CA 93033\nSoria, 3101 Dunkirk Drive Oxnard, CA 93035\n\nPlease note: Qualified applicants will only be contacted when a request is received from a school for AVID tutoring services.\n\nUnder direct supervision of the Principal and AVID Coordinator and with the assistance of the AVID elective teacher, performs tasks in the tutoring and mentoring of students in the AVID program.\n Examples of Duties:\nTake an active role in developing the academic and personal strengths of AVID students.\nServe as a role model/mentor to AVID students by being a lifelong learner, demonstrating appropriate academic and social behaviors, and wearing appropriate attire at all times.\nDetermine from student's notes and discussions, the concepts that need to be reinforced.\nAssist the classroom teacher in reviewing student binders, including calendars, class and textbook notes, etc.\nBecome familiar with the materials in the AVID Curriculum Libraries.\nBecome familiar with the textbooks and materials used by AVID students.\nConduct tutorial sessions.\nFacilitate mini-lessons in the process of writing in all subject areas, study skills, and other aspects of college preparation.\nSet an example of personal excellence and high expectations for AVID students to follow.\nWork with students in any phase of the writing process, such as brainstorming, clustering, revision, and editing.\nCommunicate frequently and honestly with the AVID coordinator/teacher regarding student progress and areas of concern.\n \nEmployment Standards: Qualifications:\n\nGraduation from High School or equivalency\nCurrently enrolled in a college or university program"}, {"title": "Math Tutor / Coach Oppportunity", "company": "Mathcodes", "location": "Fresno, CA", "job url": "Not Available", "description": "$65 - $100 an hourPart-timeAs a result of growing demand, I am hiring a new team of Math Coaches to serve a wider market of students across various time zones.In our expanding but unregulated tutoring industry, there is a range of tutor competence and a disparity of compensation. Tutors are often undervalued or untrained and can offer unpredictable services, either independently or for companies who will profit heavily on their skill-sets.My commitment is to share my teaching process and my system of student/parent management developed over 17 years of working privately with hundreds of struggling math students. The approach is proven and effective. It will increase your value, improve your results and define you as a Math Coach not a tutor.Our clients view Math Coaches as a valuable investment, not a last-minute expense and their motivation and commitment ensure a predictable, consistent income at rates much higher than average.I look forward to training a new wave of Math Coaches so you can work with us, perform at the highest level, and be justly rewarded.If you are skilled at math, have a growing mindset and a desire to transform the lives of struggling math students I would like to get to know you.Candidates may reside in time zones across North America.Please complete the questionnaire at this link (cut and paste if necessary)Link : https://www.mathcodes.com/p/mathcoach-applicationKohilawww.mathcodes.comJob Type: Part-timeSalary: $65.00 to $100.00 /hour"}, {"title": "Private Biology Tutor", "company": "Spark Tutors", "location": "San Diego, CA", "job url": "Not Available", "description": "$30 - $40 an hourContractSpark Tutors is looking for biology tutors to join our team!Applicants MUST:- have a bachelor's or master's in a related field.- have knowledge of the high school biology curriculum- have experience tutoring/teaching children of all ages.- have solid communication and organizational skills.- be available afternoons and evenings.- enjoy tutoring and helping students learn.Responsibilities:- assist students with homework completion, studying for tests.- provide notes and question sets.- prepare students for exams.Please sent cover letter and resume, as well as references.Job Type: ContractSalary: $30.00 to $40.00 /hourExperience:tutoring: 2 years (Preferred)"}, {"title": "English Tutor", "company": "North Carolina Public Schools", "location": "Bolivia, NC 28422", "job url": "https://www.indeed.com/rc/clk?jk=51a5508fc368b200&from=vj&pos=top", "description": "English Tutor\n\n\nDistrict Name\nBrunswick County Schools\nSite/Department Name\nWest Brunswick High\n550 Whiteville Road NW, Shallotte, North Carolina, 28470\nPosted on\nNov 16, 2018,12:01 AM EST\nExpiration Date\nUntil Filled\nJob Description\nEnglish Tutor - Hourly\nVacancy availability: November 19, 2018 - May 30, 2019\nFor more information concerning this position, please contact Jonathan Paschal at 910-754-4338 or jpaschal@bcswan.net\n\n\nJob Qualification\nMust have completed at least two years (48 semester hours) of study at an institution of higher education, or obtained an associates (or higher) degree.\nTwo (2) - Three (3) years of experience in a classroom setting."}, {"title": "Biology Tutor", "company": "A+ IN HOME TUTORS", "location": "San Diego, CA", "job url": "Not Available", "description": "$30 an hourPart-timeA+ In Home Tutors is hiring!Seeking an AP Biology Tutor for weekend tutoringIdeal candidate:Bachelor's degree or aboveStrong in AP BiologyAble to simplify concepts and offer study skills to studentPay is $30 per hour1-2 hours per week (weekend tutoring) at student's home (Imperial Beach area)Send resume and brief cover letterJob Type: Part-timeSalary: $30.00 /hourExperience:teaching or tutoring: 1 year (Required)Education:Bachelor's (Required)License:Driver's License (Preferred)Work authorization:United States (Required)"}, {"title": "ESL Tutor Remote", "company": "Peony Investments", "location": "Carmel, IN", "job url": "Not Available", "description": "$14 - $22 an hourPart-time, ContractWe are recruiting for the following job opening:Vipkid ESL Teacher - Online - Part-timeWork RemotelyFlexible ScheduleNo Lesson PlanningNo parent interactionPay up to $22/hourNo minimum teaching requirement25 minutes of active teaching with 5 minutes of notes6 month contract, renewableClass Size - 1 studentVIPKid is the leading global online K-12 education leader and #1 Company for Remote Jobs. Weve created a live, one-on-one online learning platform that matches motivated kids studying English in China with inspiring teachers. Also rated in Fast Companys Top 50 Most Innovative Company in the World, we work with educational partners like ETS, TESOL and National Geographic Learning to develop the best curriculum and cutting-edge platform.Mission: To inspire and empower every child for the future. Our founders worked as both educators and administrators for decades prior to founding VIPKid. Weve taken those experiences  as well as our passion for motivating and engaging young learners - with us to our work at VIPKid. We aim to provide a truly global education  and with teachers and students all over the world, we're able to deliver exactly that.Peak Working Hours - Eastern Time ZoneWeekdays 6AM-9AMWeekends 6AM-9AMWeekends 9PM-12AMWeekends 12AM-3AMQualificationsDegree Required - Bachelor's Degree or higherAccent Required - North AmericanTeacher Country of Citizenship Required - USA or CanadaTEFL / TESOL Certificate Required - NoTeaching Experience Required - 1 or more yearsType of Teaching Experience Allowed - Teacher, Tutor, Homeschooling, Coaching, Mentoring, Volunteering with kidsDevice Requirements-Desktop, Laptop, MAC, SurfaceCamera HD External camera or HD integrated cameraHeadset - Use a headset with a microphone, stable output and inputOperating System - Windows7, Windows8, Windows10,MAC OS 10.8xNetwork - Internet Connection  at least 20 Mbps DownloadPayBase salary ($14-$18/hour) plus incentives will bring your pay between $14-22 per hour. Your result of your demo interview will determine your base pay (negotiable as well). Most teachers earn between $17-21 per hour.The InterviewThe interview happens on our portal at t.vipkid.com.cn. After you book an interview, on the day of your interview, you can enter the classroom one hour before the interview to test your equipment before it starts. Make sure you test your equipment beforehand, as we are also evaluating your equipment to see if your internet connection is able to maintain a 30-min smooth connection with a server in China.There are two methods to interview with us. You can: Book an interview: Pick a time slot from the calendar shown on the interview page. Join us for a 30-min session where you showcase your teaching skills to a VIPKID recruiter.Record an interview: Record your demo lesson on your own time so that a VIPKID recruiter can evaluate you. Instructions on how to record your interview can be found on the interview page.What are must-dos to be successful at the VIPKID interview?Practice the demo lesson PPTs.Take a look at our Applicant Performance Indicators so you know what we are looking for in candidates.Teach from a place with good background and lightingGood Internet connection.We look forward to receiving your application.Job Type: Part-timeSalary: $14.00 to $22.00 /hourExperience:mentor/teaching/tutoring/coaching/babysitting: 1 year (Required)Education:Bachelor's (Required)"}, {"title": "SAT/ACT English Tutor", "company": "Huntington Learning Center", "location": "Del Mar, CA 92014", "job url": "Not Available", "description": "Part-timeAs a leader in the tutoring and test prep industry, our success is attributed not only to our highly acclaimed instructional programs, but to the amazing teams of qualified and devoted professionals who commit themselves to helping students achieve success in school every day.Requirements and qualifications include: 4-year degree requiredSAT/ACT scoreOutstanding communication skillsEnthusiastic, outgoing and team-oriented personalityMust demonstrate care and compassion towards childrenMotivated to take the initiative to ensure that a students time at Huntington is memorableJob Function: Teach students SAT/ACT English using our curriculum in a one-to-one environmentAdditional Information: We provide training to teachersIf you have not taken SAT/ACT before, take the test at our center to qualifyEnglish language experts are welcome to applyStudents are instructed at our facilityFlexible afternoon, evening and weekend hours availableJob Type: Part-timeEducation:Bachelor's (Required)Work authorization:United States (Required)"}, {"title": "Tutor, Title I / Part-time / EOY / 2018-19", "company": "Charlotte-Mecklenburg Schools", "location": "Charlotte, NC", "job url": "https://www.indeed.com/rc/clk?jk=1708b87d61a7789a&from=vj&pos=top", "description": "$19.77 an hourPart-timePlease note: this position is 25 hours / $19.77 hourly pay rate  w/ part-time benefits"}, {"title": "SAT/ACT English Tutor", "company": "Huntington Learning Center", "location": "Del Mar, CA 92014", "job url": "Not Available", "description": "Part-timeAs a leader in the tutoring and test prep industry, our success is attributed not only to our highly acclaimed instructional programs, but to the amazing teams of qualified and devoted professionals who commit themselves to helping students achieve success in school every day.Requirements and qualifications include: 4-year degree requiredSAT/ACT scoreOutstanding communication skillsEnthusiastic, outgoing and team-oriented personalityMust demonstrate care and compassion towards childrenMotivated to take the initiative to ensure that a students time at Huntington is memorableJob Function: Teach students SAT/ACT English using our curriculum in a one-to-one environmentAdditional Information: We provide training to teachersIf you have not taken SAT/ACT before, take the test at our center to qualifyEnglish language experts are welcome to applyStudents are instructed at our facilityFlexible afternoon, evening and weekend hours availableJob Type: Part-timeEducation:Bachelor's (Required)Work authorization:United States (Required)"}, {"title": "Elementary Reading Tutor", "company": "A+ IN HOME TUTORS", "location": "Plumas Lake, CA", "job url": "Not Available", "description": "Part-timeWe need an experienced Reading tutor for an 8 year old student.To begin immediately and throughout the school year.Some daytime availability preferred.Our ideal Tutor versed in one or more of the following:Bachelors degree or above1-2 years experience teaching/tutoring students with positive and engaging styleSkilled tutoring to include core curriculum subjects, content and test prepAbility to simplify concepts, support positive study habits and organization for studentsTutoring will be in the students home 1-3 hours per week.Pay is $30.00 per hourIf available, please send resume and call Carla (415) 755-8203Job Type: Part-timeSalary: $30.00 /yearExperience:teaching or tutoring: 2 years (Required)Education:Bachelor's (Required)Location:Plumas Lake, CA (Preferred)License:Driver's License (Required)Language:English (Required)"}, {"title": "Special Education Tutor", "company": "GOODPartners", "location": "Washington, DC", "job url": "Not Available", "description": "$20 - $22 an hourPart-timeProvides research-based specialized instruction to address the instructional goals. goals outlined by parents/educational advocates, and objectives contained within each students IEP.Assesses student progress and determines the need for additional reinforcement or adjustments to instructional techniques.Employs various teaching techniques, methods and principles of learning to enable students to meet their IEP goals.Develops and implements annual Individualized Educational Program (IEP) plans for students to include: present levels of educational performance, special education needs, instructional goals and objectives, and the special education and related services required to meet those goals.Schedules team meetings and works cooperatively with child study team members and others in developing instructional goals and strategies.Coordinates the delivery of special education services in each student's IEP.Creates a positive learning experience with emphasis in individualized instruction usingappropriate sources including electronic devices and manipulationServes as primary contact for the parent.Conducts special education evaluations and reevaluations.Provides direction, supervision and evaluation of educational assistants as directed.Complies with policies and all state/federal rules and regulations.Completes all district reporting requirements.Job Type: Part-timeSalary: $20.00 to $22.00 /hourExperience:IEP Management: 1 year (Preferred)Special Education: 1 year (Required)Educator: 1 year (Preferred)Education:Bachelor's (Required)Location:Washington, DC (Preferred)License:Driver's License (Preferred)Work authorization:United States (Required)Shifts:Evening (Preferred)"}, {"title": "Private Biology Tutor", "company": "Spark Tutors", "location": "San Diego, CA", "job url": "Not Available", "description": "$30 - $40 an hourContractDesired: TutoringSpark Tutors is looking for biology tutors to join our team!Applicants MUST:- have a bachelor's or master's in a related field.- have knowledge of the high school biology curriculum- have experience tutoring/teaching children of all ages.- have solid communication and organizational skills.- be available afternoons and evenings.- enjoy tutoring and helping students learn.Responsibilities:- assist students with homework completion, studying for tests.- provide notes and question sets.- prepare students for exams.Please sent cover letter and resume, as well as references.Job Type: ContractSalary: $30.00 to $40.00 /hourExperience:tutoring: 2 years (Preferred)"}, {"title": "ESL Tutor", "company": "Parliament Tutors", "location": "Suffolk, VA", "job url": "Not Available", "description": "$30 an hourContractParliament Tutors is a full-service education management company specializing in traditional tutoring, test prep workshops, remediation programs, special education, language services and more. Clients include individuals/families, schools, non-profits, and government agencies.You can learn more about us at http://www.parliamenttutors.com.We are currently seeking a tutor for 11th grade ESL support, study skills in the Suffolk, Virginia 23434 area. The ideal candidates have tutoring and/or teaching experience and superior standardized test scores. Candidates must be able to pass a FULL BACKGROUND CHECK. Tutoring will take place at the students homes or at a mutually convenient library.Job Type: ContractSalary: $30.00 /hour"}, {"title": "Tutor", "company": "EMA Tutoring and Testing Center", "location": "Laguna Hills, CA", "job url": "Not Available", "description": "$25 - $65 an hourPart-time, TemporaryWe are looking for individuals who can tutor core school subjects for grades ranging K-12.Expectations:Possess a strong subject matter knowledge in one or more subject area.Be able to clearly articulate main points in an engaging way and break complex concepts down into simple ideas.Reliability and punctuality.Experience:One-on-one and or small group tutoringEducation:Bachelors Degree or higher but current college students are welcome to apply.Job Types: Full-time, Part-time, TemporarySalary: $25.00 to $65.00 /hourExperience:Teaching or Tutoring: 1 year (Preferred)Education:High school or equivalent (Preferred)Location:Laguna Hills, CA (Preferred)Shifts:Graveyard (Preferred)"}, {"title": "English Tutor", "company": "North Carolina Public Schools", "location": "Bolivia, NC 28422", "job url": "https://www.indeed.com/rc/clk?jk=51a5508fc368b200&from=vj&pos=top", "description": "English Tutor\n\n\nDistrict Name\nBrunswick County Schools\nSite/Department Name\nWest Brunswick High\n550 Whiteville Road NW, Shallotte, North Carolina, 28470\nPosted on\nNov 16, 2018,12:01 AM EST\nExpiration Date\nUntil Filled\nJob Description\nEnglish Tutor - Hourly\nVacancy availability: November 19, 2018 - May 30, 2019\nFor more information concerning this position, please contact Jonathan Paschal at 910-754-4338 or jpaschal@bcswan.net\n\n\nJob Qualification\nMust have completed at least two years (48 semester hours) of study at an institution of higher education, or obtained an associates (or higher) degree.\nTwo (2) - Three (3) years of experience in a classroom setting."}, {"title": "ESL English Tutor", "company": "Woori Tutor", "location": "Sunnyvale, CA", "job url": "Not Available", "description": "$30 an hourPart-time, ContractDesired: Teaching ExperienceConversational English tutors needed for Woori Tutor (www.wooritutor.com), to work one-on-one with Korean students.Tutors will be responsible for helping Korean students with conversational English, reading and writing.Since there is a large Korean population and high demand for English tutors in Sunnyvale and San Jose we can connect students with tutors ASAP.Our tutors work between 6 and 20 hours per week. It varies based on tutor's availability.Please email a resume if you are interested.Please tell us what your availability is. (time, days)Compensation: $30/hrQualifications: Fluent English speakers.BA degree in related fields (English, Education, etc) or TESL certificates preferred but not required.ESL teaching experience preferred, but not required.Good conversation partner and good listener.Strong work ethics and professional attitude.Experience teaching kids preferred, but not requiredJob Types: Part-time, ContractSalary: $30.00 /hourLocation:Sunnyvale, CA (Preferred)"}, {"title": "Online Tutor (K-12 Grade Levels)", "company": "GoLearner Tutoring Academy", "location": "Atlanta, GA", "job url": "Not Available", "description": "$19 - $22 an hourPart-time, ContractDesired: Teaching ExperienceESL CertificationTeaching CertificationBilingualWork from home with one of the fastest growing online tutoring organizations in the US!GoLearner is an online tutoring community that fosters a strength-based learning environment to middle and high school students. We use specialized aptitude testing and behavioral personality assessments to create a customized educational journey.Join our network of tutors and teachers who enjoy providing students the tools necessary to pursue their unique interests and talents as they develop desired expertise for the modern age.Eligible CandidatesQualified ESL TeachersLicensed School TeachersUniversity GraduatesPay: Between $19/hr - $22/hrWork from home and set your own scheduleInstant technical support and world class teacher supportTeacher RequirementsCertificate in TEFL, TESOL, CELTA or any other relevant certificates is a plusBachelor's degree or above (or final year student)Relevant teaching experience is preferredNative in one of the following languages required (English, Spanish, French, German, Latin, Mandarin ChineseDesktop or Laptop with Fast Internet connection and audio/video capabilityJob Types: Full-time, Part-time, ContractSalary: $19.00 to $22.00 /hourExperience:SAT Test Administering: 1 year (Preferred)ACT Test Administering: 1 year (Preferred)ESL Training: 2 years (Preferred)Teaching: 1 year (Required)Education:Bachelor's (Required)License:Teaching Certificate (Preferred)Language:French (Preferred)Mandarin Chinese (Preferred)Latin (Preferred)English (Preferred)Spanish (Preferred)Work authorization:United States (Preferred)"}, {"title": "Arabic Tutor", "company": "Aspire Public Schools", "location": "Oakland, CA 94601", "job url": "https://www.indeed.com/rc/clk?jk=68eff0daa950c841&from=vj&pos=top", "description": "About Aspire:\nAspire Public Schools operates 40 high-performing, college-preparatory public charter schools serving 16,000 students in underserved communities across California and in Memphis, Tennessee. Founded in 1998, Aspire is one of the nations largest open-enrollment public charter school systems serving predominantly low-income students, and delivering a rigorous College for Certain education to students in grades K-12.\nOur promise at Aspire Public Schools is that every child receives a high-quality education to prepare them for success in college, career and life. Every day, our community of students, parents, teachers and staff come together to learn and grow so that every childs aspirations are within reach.\n\nThe Opportunity:\nBehind every successful student is a passionate and dedicated team.Together, we will change the odds for underserved students, ensuring that every student is prepared to earn a college degree.The After School Tutor tutors and supervises students in a high quality, personalized education program for students and upholds the mission and values established by Aspire Public Schools.\n\nWhat You Will Do:\nTutor and provide enrichment activities for students in the after school program\nIdentify unique student needs and collaborate with other team members and outside service providers to diagnose and address learning challenges\nHelp assess students regularly in accordance with Aspire guidelines\nCollaborate with Aspire team members to improve own and others instructional practices; share best practices\nActively participate in professional development activities, including: training sessions and working with lead teacher, principal, instructional coaches\nSupport classroom systems/procedures and help manage student behavior to ensure all students are fully engaged in learning\nSupport a school-wide culture of high expectations that includes college preparation for all students\nDemonstrate knowledge of, and support, Aspire Public Schools mission, vision, value statements, standards, policies and procedures, operating instructions, confidentiality standards, and the code of ethical behavior\nPerforms other related duties as required and assigned\n\nWhat You Will Bring:\nKnowledge of child cognitive development and different learning styles\nAbility and willingness to implement Aspire Instructional Guidelines and Best Practices\nAbility and willingness to reflect and improve\nStrong written and verbal communication skills; ability to collaborate with colleagues, parents and community\nHigh school diploma\nAssociates degree or 48 units of college credit\nFluency in Arabic\n1+ year working with students as a teacher, teacher intern, or teaching assistant\n\nCompensation:\nAspire offers its employees a competitive salary and benefits, including paid time off, 100% core health benefits coverage, life insurance/long-term disability, participation in a CA or TN state retirement plan, tuition reimbursement plan, and adoption assistance program.\n\nAspire Public Schools is an equal opportunity employer and does not discriminate on the basis of race, color, gender, religion, age, sexual orientation, national or ethnic origin, disability, marital status, veteran status, or any other occupationally irrelevant criteria. Aspire promotes affirmative action for minorities, women, disabled persons, and veterans."}, {"title": "English/Reading Tutor", "company": "CCB School of Rockville", "location": "Rockville, MD 20850", "job url": "Not Available", "description": "$20 - $30 an hourPart-timeDesired: TutoringHello!We are looking to hire an English/Reading tutor to join our school!We require a Bachelor's Degree.Please attach your resume for consideration.Thank you!*Listing will be available for applicants until job posting is deleted*Job Type: Part-timeSalary: $20.00 to $30.00 /hourExperience:tutoring: 1 year (Preferred)"}, {"title": "Tutor", "company": "Save the Children", "location": "Twentynine Palms, CA", "job url": "https://www.indeed.com/rc/clk?jk=0787cc3fab2de4b0&from=vj&pos=top", "description": "Part-timeUnder the general, indirect supervision of the Save the Children Site Coordinator, and with technical assistance from the Save the Children Program Specialist, the Tutor will implement various aspects of the Save the Children program model, including supervision of children at all times, rotating groups of children from one activity to another and maintaining good general order and conduct among the children participating in the program.\n\nThe Tutor works directly with children and must maintain the highest degree of safety and protection for them. Incumbents of this position will work with Save the Children staff as well as with school staff to ensure good cooperation and collaboration. This position will be responsible for maintaining amiable relationships, assisting Site Coordinators in effectively implementing literacy, Healthy Choice and all other program components and providing children participating in our programs effective guidance, control and learning. The Tutor is a representative of Save the Children at all school sites of program implementation and therefore is expected to maintain high professional standards and excellent conduct of themselves and all programs and activities.\n\nIn addition, the Tutor will be assigned to a specific component(s) of the program for which they are responsible for implementing.\n\nAs a Save the Children employee who will come into contact with children on a routine basis, you are expected to prevent child abuse in every situation by striving through mental awareness, good practice and training to minimize risk to children. You must take positive steps to protect children who may be a subject of concern and report and respond to any instance of child abuse and promote training and awareness around all child safeguarding obligations"}, {"title": "ESL Tutor", "company": "Parliament Tutors", "location": "Suffolk, VA", "job url": "Not Available", "description": "$30 an hourContractDesired: Teaching ExperienceParliament Tutors is a full-service education management company specializing in traditional tutoring, test prep workshops, remediation programs, special education, language services and more. Clients include individuals/families, schools, non-profits, and government agencies.You can learn more about us at http://www.parliamenttutors.com.We are currently seeking a tutor for 11th grade ESL support, study skills in the Suffolk, Virginia 23434 area. The ideal candidates have tutoring and/or teaching experience and superior standardized test scores. Candidates must be able to pass a FULL BACKGROUND CHECK. Tutoring will take place at the students homes or at a mutually convenient library.Job Type: ContractSalary: $30.00 /hour"}, {"title": "French Tutor", "company": "A Plus Success Tutoring", "location": "Washington, DC", "job url": "Not Available", "description": "$20 - $24 an hourPart-timeWe will be interviewing and hiring French Speaking tutors for our program that provides at-home tutoring services for students living in Washington, DC and Prince George's County.We are looking for tutors who are among the following:College graduatesGraduate students: This is a perfect opportunity for graduate students who want to work a few hours per weekgraduate students have been among our most effective tutors.Retired teachers. If you are interested please email us your resume.Job Type: Part-timeSalary: $20.00 to $24.00 /hourEducation:Bachelor's (Required)"}, {"title": "K-12 Tutor", "company": "Novastar Prep Tutoring", "location": "Bethesda, MD", "job url": "https://www.indeed.com/rc/clk?jk=97a7e65c44d22802&from=vj&pos=top", "description": "$25 - $35 an hourNovastar Prep is a premiere private \"One-on-One, In-Home Tutoring and Test Prep\" service provider. Founded by socially conscious teachers and parents, Novastar Prep is built on the foundational beliefs that each student learns differently, possess tremendous gifts, and deserves the investment in cultivating their personal excellence and becoming the best version of themselves. Novastar Prep delivers on this mission through our proven learner-centric approach that develops the learning skills and strategies required to achieve academic goals and build greater confidence for lifelong success. Over a decade, with 100% of our students reporting greater self-confidence, our approach is working and in high demand.\n\nWe are seeking passionate academic subject experts to tutor in Maryland (Bethesda, Rockville, Potomac, Takoma Park or Silver Spring)\n\nWe have an immediate need for tutors with experience in:\nElementary, Middle and High School Subjects (All subjects)\nReading Comprehension & Writing Skills\nHigh School Math and Science (Calculus, Chemistry, Physics, etc.)\nSpecial Education\nTest Prep (PSAT, SAT, ACT, SSAT)\n\n\nQualifications\nBachelors Degree or higher\nRECENT or CURRENT tutoring/teaching experience : 1+ years experience preferred\nPassion for teaching\nClear communication skills\nMust have own transportation\nComputer literate\nWillingness to commit for at least a semester\n\n\n\nNovastar Prep Difference\nGuaranteed Match: We match tutor and student to assure mutually positive experience for success!\nFlexible Schedule: Work on your own schedule\nFlexible Locations: Many student locations to choose from\nCompetitive Pay: $25- $35 / hour. Incentives + Achievement Awards & Recognition\nPaid on time: Direct deposit pay every 2 weeks.\nHave Fun: Only teach the subject(s) you Love...all administrative items are handle by your team.\nTeam Effort: Our dedicated \"customer centric\" team supports each tutor succeed.\n\n\n\nhttp://careers.novastarprep.com/"}, {"title": "Home School Tutor", "company": "A+ IN HOME TUTORS", "location": "Tustin, CA", "job url": "Not Available", "description": "$30 an hourPart-timeA+ In Home Tutors is hiring!Grades 6-12 Home School Tutor needed in Central Orange CountyIdeal Candidate:Bachelor's degree or above1-2 years of experience teaching or tutoringBasic Math - Algebra 2 / Trigonometry or aboveLanguage Arts, some ScienceRelate well to studentsPay is $30 per hour1-8 hours per weekMust be available for daytime hoursTutoring is in-homePlease send resume and availabilityJob Type: Part-timeSalary: $30.00 /hourExperience:tutoring or teaching: 1 year (Required)Education:Bachelor's (Required)License:Driver's License and auto (Required)Work authorization:United States (Required)"}, {"title": "Writing / Language Arts Tutor", "company": "Santa Barbara Tutoring, LLC", "location": "Santa Barbara, CA", "job url": "Not Available", "description": "$11 - $30 an hourPart-timeSanta Barbara Tutoring, LLC is seeking THE BEST tutors to join our team!Do you have what it takes to be a Certified Santa Barbara Tutoring Writing/Language Arts Tutor?! We are looking for outgoing, hardworking professionals to join our team!We provide test prep and general tutoring services. After training, tutors are assigned students and schedule directly with SBT clients throughout Santa Barbara County.Help students lift grades or achieve their college admission goals while improving their self-esteem as an SB Tutoring Instructor!Requirements:  Strong writing ability Outgoing personality Excellent customer service Goal oriented, hardworking Excellent public speaking, presentation, and communication skills Strong organizational and time management skills Reliable transportation (ability to travel to clients homes within Santa Barbara County) Strong attention to detail Punctual, ability to manage multiple clients Computer and Microsoft Office proficient College degree preferredBenefits:  Competitive pay: $18 - $30 per hour, depending on experience Merit-based increases Comprehensive paid training and prep, with ongoing support Sick-pay Flexible scheduling Casual dresshttps://www.SBTutoring.comJob Types: Full-time, Part-timeSalary: $11.00 to $30.00 /hourExperience:tutoring: 1 year (Preferred)Education:Bachelor's (Preferred)Location:Santa Barbara, CA (Required)Work authorization:United States (Required)Shifts:Mid-Day (Required)Evening (Required)Required travel:100% (Required)"}, {"title": "Tutor, Title I / Part-time / EOY / 2018-19", "company": "Charlotte-Mecklenburg Schools", "location": "Charlotte, NC", "job url": "https://www.indeed.com/rc/clk?jk=1708b87d61a7789a&from=vj&pos=top", "description": "$19.77 an hourPart-timePlease note: this position is 25 hours / $19.77 hourly pay rate  w/ part-time benefits"}, {"title": "AVID Tutor", "company": "Oxnard School District", "location": "Oxnard, CA", "job url": "https://www.indeed.com/rc/clk?jk=dc761606328b5ef2&from=vj&pos=top", "description": "$12.27 an hourPart-timePositions are typically 2 - 4 hours per day and are open to current college/university students only.\n\nApplicants must attach a copy of their college transcripts indicating that they are a current student in order to be considered.\n\nPLEASE NOTE: Applying more than once does not increase your chances of being contacted.\n\nTutors may be needed for the following schools (hours will vary by school):\nChavez, 301 North Marquita Street, Oxnard, CA 93030\nCurren, 1101 North F Street, Oxnard, CA 93030\nDriffill, 910 South E Street, Oxnard, CA 93030\nFrank, 701 North Juanita Ave., Oxnard, CA 93030\nFremont, 1130 North M Street, Oxnard, CA 93030\nHaydock, 647 West Hill Street, Oxnard, CA 93033\nKamala, 634 West Kamala Street, Oxnard, CA 93033\nLemonwood, 2200 Carnegie Street, Oxnard, CA 93033\nSoria, 3101 Dunkirk Drive Oxnard, CA 93035\n\nPlease note: Qualified applicants will only be contacted when a request is received from a school for AVID tutoring services.\n\nUnder direct supervision of the Principal and AVID Coordinator and with the assistance of the AVID elective teacher, performs tasks in the tutoring and mentoring of students in the AVID program.\n Examples of Duties:\nTake an active role in developing the academic and personal strengths of AVID students.\nServe as a role model/mentor to AVID students by being a lifelong learner, demonstrating appropriate academic and social behaviors, and wearing appropriate attire at all times.\nDetermine from student's notes and discussions, the concepts that need to be reinforced.\nAssist the classroom teacher in reviewing student binders, including calendars, class and textbook notes, etc.\nBecome familiar with the materials in the AVID Curriculum Libraries.\nBecome familiar with the textbooks and materials used by AVID students.\nConduct tutorial sessions.\nFacilitate mini-lessons in the process of writing in all subject areas, study skills, and other aspects of college preparation.\nSet an example of personal excellence and high expectations for AVID students to follow.\nWork with students in any phase of the writing process, such as brainstorming, clustering, revision, and editing.\nCommunicate frequently and honestly with the AVID coordinator/teacher regarding student progress and areas of concern.\n \nEmployment Standards: Qualifications:\n\nGraduation from High School or equivalency\nCurrently enrolled in a college or university program"}, {"title": "Educational Tutor Consultant", "company": "2-Strive", "location": "United States", "job url": "Not Available", "description": "Licensed teaching credentials or eligible for licensing as teacher in the public school arena. Applicant must have a love for helping children. Serving Orange, Osceola, Seminole and Lake Counties.\nBenefits:\nFlexible Schedule\nHigher Earning Potential\nPaid Learning Experience\nSuperior Supervision\nAll Applicants must be able to pass a federal background check.\n\nSend your cover sheet and resum to our Human Resources Department careers@2-strive.com."}, {"title": "Reading Tutor", "company": "Big Brothers Big Sisters of Saint Lucie, Indian River, and Okeechobee Counties", "location": "Port Saint Lucie, FL", "job url": "Not Available", "description": "Part-timeJob DescriptionTo Apply: Please submit a resume and answer the following questions in the cover letter section: 1) What interests you most about becoming a reading tutor?2) What do you think are the challenges facing students today?3) Tell us about a non-familial teacher/adult that made a difference in your life?4) If you could go back in time and help the younger version of yourself what life skills that you have developed would you impart to them?5) Are you comfortable working at least 24 hours a week during regular school hours?Stipend: $6,406/year ($600 a month) or 3,203/year ($300 a month)Position Overview: Did you know that students who do not read proficiently by the end of 3rd grade are four times more likely to drop out of school? Our Goal is to help all St. Lucie, Indian River, and Okeechobee County children become proficient readers by the end of 3rd grade and give them a better start to their futures. If you are passionate about education and literacy or are looking for a way to improve your community, join us and make a difference in the lives of preschool and elementary students.Become a BBBS Reads tutor and help struggling readers, VPK to grade 3, get on track for reading at grade level. We'll provide training to get you started and ongoing coaching as you work through your 11-month term of service. Our members serve, 25 hours per week for a total of 900 hours of service.ResponsibilitiesWork one-on-one with students in VPK through third grade who need extra support in learning to read. Tutors work with the same students in 30-minute sessions three times during school hours.With younger students, tutors help build early literacy skills such as letter sounds and names and word blending.For older students, tutors select reading passages and follow intervention scripts to practice fluency skillsConduct quick and easy literacy assessments to monitor student progress, plan and set goalsMust maintain the confidentially of all students.Attend 8 days of mandatory training prior to service with students, plus additional required training sessions throughout the year.Participate in site and program sponsored activities (i.e community fairs, family nights, etc.)QualificationsAge 18 or older by the program start datePossess a high school diploma or a GED by the program start dateCitizen, national, or lawful permanent resident alien of the United StatesStrong interest in education specifically in helping VPK and elementary studentsDedication to community serviceAble to commit to 11 months of serviceBasic computer skills, including the ability to navigate online systems and email.Organized, responsible, flexible, motivated and professionalWilling to accept and incorporate constructive feedback from coaches and program staffExcellent time management and decision-making skills.Ability to work with diverse personalities and adapt to the school environmentA strong personal standard of excellence, ethics, and integrityTutors are paid a modest living allowance every two weeks (Total stipend $6,406) during their service term and some positions receive an education award upon successful completion which may be used to pay qualified student loans or tuition. Tutors over the age of 55 may choose to gift their education award to their child or grandchild.BBBS Reads will not discriminate for or against any service member or applicant based on the basis of race, color, creed, religion, national origin, sex, marital status, status with regard to public assistance, familial status, disability, sexual orientation, or age. Reasonable accommodation provided upon request.Job Type: Part-timeSalary: $6,406.00 /yearExperience:teaching: 1 year (Preferred)Education:High school or equivalent (Required)Location:Port St. Lucie, FL (Preferred)Work authorization:United States (Required)Shifts:Morning (Preferred)Mid-Day (Preferred)"}, {"title": "Latin Tutor", "company": "Parliament Tutors", "location": "New York, NY", "job url": "Not Available", "description": "$30 an hourContractDesired: Teaching ExperienceParliament Tutors is a full-service education management company specializing in traditional tutoring, test prep workshops, remediation programs, special education, language services and more. Clients include individuals/families, schools, non-profits, and government agencies.You can learn more about us at http://www.parliamenttutors.com.We are currently seeking a tutor for Latin in the New York, NY 10128 area. The ideal candidates have tutoring and/or teaching experience and superior standardized test scores. Candidates must be able to pass a FULL BACKGROUND CHECK. Tutoring will take place at the students homes or at a mutually convenient library.Job Type: ContractSalary: $30.00 /hourLocation:New York, NY (Preferred)"}, {"title": "Biology Tutor", "company": "A+ IN HOME TUTORS", "location": "San Diego, CA", "job url": "Not Available", "description": "$30 an hourPart-timeDesired: Teaching ExperienceTutoringDriver's LicenseA+ In Home Tutors is hiring!Seeking an AP Biology Tutor for weekend tutoringIdeal candidate:Bachelor's degree or aboveStrong in AP BiologyAble to simplify concepts and offer study skills to studentPay is $30 per hour1-2 hours per week (weekend tutoring) at student's home (Imperial Beach area)Send resume and brief cover letterJob Type: Part-timeSalary: $30.00 /hourExperience:teaching or tutoring: 1 year (Required)Education:Bachelor's (Required)License:Driver's License (Preferred)Work authorization:United States (Required)"}, {"title": "Tutor", "company": "CodaKid", "location": "United States", "job url": "https://www.indeed.com/rc/clk?jk=9c3c081a80b9b6ae&from=vj&pos=top", "description": "Part-timeCodaKid is looking to hire top talent to teach courses in using real programming languages and professional cutting-edge technology. We're looking for individuals with a passion for learning, a fun personality, professional work habits, and enthusiasm for working with kids ages 6-15."}, {"title": "Tutor", "company": "Math, Mandarin and More Inc.", "location": "New York, NY 10022", "job url": "Not Available", "description": "Part-timeMath, Mandarin and More Inc. is a new full service learning center based in Midtown that offers tutoring, test prep, and homework help in various subjects. It also offers Mandarin language instruction tailored for both students and executives in the business world. Math, Mandarin and More Inc. plans to open its doors to customers in early 2019.Math, Mandarin and More is looking for part-time tutors specializing in primary and secondary education subjects, test prep (SAT, SATII, ACT, GRE, GMAT, SHSAT, AP Exams, Regents, etc), and/or Mandarin language tutoring/instruction. Tutors must have at least a bachelor's degree or be enrolled in a bachelor's degree program. Prior tutor experience is preferred.Applications must include a cover letter telling us why you are interested in tutoring, your subject speciality(ies), and your availability.Job Type: Part-time"}, {"title": "Tutor", "company": "Alaska Christian College", "location": "Soldotna, AK 99669", "job url": "https://www.indeed.com/rc/clk?jk=0701b04020e670d4&from=vj&pos=top", "description": "Desired: Time ManagementPURPOSE: Provide individual and small group tutoring to students in the Academic Success Center. Assist students in improving academic achievement by meeting with them on a regular basis to clarify learning problems and work on study skills. Other assistance might include reviewing class material, discussing the text, predicting test questions, formulating ideas for papers, or working on solutions to problems. Tutoring is a supplement to teaching. Tutors are not expected to know everything about the subject for which they tutor.\n\nRESPONSIBILITIES:\nProvide both scheduled and walk-up tutorial services.\nOversee and create/provide materials for learning communities and/or reading circles as needed.\nKeep accurate records of tutorial sessions, reading circles, and learning communities.\nMaintain integrity in student work and tutorial session.\nProvide feedback on Student Success Center usage to Student Success Center Manager.\nAttend tutor training as provided through the Academic area.\nWith permission of the student, notify Student Success Center Manager and/or the Vice President for Academic Affairs when student concerns in subjects may necessitate a status change for the course.\nWorks with other tutoring staff and ACC volunteers to coordinate services for students.\nCreate/maintain motivating environment for learning.\nCreate activities for mid-term and finals weeks.\nServe as a mentor to one or more students (optional)\nAt the Student Success Center Managers discretion may serve as an ALP advisor to one or more student.\nOther duties as assigned.\n\nREQUIREMENTS:\nMinimum of a Bachelors degree.\nDemonstrate academic excellence.\nUnderstand tutoring practice.\nExcellent interpersonal, written and oral communication skills.\nMust understand and maintain confidentiality of all information seen or heard.\nMust be able to work independently and show good judgment.\nNeeds to be organized and show good time management skills.\nMust have a working knowledge of Windows Office and have good data entry skills.\nMust be reliable and dependable with regular, timely attendance.\nQualified candidates should send the following to April Weber via email (aweber@alaskacc.edu):\n1. Letter of Intent\n2. Resume\n3. Application"}, {"title": "Environmental Science Tutor", "company": "Quality Tutoring Services", "location": "Tustin, CA", "job url": "Not Available", "description": "$18 - $20 an hourPart-timeWe need reliable and hard working individuals to join our team!We are seeking for individuals to tutor in AP Environmental Science and/or any subject up to a high school level. He/She will be assigned a weekly schedule based upon his/her availability. We will work around your school/work schedule.Qualified candidates must have a car and a valid driving license. Must be professional and reliable. Must be a university student with a minimum GPA of 3.0. Must be confident with all the subjects to be tutored.Please visit our website: www.qt-es.comSince we have multiple job postings please specify in the cover letter what position you are applying for and what subject you feel confident tutoring.Quality Tutoring services was established in 2002. We have a staff of about 45 tutors. Quality Tutoring Services deals with students on one-to-one basis, treating every student as an individual case.Although based out of Anaheim ,we have tutors throughout California in Los Angeles, Orange,San Bernardino Counties and San Diego County.Job Types: Full-time, Part-timeSalary: $18.00 to $20.00 /hourEducation:High school or equivalent (Required)"}, {"title": "French Tutor", "company": "A+ IN HOME TUTORS", "location": "Palmdale, CA", "job url": "Not Available", "description": "$25 an hourPart-timeA+ In Home Tutors is hiring!Seeking a FUN French language tutor for a 10 year oldIdeal candidate:Bachelor's degree or aboveFluent in FrenchCreate fun immersion language lessonsPay is $25 per hour1-2 hours per week (weekdays)In-home tutoring in Palmdale (NO SKYPE)Please send resume and WHY you are qualifiedJob Type: Part-timeSalary: $25.00 /hourExperience:tutoring or teaching: 1 year (Required)Education:Bachelor's (Preferred)License:Driver's License and auto (Required)Language:French (Required)Work authorization:United States (Required)"}, {"title": "PART-TIME: Skills Coaches &amp; Tutors", "company": "Club Xcite", "location": "San Diego, CA", "job url": "Not Available", "description": "$20 - $23 an hourPart-timeDesired: Marriage and Family Therapy CertificationSkills Coaches and Tutors: Rewarding Opportunity To Work With Kids! Job DescriptionWe Offer: Flexible Part-Time Hours, Growth Opportunities.Who we are: For over 13 years, Club Xcite has been a leader in providing innovative and quality educational services to children and families. We offer after school academic coaching, tutoring, and enrichment programs dedicated to individual growth and academic success in a fun environment.The Position: Club Xcite is looking to hire experienced Academic Tutors and Executive Functioning and Social Confidence Coaches for many available and upcoming part-time positions.We are looking for candidates who have a background in, or 2+ years of experience working in, any or all of the following: ABA Therapy, Mental Health, ADHD/ADD Coaching, Special Education, Autism Spectrum Disorders, Behavioral Therapy*** These part-time positions would be a great opportunity for those candidates who have a day-time job or are currently enrolled in a graduate program in a related field and are looking for meaningful part-time work weekday afternoons and/or evenings and weekends. ***Position descriptions: TUTORS: Provide 1-1 academic support in all school subject areas and grades.SKILLS COACHES: Skills coaches provide 1-1 services to children with skills deficits in the areas of Social and Executive Functioning skills.Qualifications: - 2+ years of previous experience working with children and/or adolescents (REQUIRED)- Ability to communicate well with others- A degree in related field and/or currently enrolled in related graduate program (MFT in mental health, counseling, social work, etc.) (PREFERRED)- Ability to commit to a minimum of six months- Ability to work independently as well as with a team of caring and motivated professionals- Must have reliable transportation source and availability during weekday afternoonsHours and Pay: PART TIME 3-10 HOURS/WEEK. $20-23/hr starting based upon experience and qualifications, plus paid trainingApply Now: Please attach your most recent and resume OR apply directly through our website http://www.clubxcite.com/contact-us/mentor/Job Type: Part-timeJob Type: Part-timeExperience:working with kids: 2 years (Required)Education:Bachelor's (Preferred)"}, {"title": "Academic &amp; ADHD Coach/Tutor for Teens", "company": "Creating Positive Futures", "location": "Atlanta, GA", "job url": "https://www.indeed.com/rc/clk?jk=16bdbd9b6bf54cb7&from=vj&pos=top", "description": "$35 - $40 an hourPart-time, ContractWe are\nAn Academic & ADHD coaching practice in the Atlanta area, which was founded in 2013 to empower teens & young adults to earn better grades with less stress by developing the mindset, organization, time management, and study skills they need to thrive.\nWe are looking for energetic, motivated coaches to join our team in the Atlanta area and work 1:1 with middle school, high school, and college students at our two locations in the Atlanta area and virtually through Zoom meeting.\nYou are...\nA college graduate with a background in teaching, counseling, tutoring, academic coaching, or professional organizing\nIn the Atlanta area, and able to meet with students in North Druid Hills or Roswell\nAvailable to work at least 10 hours / week, after school or on weekends\nA people-person with lots of positive energy, who enjoys interacting with others and going above & beyond to make sure they feel heard, understood and cared for\nAn amazing listener. You're the person who friends & family come to with their problems because they know they can count on you to stay calm, see both sides to every situation, and help resolve the problem (without telling them what to do)\nAn optimist by nature, who is always able to see the bright side in any situation, and inspires others with your positive energy & enthusiasm\nGreat at keeping in touch with people, and happy to have an excuse to jump on the phone with someone or reach out by email or text. (You can't remember the last time you've had an email sitting in your inbox for more than a day!)\nHighly organized and efficient you're the type of person who gets a thrill out of visiting the Container Store, and writes things down on your to-do list even after you've done themjust for the fun of checking them off. You do things well AND you do them quickly.\nThe opposite of a procrastinator; you would much rather complete tasks way before the deadline than be rushing to finish them at the last minute.\nInterested in positive & educational psychology, and LOVE learning new things\nInternally motivated, and committed to doing excellent work\nExcited by the idea of being part of a small, growing business that has a positive impact on the lives of students and their families, and helps young adults in reaching their full potentialyou want to feel like your work is making a difference in the world.\nExcited about the idea of joining and playing a key role in a small, growing company...but don't have the time, energy, or desire to create a business of your own\nAble to commit to this position for at least a year\nThe Position\nYou will join our team on a part-time basis as an independent contractor, and work directly with our founder to learn how to effectively coach stressed-out and underperforming students to help them learn how to earn better grades with less stress.\nAs an Academic & ADHD coach, you will have an opportunity to make a positive difference in the day-to-day lives of students and their families by empowering teens to develop the time management, organization, study skills, and mindset they need to reach their goals.\nSome examples of your responsibilities will include\nMeeting with students for weekly sessions, at our Atlanta or Roswell offices or online\nSending out session summary reports to students & parents after each meeting\nChecking in with students by text or email between sessions\nMeeting with parents for check-in calls to discuss students' progress\nMonitoring students' grades online\nReaching out to students' teachers, counselors, and/or tutors, as needed\nAttending regular team meetings & training sessions\nThe starting rate for this position is $35-$40/hour.\n\nThere will be a paid 12-week training period for new coaches, during which you will work closely with our founder to learn the ins and outs of leading students through the coaching process.\nAfter this training period, you will have the freedom to coordinate a mutually agreeable time to meet with your students and adjust the days you work to fit your schedule. We typically meet with students in the afternoons, evenings, and weekends."}, {"title": "Part-Time Reading Comprehension Tutor for 3rd Grader", "company": "EBL Coaching", "location": "New York, NY 10128", "job url": "Not Available", "description": "$45 - $50 an hourPart-time, ContractSeeking a part-time academic tutor for a third grade student who needs reading comprehension tutoring. Must have extensive tutoring experience and at least a bachelor's degree. Tutoring schedule is flexible. Please e-mail your resume and cover letter detailing your training and tutoring experience. Indicate if you have any Wilson/Orton Gillingham tutoring experience (not required). Learn more about us at www.eblcoaching.com. *Please do not apply to tutor if you are an employee of the NYC Department of Education.*Job Type: ContractSalary: $45.00 to $50.00 /hourExperience:Tutoring: 1 year (Preferred)childcare: 1 year (Preferred)Education:Bachelor's (Preferred)"}, {"title": "K-12 Tutor", "company": "Vision Tutoring Educational Foundation", "location": "Atlanta, GA", "job url": "Not Available", "description": "$20 - $40 an hourContractDesired: Teaching ExperienceTeaching CertificationTutoringVision Tutoring, LLC and the Vision Tutoring Educational Foundation, Inc. are seeking energetic, creative educators to conduct individual or small group tutorial sessions with students (K - 12) throughout metro-Atlanta. Tutors may select to work with individuals or groups of students whose location and schedule are convenient for them and will be assigned to the specific subject(s) and grade level(s) in which they are proficient. Session duration may vary from 1 to 2 hours with the possibility of back to back sessions. Only instructional time is billable. Tutors may indicate availability for any day Sunday through Saturday beginning at 8 am and concluding at 8:30 pm.Vision Tutoring is an Equal Opportunity Employer who strives to promote diversity within the field of education by recruiting and advancing the careers of qualified minority candidates, retired and active military, and candidates with disabilities. There are multiple openings, so feel free to share this job posting. Interested candidates should submit his or her resume as soon as possible.Applicants must:*Have one or more of the following 1) a current, valid Teaching Certificate (type: SRT, teaching/instructional), 2) a bachelors degree in Reading, English, Literacy, Math, Science, Social Science, Education, or similar field and at least two years of teaching or tutoring experience, or 3) at least three years of teaching or extensive tutoring experience*Possess an Associate's Degree or higher (candidates who hold an Associates Degree only must possess three years of experience in a school setting)*Be proficient in teaching/tutoring the subject(s) and grade level(s) for which they apply*Have the ability to create engaging lessons for students based on the skills that must be taught- this position does not generally include homework assistance*Be dependable, punctual, organized, and a positive role model*Be proficient in the use of the computer, Internet, Office software (Word, Excel), and accessing/responding to emails*Be able to consistently submit detailed paperwork by the designated deadline each month*Have a passion for teaching youth and contributing to their success*Have reliable transportation (personal or public)*Be willing to submit to a criminal background checkQualified candidates should submit an updated resume as soon as possible. Be sure to include details regarding your Teaching Certificate (if one is available) along with specific experience relative to working with youth and teaching/tutoring. Resumes are reviewed in the order in which they are received. You will receive a response upon review of your submission.Job Type: ContractSalary: $20.00 to $40.00 /hourExperience:teaching/tutoring: 2 years (Required)Education:Associate (Required)License:Teaching Certificate (Preferred)"}, {"title": "Private Tutor", "company": "Spectrum Education and Therapy Center, LLC", "location": "Bowie, MD", "job url": "Not Available", "description": "$15 - $40 an hourContractSpectrum Education and Therapy Center, LLC is looking for an experienced tutor to work with a 10 year old student in Bowie, Maryland. Tutor will teach strategies for self-regulation and support family to identify the best accommodations to support learning at home. Must have experience implementing elementary level reading interventions and working with students with attention and hyperactivity characteristics. Apply today and join our team!Job Type: ContractSalary: $15.00 to $40.00 /hourExperience:reading intervention: 2 years (Preferred)Location:Bowie, MD (Preferred)License:Elementary Education or Special Education (Preferred)Seasonal job:No"}, {"title": "Networking Tutor", "company": "Independence University", "location": "Remote", "job url": "https://www.indeed.com/rc/clk?jk=ce363f1cbeaad18f&from=vj&pos=top", "description": "Part-timeCompany Overview\n\nThe Center for Excellence in Higher Education (CEHE) is a 501(c)(3) non-profit corporation headquartered in Salt Lake City, Utah. CEHE operates degree-granting career colleges throughout the western United States and online. The college brands include Stevens-Henager Colleges in Utah and Idaho; CollegeAmerica in Colorado, Arizona, and Wyoming; California College San Diego, and Independence University (online platform). All of the colleges are accredited by ACCSC, a national accrediting body recognized by the U.S. Department of Education. The colleges offer degree programs from the Associates level through the Masters level in a variety of disciplines including Computer Science, Graphic Arts, Business/Accounting, Medical Specialties, Nursing, and Healthcare. CEHE is an at-will employer.\n\nDisclaimer:\n\nThis specification is intended to indicate managements designation of the positions essential functions, which include the kinds of tasks and levels of work difficulty that will be required of positions given this title, and shall not be construed as declaring the entire description of specific duties and responsibilities of any particular positions. It is not intended to limit, or in any way modify, the right of any supervisor to assign, direct, and control the work of employees under his/her supervision. The use of a particular expression or illustration describing such duties shall not be held to exclude other duties not mentioned. All positions, unless otherwise noted in an offer letter, are 40-hour a week positions, and regular and predictable job attendance is a requirement for all positions. Ability to competently perform all essential duties of the position, with or without reasonable accommodation; a demonstrated commitment to effective customer service delivery; and the ability to work productively as a member of a team or workgroup are basic requirements of all positions at CEHE. This job description is subject to change at any time.\n\n\nCompany Culture\n\nWe are People-Focused - We respect the intelligence and potential of each staff member. We provide a working environment that permits freedom to think, speak, disagree, innovate, create, and initiate. We value and admire ambitious and productive people, and we protect them, encourage them, and create a climate in which they flourish. We love, recognize, and reward producers and performers. In return, we require our employees to have a strong work ethic and be productive. We recruit broadly and select the highest caliber people available - ambitious, knowledgeable, and talented managers, instructors, admissions consultants, and administrators.\n\nSound Values and Virtues - The ethical conduct of our employees is of supreme importance. We hold the following as values and virtues: rationality, purpose, innovation, productiveness, profit, honesty, integrity, justice, and pride. These values are the core of our ethical code. To be ethical means to apply, to work by, and to live by these values and virtues.\n\nCREDO - We are dedicated to helping our students graduate and get a much better job sooner. This is our mission. We pledge to provide the finest career education possible and to graduate satisfied students who have greater knowledge, skills, and self-esteem in the shortest possible time. Our education is high value, clear, and interesting and achieves the highest level of learning and achievement for students. We want to deliver twice as much in half the time.\n\nCEHE is a drug-free environment and we perform drug testing.\n\nEqual Opportunity Employer - We are an equal opportunity employer. No employee, or applicant for employment, shall be discriminated against in any term or condition of employment because of race, color, religion, national origin, sex, age, or sexual orientation. We are constantly striving to make our colleges the best they can be. As an employee, you become part of that mission. We expect a commitment that you will be the best you can be.\n\nI have reviewed the above job description, which sets out the essential job functions of my position, and certify that I can perform all the essential functions with or without an accommodation. If I need an accommodation to perform the essential functions of my job due to a physical or mental impairment, I agree to notify my manager immediately and agree to cooperate with the Company to identify reasonable accommodations that will allow me to perform the essential functions of my job in a satisfactory manner. I further agree to contact Human Resources if I am concerned that the interactive process or the offered accommodations do not adequately address my needs."}, {"title": "AP World History Tutor", "company": "A+ IN HOME TUTORS", "location": "Poway, CA", "job url": "Not Available", "description": "$30 an hourPart-timeA+ In Home TutorsSeeking an experienced AP World History Tutor in Poway, CA (NO SKYPE)10th grade college-bound studentIdeal candidate:Bachelor's degree or aboveStrong in World HistoryStudy strategies for SAT AP World History ExamPay: $30 per hourFlexible hours 1-2 per weekPlease email resume and availabilityJob Type: Part-timeSalary: $30.00 /hourExperience:teaching or tutoring: 1 year (Required)Education:Bachelor's (Required)License:Driver's License and auto (Required)Work authorization:United States (Required)"}, {"title": "TUTOR", "company": "Duke University and Duke University Health System", "location": "Durham, NC", "job url": "https://www.indeed.com/rc/clk?jk=6d3c96f3b54c2df4&from=vj&pos=top", "description": "Part-timeOcc Summary\n\nNON-DUKE STUDENTS OR PROFESSIONALS WHO TUTOR STUDENTS WHEN DUKE STUDENTS ARE NOT AVAILABLE DURING THE SCHOOL YEAR AND/OR SUMMER SCHOOL, DEPENDING ON THE NEED FOR THESE SERVICES.\n\nWork Performed\nAssist students with learning materials for their courses either in one-on-one or group sessions. Monitor the academic progress of the student. Work with academic advisors to assess the needs and progress of the students\n\nPerform other related duties incidental to the work described herein.\n\nKnowledge, Skills and Abilities\nN/A\n\nLevel Characteristics\nN/A\nDuke University is an Affirmative Action/Equal Opportunity Employercommitted to providing employment opportunity without regard to anindividual's age, color, disability, gender, gender expression, genderidentity, genetic information, national origin, race, religion, sex,sexual orientation, or veteran status.\nDuke aspires to create a community built on collaboration, innovation,creativity, and belonging. Our collective success depends on the robustexchange of ideasan exchange that is best when the rich diversity ofour perspectives, backgrounds, and experiences flourishes. To achievethis exchange, it is essential that all members of the community feelsecure and welcome, that the contributions of all individuals arerespected, and that all voices are heard. All members of our communityhave a responsibility to uphold these values.\nEssential Physical Job Functions:Certain jobs at Duke University and Duke University Health System mayinclude essential job functions that require specific physical and/ormental abilities. Additional information and provision for requests forreasonable accommodation will be provided by each hiring department.\nEducation\nN/A\nExperience\nN/A"}, {"title": "In Home School Aged Tutor", "company": "LearnWell", "location": "Wellesley, MA", "job url": "Not Available", "description": "$15 - $20 an hourPart-timeAt LearnWell, we are committed to providing exceptional educational services to school-aged students! Our students are unable to attend school full-time and need a dedicated tutor to help them continue with their course load while at home.We are looking for someone with a passion for education and a desire to help students thrive! Tutors meet 1 on 1 with students completing curriculum provided by the school district. The tutor's main responsibility is to act as an aide for the student, guiding them through educational material and ensuring their academic success. As a tutor with LearnWell, you have the freedom to make your own hours and schedule; there are no minimum hourly requirements, which allows you to work in a field you love around YOUR schedule. Tutors receive curriculum prior to the scheduled session, so there is plenty of time to prep and get prepared with the given material.We have a current need in the Wellesley/Weston area, for 15-20 hours a week. Available students are between 8th-12th grade.Bachelors degree required. Hourly rate between $15-$20 based on experience.Job Type: Part-timeSalary: $15.00 to $20.00 /hourEducation:Bachelor's (Required)"}, {"title": "K-8 Tutor", "company": "C E Mitchell Tutoring Services LLC", "location": "Sandy Springs, GA", "job url": "Not Available", "description": "Part-timeC E Mitchell Tutoring Services LLC is looking for engaging, energetic and encouraging teachers to provide in-home tutoring for K-8 students in Reading, Writing & Math.Our tutors are treated as independent contractors and have the option to use their own teaching styles, while we provide the content.We service students in Cobb, Dekalb, Fulton & Gwinnett Counties and it would be ideal if our tutors resided in these areas.We would prefer certified General or Special Education teachers for our students. However, we strongly encourage college students who are majoring in Early Childhood, Secondary and Special education to apply.Job Type: Part-timeSalary: $20.00 to $25.00 /hoJob Type: Part-time"}, {"title": "Tutor", "company": "School Bridge", "location": "Bethesda, MD", "job url": "Not Available", "description": "$15 - $50 an hourPart-timeSeeking instructional coaches and tutors to work with students - elementary through high school- to provide small-group and individual tutoring services including after-school homework support, supplemental instructional, and organizational assistance. Additionally, tutors demonstrating interest and or experience implementing research-based, outcomes-oriented tutoring services for students with reading challenges, including dyslexia are encouraged to apply. Preference for candidates with interest, experience and or education in teaching, tutoring, coaching, speech and language pathology, student outreach. Must be collaborative, kind, dependable and student-focused. Candidates are asked to consider at least a one year commitment to ensure quality programming, continuity, student engagement and progress. Candidates may be eligible for instructional training and professional development opportunities. Background and reference checks will be required before employment. School Bridge-Bethesda is open Monday through Friday from 8:30am-8:30pm and on Saturdays from 8:30am-4:30pm in the River Road location. Regular part-time hours are available.Job Type: Part-timeSalary: $15.00 to $50.00 /hourExperience:teaching or tutoring: 1 year (Preferred)License:Teaching Certificate (Preferred)"}, {"title": "Writing / Language Arts Tutor", "company": "Santa Barbara Tutoring, LLC", "location": "Santa Barbara, CA", "job url": "Not Available", "description": "$11 - $30 an hourPart-timeDesired: Time ManagementPublic SpeakingTutoringMicrosoft OfficeSanta Barbara Tutoring, LLC is seeking THE BEST tutors to join our team!Do you have what it takes to be a Certified Santa Barbara Tutoring Writing/Language Arts Tutor?! We are looking for outgoing, hardworking professionals to join our team!We provide test prep and general tutoring services. After training, tutors are assigned students and schedule directly with SBT clients throughout Santa Barbara County.Help students lift grades or achieve their college admission goals while improving their self-esteem as an SB Tutoring Instructor!Requirements:  Strong writing ability Outgoing personality Excellent customer service Goal oriented, hardworking Excellent public speaking, presentation, and communication skills Strong organizational and time management skills Reliable transportation (ability to travel to clients homes within Santa Barbara County) Strong attention to detail Punctual, ability to manage multiple clients Computer and Microsoft Office proficient College degree preferredBenefits:  Competitive pay: $18 - $30 per hour, depending on experience Merit-based increases Comprehensive paid training and prep, with ongoing support Sick-pay Flexible scheduling Casual dresshttps://www.SBTutoring.comJob Types: Full-time, Part-timeSalary: $11.00 to $30.00 /hourExperience:tutoring: 1 year (Preferred)Education:Bachelor's (Preferred)Location:Santa Barbara, CA (Required)Work authorization:United States (Required)Shifts:Mid-Day (Required)Evening (Required)Required travel:100% (Required)"}, {"title": "Private Tutor", "company": "Teach american sign language ( you pay me to teach you ASL)", "location": "Mobile, AL", "job url": "Not Available", "description": "I would like to teach student or general people or little kids or anyone willing to learn sign language . Its only I will able to teach them . its private and can work with you ..Job Type: Full-time"}, {"title": "ACM Tutor", "company": "New Jersey Institute of Technology", "location": "Newark, NJ", "job url": "https://www.indeed.com/rc/clk?jk=4ea9da4e510cd817&from=vj&pos=top", "description": "Provide assistance to all students needing help in Computer Science related undergraduate courses. MUST BE AN AN UNDERGRADUATE STUDENT TO BE CONSIDERED\n\nMust have received an \"A\" in computer related courses.\n\nPlease allow at least 24 hours for your application and eligibility to be processed. Thank you for your interest in student employment at NJIT!"}, {"title": "Highschool tutor needed", "company": "Empower Your Mind Tutoring", "location": "Los Angeles, CA", "job url": "Not Available", "description": "Part-timeREAD all Requirements before applying!!!!Empower Your Mind Tutoring is looking to hire an exceptional tutor for 11th grade physiology, honors physics, and AP English. Must have a minimum of 2 years of tutoring, be available to work on Sundays, reliable transportation to West Los Angeles, and can be very confident in tutoring highschool physiology, honors Physics, and AP English. Must be able to commit to this school year with this student, and be great at communicating with myself, student, and parents. Being punctual is a must and reliable. I am looking to interview asap and hire within 1 week. This tutoring position is for Sundays and possibly some part time over the week. Starts asap. Please send resume. I will be in touch shortly.Job Type: Part-timeExperience:tutoring: 2 years (Preferred)Education:Bachelor's (Required)"}, {"title": "Prep Teaching Assistant (Remote; Multiple Locations)", "company": "Galvanize", "location": "Denver, CO", "job url": "https://www.indeed.com/rc/clk?jk=6876d77cab87d318&from=vj&pos=top", "description": "We are looking for a teaching assistant to join our Structured Study Program Team, who will support candidates through our prep material and level-up their coding skills in order to gain admission to Hack Reactor @ Galvanize through our Structured Study Program (SSP). This is a remote position, however, you do have the option to work from one of our campuses.\n\nResponsibilities\n\nServing as in-class point of contact to students on all things technical Handle virtually all direct interaction with students\nResponding to student Slack messages\nResolving help desk tickets\nProviding guidance/support on student technical concerns\nFollowing up with students about their assessment results, using Slack, email, or Zoom\nCreating and communicating new learning plans for students who are off trackLead curriculum lectures, town halls, and weekend kickoffs (depends on section)\nMonitor and curate Student Slack channels\nCreate a sense of community through huddles\nWork in partnership with success advisor to support and communicate needed information about student\n\nGalvanize provides equal employment opportunities (EEO) to all employees and applicants for employment. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status."}, {"title": "Tutor/Reading Afterschool", "company": "New Life Faith Center", "location": "Kinston, NC 28501", "job url": "Not Available", "description": "Part-timeDesired: TutoringChildcareNew Life Faith Centeris looking for After School Reading Tutors for ages K-5 who are self-motivated individuals and have a passion for assisting students to improve their reading skills.Responsibilities and Duties*Help both struggling and gifted students reach their full potential*Supplementing the instructions that the students receive in class and guiding them toward study practices and aides that can help them excel.*Tutors work with individual students one-on-one*Occasionally organize group activities for students who are studying the same material.*Encourage and motivate students to form a life-long, lasting connection with reading.Requirements*High School Diploma preferred*Must pass criminal background check*Must have dependable transportation*Must be punctualMust have extensive reading skillsJob Type: Part-timeExperience:child care: 1 year (Preferred)tutoring: 1 year (Preferred)"}, {"title": "K-12 Tutor", "company": "Above &amp; Beyond Learning, Inc.", "location": "Okeechobee, FL", "job url": "Not Available", "description": "$25 - $35 an hourPart-time, ContractAbove & Beyond Learning is looking for experienced, enthusiastic and professional tutors to work with K-12 students in multiple subjects (Math, LA, Science, etc...)Job Types: Part-time, ContractSalary: $25.00 to $35.00 /hourEducation:Bachelor's (Required)"}, {"title": "Italian Tutor", "company": "Margot Tutoring Inc", "location": "Melville, NY 11747", "job url": "Not Available", "description": "$25 - $35 an hourPart-timeDesired: Teaching ExperienceTutoringJob Duties and Responsibilities:Tutors will provide 1 hour (60 minutes) of in-home Italian tutoring per student per weekTutors are required to fill out a session form online after each tutoring sessionTutors must keep in touch with their supervisor and the students parents on a regular basisTutors must be reliable and punctualTutors must follow the Companys Dress CodeTutors must follow the Code of EthicsTutors must attend at least 6 hours of professional development per yearMinimum Qualifications:Bachelor's Degree in Italian or Italian EducationAt least 1 year of Italian teaching or Italian tutoring experience (student teaching accepted)Must have reliable transportation to and from the students' homesInterview and ReferencesBenefits of Working with Margot Tutoring Inc:Competitive Pay ($25-35/hr for non-Certified Teachers, $40-$50/hr for Certified Teachers)Flexible SchedulesMonthly Tutor Incentive ProgramsMembership to NTADiscounted show tickets, sports games, travel, and moreTextbooks and Workbooks are providedPaid Professional DevelopmentJob Type: Part-timeExperience:teaching: 1 year (Preferred)tutoring: 1 year (Preferred)Education:Bachelor's (Required)Location:Melville, NY 11747 (Preferred)Work authorization:United States (Required)"}, {"title": "Math Instructor/tutor", "company": "Mathnasium of Fairfield", "location": "Fairfield, CT 06824", "job url": "Not Available", "description": "Part-timeWe are an innovative math-only learning center located in Darien, Greenwich and Fairfield. We have openings at our centers for part-time mathematics tutors. Hours vary, but consist mostly of some afternoons and evenings (after school) and some Saturdays between 10 am  2 pm. You should have a strong grasp of mathematics through pre-calculus and enjoy working and be engaging with children from grades k - 12.Please contact us at 203 259-6284Job Type: Part-timeWork authorization:United States (Required)"}, {"title": "Networking Tutor", "company": "Independence University", "location": "Remote", "job url": "https://www.indeed.com/rc/clk?jk=ce363f1cbeaad18f&from=vj&pos=top", "description": "Part-timeCompany Overview\n\nThe Center for Excellence in Higher Education (CEHE) is a 501(c)(3) non-profit corporation headquartered in Salt Lake City, Utah. CEHE operates degree-granting career colleges throughout the western United States and online. The college brands include Stevens-Henager Colleges in Utah and Idaho; CollegeAmerica in Colorado, Arizona, and Wyoming; California College San Diego, and Independence University (online platform). All of the colleges are accredited by ACCSC, a national accrediting body recognized by the U.S. Department of Education. The colleges offer degree programs from the Associates level through the Masters level in a variety of disciplines including Computer Science, Graphic Arts, Business/Accounting, Medical Specialties, Nursing, and Healthcare. CEHE is an at-will employer.\n\nDisclaimer:\n\nThis specification is intended to indicate managements designation of the positions essential functions, which include the kinds of tasks and levels of work difficulty that will be required of positions given this title, and shall not be construed as declaring the entire description of specific duties and responsibilities of any particular positions. It is not intended to limit, or in any way modify, the right of any supervisor to assign, direct, and control the work of employees under his/her supervision. The use of a particular expression or illustration describing such duties shall not be held to exclude other duties not mentioned. All positions, unless otherwise noted in an offer letter, are 40-hour a week positions, and regular and predictable job attendance is a requirement for all positions. Ability to competently perform all essential duties of the position, with or without reasonable accommodation; a demonstrated commitment to effective customer service delivery; and the ability to work productively as a member of a team or workgroup are basic requirements of all positions at CEHE. This job description is subject to change at any time.\n\n\nCompany Culture\n\nWe are People-Focused - We respect the intelligence and potential of each staff member. We provide a working environment that permits freedom to think, speak, disagree, innovate, create, and initiate. We value and admire ambitious and productive people, and we protect them, encourage them, and create a climate in which they flourish. We love, recognize, and reward producers and performers. In return, we require our employees to have a strong work ethic and be productive. We recruit broadly and select the highest caliber people available - ambitious, knowledgeable, and talented managers, instructors, admissions consultants, and administrators.\n\nSound Values and Virtues - The ethical conduct of our employees is of supreme importance. We hold the following as values and virtues: rationality, purpose, innovation, productiveness, profit, honesty, integrity, justice, and pride. These values are the core of our ethical code. To be ethical means to apply, to work by, and to live by these values and virtues.\n\nCREDO - We are dedicated to helping our students graduate and get a much better job sooner. This is our mission. We pledge to provide the finest career education possible and to graduate satisfied students who have greater knowledge, skills, and self-esteem in the shortest possible time. Our education is high value, clear, and interesting and achieves the highest level of learning and achievement for students. We want to deliver twice as much in half the time.\n\nCEHE is a drug-free environment and we perform drug testing.\n\nEqual Opportunity Employer - We are an equal opportunity employer. No employee, or applicant for employment, shall be discriminated against in any term or condition of employment because of race, color, religion, national origin, sex, age, or sexual orientation. We are constantly striving to make our colleges the best they can be. As an employee, you become part of that mission. We expect a commitment that you will be the best you can be.\n\nI have reviewed the above job description, which sets out the essential job functions of my position, and certify that I can perform all the essential functions with or without an accommodation. If I need an accommodation to perform the essential functions of my job due to a physical or mental impairment, I agree to notify my manager immediately and agree to cooperate with the Company to identify reasonable accommodations that will allow me to perform the essential functions of my job in a satisfactory manner. I further agree to contact Human Resources if I am concerned that the interactive process or the offered accommodations do not adequately address my needs."}, {"title": "Avid Tutor", "company": "North Carolina Public Schools", "location": "Smithfield, NC 27577", "job url": "https://www.indeed.com/rc/clk?jk=786fbca01a3afcf8&from=vj&pos=top", "description": "Avid Tutor\n\n\nDistrict Name\nJohnston County Public Schools\nPosted on\nNov 05, 2018,12:01 AM EST\nExpiration Date\nUntil Filled\nJob Description\nThis is a pool position.\nApplying to this position gives Johnston County Schools the ability to view your portfolio."}, {"title": "TRiO Tutor", "company": "Lake Tahoe Community College", "location": "South Lake Tahoe, CA 96150", "job url": "https://www.indeed.com/rc/clk?jk=136c5943bb0d0eaf&from=vj&pos=top", "description": "Part-time, Temporary, ContractJob Details\nPosition:\nTRiO Tutor\nDepartment:\nTRiO Upward Bound\nDescription:\nOur TRiO programs are looking for people interested in tutoring high school students (ages 14-18) and middle school students (ages 12-14) primarily in the areas of math, lab sciences, literature/composition and foreign languages. We are seeking reliable individuals who must possess good interpersonal communication skills, the ability to work with others, the desire to engage youth, strong organizational skills, and demonstrate sensitivity to the needs of disadvantaged students. Students served in this program are either low income, first generation college students, or show a need for academic support. This is a part-time (up to 10 hrs/wk), temporary position hired on a short-term, temporary contract.\nRepresentative Duties:\nProvide information, advice, support and encouragement to students.\nHelp students stay motivated.\nHelp students understand course material.\nHelp students prepare and study for quizzes, exams, and projects.\nHelp students identify learning styles and improve study skills.\nProvide early referral to support services to ensure academic success.\nProvide early intervention through frequent (weekly) contact with students.\nProvide problem solving assistance appropriate to the individual student.\nHelp build academic success strategies appropriate to the individual student.\nServe as liaison to course instructors, students, and program staff.\nMaintain and report tutor contact log, timesheet and any other materials, to ETS Support Specialist.\nQualifications:\nSubject area of tutor/mentor program.\nTutoring methods and learning strategies and styles.\nCorrect English usage, grammar, spelling, punctuation and vocabulary.\nThe needs and challenges of students with socially and economically disadvantaged backgrounds.\nRequired Documents:\nCover Letter, Resume/CV\nJob Category:\nShort-term Temporary"}, {"title": "PART-TIME: Skills Coaches &amp; Tutors", "company": "Club Xcite", "location": "San Diego, CA", "job url": "Not Available", "description": "$20 - $23 an hourPart-timeSkills Coaches and Tutors: Rewarding Opportunity To Work With Kids! Job DescriptionWe Offer: Flexible Part-Time Hours, Growth Opportunities.Who we are: For over 13 years, Club Xcite has been a leader in providing innovative and quality educational services to children and families. We offer after school academic coaching, tutoring, and enrichment programs dedicated to individual growth and academic success in a fun environment.The Position: Club Xcite is looking to hire experienced Academic Tutors and Executive Functioning and Social Confidence Coaches for many available and upcoming part-time positions.We are looking for candidates who have a background in, or 2+ years of experience working in, any or all of the following: ABA Therapy, Mental Health, ADHD/ADD Coaching, Special Education, Autism Spectrum Disorders, Behavioral Therapy*** These part-time positions would be a great opportunity for those candidates who have a day-time job or are currently enrolled in a graduate program in a related field and are looking for meaningful part-time work weekday afternoons and/or evenings and weekends. ***Position descriptions: TUTORS: Provide 1-1 academic support in all school subject areas and grades.SKILLS COACHES: Skills coaches provide 1-1 services to children with skills deficits in the areas of Social and Executive Functioning skills.Qualifications: - 2+ years of previous experience working with children and/or adolescents (REQUIRED)- Ability to communicate well with others- A degree in related field and/or currently enrolled in related graduate program (MFT in mental health, counseling, social work, etc.) (PREFERRED)- Ability to commit to a minimum of six months- Ability to work independently as well as with a team of caring and motivated professionals- Must have reliable transportation source and availability during weekday afternoonsHours and Pay: PART TIME 3-10 HOURS/WEEK. $20-23/hr starting based upon experience and qualifications, plus paid trainingApply Now: Please attach your most recent and resume OR apply directly through our website http://www.clubxcite.com/contact-us/mentor/Job Type: Part-timeJob Type: Part-timeExperience:working with kids: 2 years (Required)Education:Bachelor's (Preferred)"}, {"title": "Tutor", "company": "North Carolina Public Schools", "location": "Louisburg, NC 27549", "job url": "https://www.indeed.com/rc/clk?jk=0b513aecc61f3fec&from=vj&pos=top", "description": "Part-timeTutor\n\n\nDistrict Name\nFranklin County Schools\nSite/Department Name\nEdward Best Elementary\n4011 NC 56 Hwy East, Louisburg, North Carolina, 27549\nPosted on\nNov 01, 2018,12:01 AM CST\nExpiration Date\nUntil Filled\nJob Description\nTutor-Part Time"}, {"title": "Grammar and writing tutor", "company": "Student Enrichment Academy", "location": "La Habra, CA 90631", "job url": "Not Available", "description": "$15 an hourPart-timeIn need of tutors for a tutoring center located in La Habra. We are not on call, so we need commitment to a set day and time. We hope to have a long term commitment since we work year round. The hours are after school from around 3:30 and after. Please have strong English grammar skills.Job Type: Part-timeSalary: $15.00 /hourExperience:Teaching: 1 year (Preferred)Education:Bachelor's (Preferred)"}, {"title": "Vietnamese Tutor", "company": "QTD International", "location": "Garden Grove, CA 92844", "job url": "Not Available", "description": "Part-timeWe are currently hiring for a fluent Vietnamese Instructor to work with our students that are new to the United States in all academic subject areas (Math, English, Science, and History). Besides, the Vietnamese Instructor will be directly responsible for creating a learning curriculum for each student to assist with their smooth transition into the U.S. school system and adapt to the life here in America.This position requires fluency in English and Vietnamese (speaking, writing, and reading). A CBEST certification is a significant plus. Those currently in the teacher credential, child development, or linguistic field is a bonus.Job Type: Part-timeEducation:Bachelor's (Preferred)Location:Garden Grove, CA 92844 (Preferred)License:CBEST (Preferred)Language:Vietnamese (Required)English (Required)"}, {"title": "SAT/ACT Math Tutor", "company": "Huntington Learning Center", "location": "Del Mar, CA 92014", "job url": "Not Available", "description": "Part-timeAs a leader in the tutoring and test prep industry, our success is attributed not only to our highly acclaimed instructional programs, but to the amazing teams of qualified and devoted professionals who commit themselves to helping students achieve success in school every day.Requirements and qualifications include: 4-year degree requiredSAT/ACT scoreOutstanding communication skillsEnthusiastic, outgoing and team-oriented personalityMust demonstrate care and compassion towards childrenMotivated to take the initiative to ensure that a students time at Huntington is memorableJob Function: Teach students SAT/ACT Math using our curriculum in a one-to-one environmentAdditional Information: We provide training to teachersIf you have not taken SAT/ACT before, take the test at our center to qualify.Math experts are welcome to apply.Students are instructed at our facility.Flexible afternoon, evening and weekend hours available.Job Type: Part-timeEducation:Bachelor's (Required)Work authorization:United States (Required)"}, {"title": "Math Instructor/tutor", "company": "Mathnasium of Fairfield", "location": "Fairfield, CT 06824", "job url": "Not Available", "description": "Part-timeWe are an innovative math-only learning center located in Darien, Greenwich and Fairfield. We have openings at our centers for part-time mathematics tutors. Hours vary, but consist mostly of some afternoons and evenings (after school) and some Saturdays between 10 am  2 pm. You should have a strong grasp of mathematics through pre-calculus and enjoy working and be engaging with children from grades k - 12.Please contact us at 203 259-6284Job Type: Part-timeWork authorization:United States (Required)"}, {"title": "Italian Tutor", "company": "Margot Tutoring Inc", "location": "Melville, NY 11747", "job url": "Not Available", "description": "$25 - $35 an hourPart-timeDesired: Teaching ExperienceTutoringJob Duties and Responsibilities:Tutors will provide 1 hour (60 minutes) of in-home Italian tutoring per student per weekTutors are required to fill out a session form online after each tutoring sessionTutors must keep in touch with their supervisor and the students parents on a regular basisTutors must be reliable and punctualTutors must follow the Companys Dress CodeTutors must follow the Code of EthicsTutors must attend at least 6 hours of professional development per yearMinimum Qualifications:Bachelor's Degree in Italian or Italian EducationAt least 1 year of Italian teaching or Italian tutoring experience (student teaching accepted)Must have reliable transportation to and from the students' homesInterview and ReferencesBenefits of Working with Margot Tutoring Inc:Competitive Pay ($25-35/hr for non-Certified Teachers, $40-$50/hr for Certified Teachers)Flexible SchedulesMonthly Tutor Incentive ProgramsMembership to NTADiscounted show tickets, sports games, travel, and moreTextbooks and Workbooks are providedPaid Professional DevelopmentJob Type: Part-timeExperience:teaching: 1 year (Preferred)tutoring: 1 year (Preferred)Education:Bachelor's (Required)Location:Melville, NY 11747 (Preferred)Work authorization:United States (Required)"}, {"title": "Reading and Math Tutor", "company": "Foundations, Inc.", "location": "Philadelphia, PA", "job url": "Not Available", "description": "$35 an hourPart-timeFoundations, Inc., a national nonprofit organization located in the metropolitan Philadelphia area, is currently seeking experienced, certified Teachers and Reading Specialists to join our team of tutors to work one-on-one with local Philadelphia students who need your help and support to improve their skills. Teachers will provide assessments, tutoring using research-based materials, and progress monitoring to students in Philadelphia.We provide competitive hourly rates and flexible hours (during school hours, after school and Saturdays). Tutoring is provided in student homes and at other public locations such as libraries.Foundations, Inc. is an AA/EOE committed to the development of an inclusive, multicultural community. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, ancestry, national origin, age or sex.Job Type: Part-timeSalary: $35.00 /hourExperience:teaching: 3 years (Preferred)License:Teaching (Required)"}, {"title": "AVID Tutor", "company": "California Connections Academy", "location": "California", "job url": "https://www.indeed.com/rc/clk?jk=2ada1b6b31103a24&from=vj&pos=top", "description": "Company Summary:\n\nFounded in 2001, Connections Education is a leading provider of high-quality, highly accountable online education solutions for schools, school districts, and students in grades K12. It serves families and schools with a variety of digital learning and online school solutions including Connections Academy, International Connections Academy, and Pearson Connexus. In 2017, Connections Education brings full-time online and blended school to 65,000 students across the U.S. and abroad, and delivers online courses to over 340,000 students. In total, over 400,000 students in the U.S. and 48 countries will receive online learning from Connections Education in 2017. Connections Education is based in Baltimore, Maryland and was named a Top Workplace by the Baltimore Sun for the third consecutive year and a 2013 Best Place to Work by Baltimore magazine. Regularly recognized for its outstanding curriculum and leadership, Connections Education is committed to expanding quality education through technology, and helping students achieve both academic and personal success. Connections Education is part of the global education company, Pearson.\n\nPosition Summary and Responsibilities:\n\nUnder direct supervision of the AVID coordinator, tutors perform the following tasks:\n\nBecome trained in Connexus (our online learning platform website) and Adobe Connect Pro\nBecome familiar with the 10-Step AVID Tutorial process.\nParticipate in all required trainings, professional development sessions, and meetings\nBecome familiar with the textbooks and materials used by AVID students.\nEstablish and maintain rapport with students\nTutor students in small study groups or individually via AVID Tutorial LiveLesson online, assisting them in all subject areas based on the class and text notes they have collected in their AVID binders.\nDetermine from student notes and discussions the concepts that need to be taught or re-taught. Facilitate student learning in a challenging, yet supportive tutoring environment\nSet an example of personal excellence and high expectations for all AVID students to follow\nCommunicate frequently and honestly with the AVID coordinator and Administration regarding student progress and areas of concern\nEnrolled in an accredited college or university\nMust have a strong math (Algebra) and science background\nTech savvy\nMust be a former AVID student (with a solid year of experience in the AVID tutorial process)\nOnce trained, you work from home & log in to help our online students during tutorials\nHigh school diploma or equivalent is required"}, {"title": "Tutor/Academic Coach", "company": "The Carraway Center", "location": "Nashville, TN", "job url": "Not Available", "description": "$25 - $40 an hourContractThe Carraway Center for Teaching & Learning is an organization that specializes in applying cognitive and neuroscience research to teaching and learning strategies. Our mission is to help students, parents, and teachers better understand how individual students learn and to equip them with the specific strategies they need to be successful in the classroom.The Carraway Center is Hiring for the Following Positions:- Tutors/Academic Instructors - Immediate needs include the following:- Algebra 1&2- Geometry- Calculus- AP Statistics- Biology- Chemistry- Spanish- ACT Preparation- SAT Preparation- Reading Instructors- Academic Coaching- Executive Function Coaching- Reading Specialist- Low-Vision Instructor- Learning Specialist (background in Mind, Brain & Education, Cognitive Studies, or Neuroscience & Education preferred)Additional Details:- Schedule is flexible and pay is $25-$40/hour depending on qualifications- Carraway Center Location: Green Hills- Instructors work with students of all ages individually or in small group settingsJob Type: ContractSalary: $25.00 to $40.00 /hour"}, {"title": "Tutor Needed, One-On-One for Grades 1-12- $50-125/Hr", "company": "Philadelphia Nanny Network", "location": "Media, PA", "job url": "Not Available", "description": "$50 - $125 an hourPart-timePhiladelphia Nanny Network is currently seeking experienced, certified tutors to work one-on-one with students who need your help and support to improve their skills. We are seeking experienced Tutors who are versed in various subject areas for students between grades 1 and 12. Tutoring is provided in student homes, and jobs are located in Philadelphia and the surrounding counties.Requirements: - Associate Degree required- Teaching certificate preferred- Have verifiable tutor experience with checkable references- Able to provide proof of legal work status in the USCompensation: - $50-125 / hour gross based on background and experienceInterested?- Go to www.nannyagency.com, click on \"Get Started\" and then \"Get Hired\" to fill out Part 1 of our employment application. If you meet the specified requirements you will be able to schedule an appointment to speak with our Recruiter about your job search.Want more information? Visit our YouTube page!- Finding the Right Job For You: https://youtu.be/UYCYJHukEU4- Working as a Nanny: Best Job Ever!: https://youtu.be/6q4Wz5g7PF0- Trouble Finding a Nanny Job?: https://youtu.be/ep_ZvDIRBKkJob Type: Part-timeSalary: $50.00 to $125.00 /hourExperience:professional tutoring: 2 years (Preferred)"}, {"title": "TRiO Tutor", "company": "Lake Tahoe Community College", "location": "South Lake Tahoe, CA 96150", "job url": "https://www.indeed.com/rc/clk?jk=136c5943bb0d0eaf&from=vj&pos=top", "description": "Part-time, Temporary, ContractJob Details\nPosition:\nTRiO Tutor\nDepartment:\nTRiO Upward Bound\nDescription:\nOur TRiO programs are looking for people interested in tutoring high school students (ages 14-18) and middle school students (ages 12-14) primarily in the areas of math, lab sciences, literature/composition and foreign languages. We are seeking reliable individuals who must possess good interpersonal communication skills, the ability to work with others, the desire to engage youth, strong organizational skills, and demonstrate sensitivity to the needs of disadvantaged students. Students served in this program are either low income, first generation college students, or show a need for academic support. This is a part-time (up to 10 hrs/wk), temporary position hired on a short-term, temporary contract.\nRepresentative Duties:\nProvide information, advice, support and encouragement to students.\nHelp students stay motivated.\nHelp students understand course material.\nHelp students prepare and study for quizzes, exams, and projects.\nHelp students identify learning styles and improve study skills.\nProvide early referral to support services to ensure academic success.\nProvide early intervention through frequent (weekly) contact with students.\nProvide problem solving assistance appropriate to the individual student.\nHelp build academic success strategies appropriate to the individual student.\nServe as liaison to course instructors, students, and program staff.\nMaintain and report tutor contact log, timesheet and any other materials, to ETS Support Specialist.\nQualifications:\nSubject area of tutor/mentor program.\nTutoring methods and learning strategies and styles.\nCorrect English usage, grammar, spelling, punctuation and vocabulary.\nThe needs and challenges of students with socially and economically disadvantaged backgrounds.\nRequired Documents:\nCover Letter, Resume/CV\nJob Category:\nShort-term Temporary"}, {"title": "Early Reading and Math Tutor", "company": "The New Century School", "location": "Baltimore, MD 21231", "job url": "Not Available", "description": "Part-timeThe New Century School is a private, independent school in Fells Point in Baltimore. We are seeking an in-house early reading and math tutor to work with our students approximately ten hours per week during school hours. The ideal candidate should have at least one years experience as a tutor. The candidate should also demonstrate the ability to collaborate with the lead teachers, assess student abilities, monitor student progress, and have a solid understanding of Singapore Math.Job Type: Part-timeExperience:tutoring: 1 year (Preferred)"}, {"title": "AP World History Tutor", "company": "A+ IN HOME TUTORS", "location": "Poway, CA", "job url": "Not Available", "description": "$30 an hourPart-timeA+ In Home TutorsSeeking an experienced AP World History Tutor in Poway, CA (NO SKYPE)10th grade college-bound studentIdeal candidate:Bachelor's degree or aboveStrong in World HistoryStudy strategies for SAT AP World History ExamPay: $30 per hourFlexible hours 1-2 per weekPlease email resume and availabilityJob Type: Part-timeSalary: $30.00 /hourExperience:teaching or tutoring: 1 year (Required)Education:Bachelor's (Required)License:Driver's License and auto (Required)Work authorization:United States (Required)"}, {"title": "English Tutor", "company": "AIETA", "location": "New Orleans, LA 70146", "job url": "https://www.indeed.com/rc/clk?jk=1b28b0bd73967f0a&from=vj&pos=top", "description": "$31,000 - $75,000 a yearAIETA Learning Centers go beyond after-school tutoring by offering an innovative approach to enrichment learning. Students Pre-K to 9th grade can enjoy an individualized academic experience. Aligned with Common Core State Standards, AIETA's curriculum helps kids build strong foundations in Math, English, Reading & Writing, and Critical Thinking.\n\nAIETA's program begins with the diagnostic test, which pinpoints a student's fundamental strengths and weaknesses and prescribes a personalized study program. By attending weekly small-group sessions with our instructors, students improve understanding and develop key study skills. Through AIETA after-school program or summer camp, your child can discover a passion for learning at an early age. We are looking for an experienced tutor.\n\nResponsibilities:\n\nTutor students in English and/or mathematics in grade levels from pre-K to 11th grade\nGrade homework assignments, tests, and/or essays (no work is required outside of class time)\nMaintain student progress reports\n\nWork Schedule\n\nWeekdays from 4:00pm to 8:00pm\nWeekends from 9:30am to 4:00pm\nMornings from 5:30am to 9:00am\n\nRequirements:\nRequirements\n\n-College sophomore or higher majoring in English, math, education, or related field\n-Ability to follow instructions and work as a team member\n-Ability to work independently and teach the class on his/her own\n-Ability to deal with students in a caring and confident manner\n-Experience in a tutorial program preferred, but not required. We provide training!\n-Special consideration for those who want to be teachers\n\nBenefits:\nPosition Specifics\n\n-Starting pay up to $18 to $26 per hour (depending on experience).\n-Create a fun and supportive learning environment\n-Instruct and teach students in Math and/or English\n-Keep detailed records of student progress\n-Communicate with parents when needed\n\n"}, {"title": "Tutor", "company": "Alaska Christian College", "location": "Soldotna, AK 99669", "job url": "https://www.indeed.com/rc/clk?jk=0701b04020e670d4&from=vj&pos=top", "description": "PURPOSE: Provide individual and small group tutoring to students in the Academic Success Center. Assist students in improving academic achievement by meeting with them on a regular basis to clarify learning problems and work on study skills. Other assistance might include reviewing class material, discussing the text, predicting test questions, formulating ideas for papers, or working on solutions to problems. Tutoring is a supplement to teaching. Tutors are not expected to know everything about the subject for which they tutor.\n\nRESPONSIBILITIES:\nProvide both scheduled and walk-up tutorial services.\nOversee and create/provide materials for learning communities and/or reading circles as needed.\nKeep accurate records of tutorial sessions, reading circles, and learning communities.\nMaintain integrity in student work and tutorial session.\nProvide feedback on Student Success Center usage to Student Success Center Manager.\nAttend tutor training as provided through the Academic area.\nWith permission of the student, notify Student Success Center Manager and/or the Vice President for Academic Affairs when student concerns in subjects may necessitate a status change for the course.\nWorks with other tutoring staff and ACC volunteers to coordinate services for students.\nCreate/maintain motivating environment for learning.\nCreate activities for mid-term and finals weeks.\nServe as a mentor to one or more students (optional)\nAt the Student Success Center Managers discretion may serve as an ALP advisor to one or more student.\nOther duties as assigned.\n\nREQUIREMENTS:\nMinimum of a Bachelors degree.\nDemonstrate academic excellence.\nUnderstand tutoring practice.\nExcellent interpersonal, written and oral communication skills.\nMust understand and maintain confidentiality of all information seen or heard.\nMust be able to work independently and show good judgment.\nNeeds to be organized and show good time management skills.\nMust have a working knowledge of Windows Office and have good data entry skills.\nMust be reliable and dependable with regular, timely attendance.\nQualified candidates should send the following to April Weber via email (aweber@alaskacc.edu):\n1. Letter of Intent\n2. Resume\n3. Application"}, {"title": "TUTORS Needed (Murrieta Area)", "company": "One on One Learning", "location": "Murrieta, CA", "job url": "Not Available", "description": "$17 - $22 an hourPart-timeOne on One Learningoffers remedial instruction in all subject areas including: Reading, Mathematics, Writing, Language Arts, Science, Social Studies and Test preparation. Programs in these subjects are designed to help students in grades K-12. We are currently seeking well-qualified tutors to help youth in K  12th grades in core subject areas and test preparation during our program in the Murrieta, CA area. You will be working with small groups (max 4 students). We offer competitive pay. To qualify:Availability Mondays through Fridays after school hoursAble to commit the entire school yearAble and willing to work in Murrieta, CA areaHave experience tutoring in one or moreof these areas: Elementary, Middle or High School subjects (reading, math, science or social studies)Test Preparation: SAT, ACT, ASVABSpecial EducationHave a dependable car, an excellent driving record and a valid driver's licenseGenuinely love to work with childrenPay: $17 - $22 per hourJob Type: Part-timeSalary: $17.00 to $22.00 /hourEducation:Associate (Required)Location:Murrieta, CA (Required)"}, {"title": "TUTOR", "company": "ANC ESCO", "location": "Renton, WA", "job url": "Not Available", "description": "$20 - $30 an hourContractANC TUTORINGANC Teachers and Tutors are the foundation of our business and make the greatest impact on our students. ANC Teachers/Tutors must be available after school and weekends within the Renton, Kent, Bellevue, Issaquah and Sammamish areas.We are seeking tutors in the following subject areas. Applicants must address their level of experience in each subject for which they apply, and have relevant college degrees.Mathematics (Pre-algebra through AP Calculus/Statistics)English (Reading, Writing, Vocabulary Development - ESL, Adult learning)Science (Biology, Chemistry, Physics - general through AP)Public SpeakingStandardized Testing (SAT, ACT, SSAT, TOEFL)Expectations:Local travel may be necessary to coordinate with the client's location.Meet with students individually or in small groups after schools or on weekends.Recommend and request textbooks, software, equipment, or other learning materials to complement tutoring.Provide brief written reports of student progress following tutoring sessions.Job Type: ContractSalary: $20.00 to $30.00 /hourExperience:tutoring: 5 years (Preferred)Education:Bachelor's (Required)"}, {"title": "Online Mandarin Tutor", "company": "PandaTree", "location": "Remote", "job url": "https://www.indeed.com/rc/clk?jk=ad4d68839b7f00e1&from=vj&pos=top", "description": "$15 an hourPart-timeDesired: TutoringDo you want to help children learn Mandarin? And are you looking for a fun and flexible part-time job? Join PandaTree! Were passionate about helping kids learn foreign languages. PandaTree delivers high-quality online foreign language tutoring for children using our proprietary video conference platform and engaging curriculum. PandaTree provides a fun and convenient way for students, ages 5 to 15 to learn Mandarin with individualized tutoring sessions and engaging discussions.\nPandaTree is an exciting place to be! We are growing and looking for native-fluency Mandarin-speaking tutors to provide one-on-one tutoring for children via videoconference. Tutors work 15-25 hours of their choosing per week from the comfort of their own home/room.\nJob description:\nTutors help kids learn Mandarin through fun, interesting conversations viavideo-conference. Our focus is on discussing topics the child is passionate about,not word drills.\nDuring the session, the tutor will utilize PandaTrees engagingproprietary content (i.e. photos, poems, and short videos) to spark discussion.\nTutors gently assist the student with new words or corrections as neededwhile adding new words to the students personalized word list.\nTutoring sessions last 25 or 50 minutes. 5-20 minutes of prep time is required before each session. Tutor sessions are recorded for quality purposes and to provide the student with the ability to review the session at a later time.\nRequirements\nArticulate, native-fluency Mandarin speaker with a standard accent\nStrong English speaking skills\nBachelor of Arts, Masters degree or PhD with a focus on education or language\nPatient, kind and FUN. Tutors need an engaging and encouraging presenceover video-conference\nTeaching or tutoring experience and an interest in early childhoodeducation\nPermitted to work in the US\nReliable, high speed internet connection and fast computer\nQuiet, private, interruption-free room to conduct online tutoring sessions\nAbility to be punctual for tutoring sessions is a must\nAvailability afternoons/evenings and weekends preferred\nWilling and able to commit to 9+ months of working with PandaTree\nBenefitsFlexible hours  15 to 25 hours per week; you choose the hours you are availableTime off for holidays and examsWork from your room/home$15 per hourHired as a part-time employeeOngoing coaching, training and development\nPlease include a short cover letter explaining your Mandarin skill level and your interest in or experience with working with children.\nPandaTree is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability status, protected veteran status, or any other characteristic protected by law."}, {"title": "Private Tutor", "company": "Tutoring with Yvette", "location": "Downey, CA", "job url": "Not Available", "description": "$15 - $18 an hourPart-timePlease submit a cover letter with an introduction about yourself and why you feel qualified for this position.In this position, you will work as a private tutor for the company. Responsibilities may include, but not limited to, lesson planning, providing supplemental work, assisting with homework, teaching common core, and much more. You must be able to adjust and cater to each individual child's needs. The grades in which you must be comfortable and confident in tutoring would be from preschool through 12th grade. Also, you must be well versed in various subjects.Hours will vary between: Monday - Thursday: 4pm - 8pmFriday: 4pm - 5pmSaturday: 10:30am -1:30pm (optional)You must be available during all hours listed.QualificationsCollege graduate or currently attending collegeMust be 18 years or olderOne year experience in tutoring/teaching requiredSpanish speaking is a plus but not requiredJob Type: Part-timeSalary: $15.00 to $18.00 /hourExperience:TK-12th grade academic tutoring/teaching: 1 year (Required)Education:Associate (Preferred)Language:Spanish (Preferred)Work authorization:United States (Required)Shifts:Mid-Day (Preferred)Evening (Required)"}, {"title": "English Tutor (K-5)", "company": "Success Stories Learning Center, LLC", "location": "Brooklyn, NY 11236", "job url": "Not Available", "description": "Part-timeJob SummarySuccess Stories Learning Center, LLC provides quality tutoring and test prep services to students in grades K-12. We are seeking experienced and passionate tutors and teachers to foster effective learning and study strategies for our scholars.Training is provided through the on-boarding process.Responsibilities and Duties: Provide individualized content and skill-development tutoring to assigned students (scholars)Review recent homework assignments and test scores, and work through problems or questions that the student did not answer correctly (homework help)Provide scholars with supplemental work to focus on their struggle areasEmploy proven study aides to prepare for upcoming tests and quizzesMaintain accurate and up-to-date records of each tutoring sessionsEffective communication with supervisors and leadershipAttend mandatory staff development trainings and meetingsQualifications and Skills: Bachelors degree preferred, but college students are open to apply2+ years experience tutoring children grades K-5Established proficency in subject matterDetail oriented and comfortable working in a fast-paced office environmentKnowledge of Common Core is a major plus!Great for teachers seeking part-time opportunity!HOURS OF OPERATION: (Schedules are created based on employee availability) 3:00pm-9:00pm Monday-Friday (School Year Hours)9:00am-5:00pm Saturday (WEEKEND AVAILABILITY IS A PLUS!)Job Type: Part-timeExperience:Teaching: 1 year (Preferred)Tutoring: 1 year (Required)Education:Bachelor's (Preferred)Location:Brooklyn, NY (Preferred)Shifts:Mid-Day (Required)Seasonal job:No"}, {"title": "Tutors Needed", "company": "Thrive Academics, Inc.", "location": "Rosemead, CA", "job url": "Not Available", "description": "$20 an hourContractThrive Academics is hiring tutors in Rosemead. We are seeking highly qualified tutors who not only teach the subject, but also help students develop independence in their studies. Our goal is to help our students thrive, so we are looking for people to take academics to another level beyond the worksheets and text books.The pay is $20/hr as an independent contractor.We also require our tutors to take the following assessment: http://thriveacademics.surveytalent.com/survey/5b5ec06283ba886d278b4599Job Type: ContractSalary: $20.00 /hourLocation:Rosemead, CA (Preferred)"}, {"title": "English Tutor", "company": "Mavin Learning Resources", "location": "Arcadia, CA 91006", "job url": "Not Available", "description": "$20 - $25 an hourPart-timeDesired: Teaching ExperienceTutoringOur Learning Center is looking for ESL English Instructors. Our office provides Personalized College Consulting & Application Assistance, College Essays, Academic Tutoring and Test Prep.We want tutors who are passionate about teaching and have fully mastered the subjects they teach to join our expanding team.Under general supervision of Center Administrative Staff, provide instruction to students, work cooperatively with parents and their child to determine educational goals and objectives, create individualized curriculum/learning plans; assist the parents and/or student so that the student can meet or exceed educational standards and reach their full potential; performs other duties as assigned.REQUIREMENTSBachelor's degree in relevant fieldESL Teaching Experience2-5 years of teaching experienceExperience tutoring or teaching high school English highly preferred.RESPONSIBILITIESDevelop curriculum for specific learning.Motivate student to engage in the instruction.Plan, prepare and present lessons tailored towards the student's individual needs and abilities.Ensure each course of study meets the goals and objectives of the student.Evaluate student progress and develop a plan of action for continuing achievement.Prepare instructional materials.Prepare lesson plans to meet goals identified in students' individualized study plans.CANDIDATES ARE EXPECTED TO GIVE A 10 MINUTE DEMONSTRATION LESSON AFTER INTERVIEWJob Type: Part-timeSalary: $20.00 to $25.00 /hourExperience:Teaching: 2 years (Required)Education:Bachelor's (Required)Shifts:Evening (Required)Mid-Day (Required)"}, {"title": "English &amp; Writing Teacher/Tutor", "company": "B# - Be Sharp Academy", "location": "Eastvale, CA", "job url": "Not Available", "description": "Part-timeB# Academy is looking to hire a qualified Writing/English Teacher.We are looking for enthusiastic and experienced teachers who are dedicated to foster the intellectual and social development of children. Teacher/tutor duties include implementing an individualized educational plan and using activities and instructional methods to motivate children and improve their academic skill set. Schedule includes weekdays or weekends.Job Description: Teach Writing/English to students of all agesAssess students performance and progress on a regular basisRequirements: Bachelors Degree (current college students pursuing their degree are also highly encouraged to apply)Teacher certification NOT required, but having one or in the process of attainment is a plusWorking experience as a Writing/English teacher or assistantKnowledge of latest education theories and practices; proactively seeks to stay up to date in subject area(s)Classroom management skills with a student-centered focusBenefits: Excellent working conditions, in a friendly and supportive environmentCompetitive salary (commensurate with experience)Flexible schedulingContact: If interested, please submit your resume and cover letter. Please be sure to include your weekly availability. Only those being considered will be contacted.Job Type: Part-timeExperience:teaching English or Writing: 1 year (Preferred)Classroom Management: 1 year (Preferred)Education:Bachelor's (Preferred)"}, {"title": "Tutor", "company": "QTD International", "location": "Garden Grove, CA 92844", "job url": "Not Available", "description": "Part-timeTutor must possess a passion for helping students learn and have the knowledge and skills to help students find new ways to look at difficult skills and concepts. As a teacher, you must have patience, as many students, you work with will have trouble understanding the content you are trying to help them with. You must also have a positive attitude and know ways to motivate students when they become frustrated by the material they do not understand.Responsibilities:Reports to the Program Principal or Key ManagementTeacher will work with students in their content areas of expertiseTeach students on a one-to-one basis or in small group sessionsProvide specialized instruction in individual subject areasAnswer questions on course contentAid in the comprehension of course materialTeacher is required to attend training sessions that will provide knowledge and practical skills needed to be successfulReview class material with students which may include:Discussing the textPredicting test questionsFormulating ideas for papersWorking on solutions to problemsJob Type: Part-timeExperience:Tutoring: 3 years (Required)Education:Bachelor's (Preferred)Location:Garden Grove, CA 92844 (Preferred)License:CBEST (Preferred)"}, {"title": "Tutor", "company": "ILC-Concepts LLC", "location": "Alexandria, VA 22314", "job url": "Not Available", "description": "$15 - $30 an hourPart-time, Temporary, ContractDesired: TutoringMobile based tutorial services. Pay consistent with experience and educational background. Extensive background checks required. Various locations to choose from to provide services. Requires excellent verbal and written communication skills as well as excellent customer service. Must have a passion for education. Individuals hired will be provided work on a part-time basis. Preferred experience in Math, Science, ESL, Foreign Language, and Test Preparation. Hours available based on demand. Successful candidate must have teaching or tutoring experience otherwise candidate must provide a copy of official college transcript. NOTE: The location provided is the location of the company site. The jobs are located throughout the Washington DC, Maryland, and VIrginia Region.Preferred Qualifications: Experience with Common Core learning, teaching, and prior tutoring experience. Experience working with students with IEPs and Learning disabilities. Job Types: Part-time, Temporary, ContractSalary: $15.00 to $30.00 /hour"}, {"title": "TUTOR", "company": "Duke University and Duke University Health System", "location": "Durham, NC", "job url": "https://www.indeed.com/rc/clk?jk=6d3c96f3b54c2df4&from=vj&pos=top", "description": "Part-timeOcc Summary\n\nNON-DUKE STUDENTS OR PROFESSIONALS WHO TUTOR STUDENTS WHEN DUKE STUDENTS ARE NOT AVAILABLE DURING THE SCHOOL YEAR AND/OR SUMMER SCHOOL, DEPENDING ON THE NEED FOR THESE SERVICES.\n\nWork Performed\nAssist students with learning materials for their courses either in one-on-one or group sessions. Monitor the academic progress of the student. Work with academic advisors to assess the needs and progress of the students\n\nPerform other related duties incidental to the work described herein.\n\nKnowledge, Skills and Abilities\nN/A\n\nLevel Characteristics\nN/A\nDuke University is an Affirmative Action/Equal Opportunity Employercommitted to providing employment opportunity without regard to anindividual's age, color, disability, gender, gender expression, genderidentity, genetic information, national origin, race, religion, sex,sexual orientation, or veteran status.\nDuke aspires to create a community built on collaboration, innovation,creativity, and belonging. Our collective success depends on the robustexchange of ideasan exchange that is best when the rich diversity ofour perspectives, backgrounds, and experiences flourishes. To achievethis exchange, it is essential that all members of the community feelsecure and welcome, that the contributions of all individuals arerespected, and that all voices are heard. All members of our communityhave a responsibility to uphold these values.\nEssential Physical Job Functions:Certain jobs at Duke University and Duke University Health System mayinclude essential job functions that require specific physical and/ormental abilities. Additional information and provision for requests forreasonable accommodation will be provided by each hiring department.\nEducation\nN/A\nExperience\nN/A"}, {"title": "Private English Tutor for Executives", "company": "Fluency Corp", "location": "Houston, TX", "job url": "Not Available", "description": "ContractPlease read carefully before submitting resume to ensure you have enclosed all that we require to set up an interview.We organize language training programs at international companies throughout the world. We are owned and operated by teachers who take great pride in hiring other fantastic teachers. We've spent over 10 years researching the best ways to improve fluency, and we want to find other talented instructors that are as passionate as we are about motivating clients and encouraging their progress through innovative, communication-based, relevant and thoroughly interesting lessons that jump WAY off the page of a book.Fluency Corp is currently looking to find an instructor for a contract in Houston, TX, zip code 77006.Please be near to this location for easy traveling.Contract details:- 4 hours a week in person (2 hours can be on Skype on Fridays)- Mondays and Fridays from 8am to 10am for in person (Fridays can be on Skype).- 6-month minimum commitment: Dec 1 2018 - May 30 2019.-curriculum provided, but you should customize for your client. Relevancy is KEY at all times.Requirements:-2+ years teaching English to adults, accent training a plus.-ability to drive to client's location easily-plan terrific lessons with the guidance of Fluency Corp - books you choose purchased for you by Fluency Corp-meet the specific needs of each student - Relevancy!-write progress reports every 3 months with Fluency Corp template - written expression of progress of student, describing strengths and weaknesses-be early always-true passion for teaching a language and finding ways to get the student excited tooPlease send-your hourly rate-resume-cover letter saying why a contract job is perfect for your schedule-2 references for past Spanish teaching jobs for adults (phone number, name and email)Our motto: Language is learned through relevant, fun, interesting conversation, so let's talk.Job Type: ContractExperience:teaching English to adults: 2 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)"}, {"title": "Contract Tutor", "company": "Viejas", "location": "Alpine, CA", "job url": "https://www.indeed.com/rc/clk?jk=1eb7b91352b3aa1c&from=vj&pos=top", "description": "TemporaryViejas Tribal Education Center is looking for Contract Tutors\n\nResponsibilities:\n Provide tutoring to VTEC students\n Offer assistance with developing study strategies\n Work with the tutee to develop a tutoring plan that fits the students individual needs\n Prepare tutoring sessions to ensure the tutees academic development\n Assess the tutees progress throughout tutoring sessions\n Participate in tutor training and development sessions\n Communicate with parents and teachers\n Track and monitor tutees grades\nRequired Skills\n Demonstrate knowledge and competence in specific the subject matters\n Enjoy tutoring the subject for which services are being provided\n Be able to explain concepts to others effectively\n Effectively communicate study strategies to ensure academic success\n Work comfortably with people from diverse backgrounds\n Possess good organizational skills and complete paperwork in a timely manner\n Exhibit patience and positive attitudes in establishing an encouraging learning environment\n Minimum of an Associates Degree obtained\n Bachelors Degree, Masters Degree and/or Teaching Credential(s) preferred\nRequired Experience"}, {"title": "Title I Tutor", "company": "Silver Lake Regional School District", "location": "Kingston, MA 02364", "job url": "https://www.indeed.com/rc/clk?jk=4189f3619ef4fa54&from=vj&pos=top", "description": "Part-timePart-time, 19.5 hour position focusing on math intervention and instructional support located at Kingston Intermediate School, grades 3-6.The position will provide intervention services for students and feedback to improve the quality of mathematics instruction for 3-5 s students at Kingston Intermediate School. The position will support teachers in mathematics instruction, assessment and intervention; and model scientifically based practices and strategies."}, {"title": "Elementary Tutor Needed", "company": "The Sunshine Method", "location": "Port Charlotte, FL", "job url": "Not Available", "description": "$15 an hourPart-timeThe Sunshine Methodwww.thesunshinemethod.comWho We AreThe Sunshine Method is a powerful one-on-one learning initiative designed to promote education and leadership in youth from diverse backgrounds. We believe in fostering confidence through consistency and commitment to empower students to excel in all areas of life. Originally established in Miami, FL in 2012, The Sunshine Method continues to expand throughout the nation guided by our vision to change the paradigm of education, one student at a time.Our MissionThe Sunshine Method is based on the principle that every child has the right to a quality education. We create individualized student plans to address success both inside and outside of the classroom using one-on-one learning and mentoring sessions with students in the comforts of home! With the Sunshine Method's team of highly skilled professional tutors, our students become independent critical thinkers, actively engaged in discussion and driven to face new challenges with the confidence to succeed.Our TutorsWe are actively looking for motivated and dedicated tutors to join our team. Our goal is to provide effective, high-quality tutoring to students in order to improve their knowledge and confidence both inside and outside the classroom.Our tutors come from a variety of backgrounds including current professors, retired professors, AmeriCorps, Peace Corps, lawyers, accountants, doctors, nurses, university students, masters candidates, and more.All tutors undergo a thorough 3 step interview process and background check to ensure were getting the best tutors and mentors for our students!Required: - Must have at least 2 years of teaching/tutoring experience.- Are highly motivated with a charismatic personality.- Be consistent, compassionate, and committed.- Have afternoon and evening availability.- Be able to commit AT LEAST 6 months.- Must have a clean background completed.- Have a passion for teaching & inspiring student success.- Have excellent communication skills to teach properly.- Know how to motivate children who are struggling in school.- Have reliable transportation.- Ability to pass a background check with W-9.- Allowed to work in the U.S.Job Type: Part-timeSalary: $15/hrJob Type: Part-timeSalary: $15.00 /hourExperience:mentoring: 2 years (Required)tutoring: 2 years (Required)Education:Bachelor's (Required)Location:Port Charlotte, FL 34286 (Required)"}]